Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: list: list all current keys (without argument, this list is displayed) listdefault: list default keys listdiff: list differences between current and default keys (keys added, redefined or deleted) context: name of context ("default" or "search") bind: bind a command to a key or display command bound to key (for context "default") bindctxt: bind a command to a key or display command bound to key, for given context unbind: remove a key binding (for context "default") unbindctxt: remove a key binding for given context reset: reset a key to default binding (for context "default") resetctxt: reset a key to default binding, for given context resetall: restore bindings to the default values and delete ALL personal bindings (use carefully!) missing: add missing keys (using default bindings), useful after installing new WeeChat version When binding a command to a key, it is recommended to use key alt+k (or Esc then k), and then press the key to bind: this will insert key code in command line. For context "mouse" (possible in context "cursor" too), key has format: "@area:key" or "@area1>area2:key" where area can be: *: any area on screen chat: chat area (any buffer) chat(xxx): char area for buffer with name "xxx" (full name including plugin) bar(*): any bar bar(xxx): bar "xxx" item(*): any bar item item(xxx): bar item "xxx" The key can start or end with '*' to match many mouse events. A special value for command with format "hsignal:name" can be used for context mouse, this will send the hsignal "name" with the focus hashtable as argument. Another special value "-" can be used to disable key (it will be ignored when looking for keys). Examples: key alt-x to toggle nicklist bar: /key bind meta-x /bar toggle nicklist key alt-r to jump to #weechat IRC channel: /key bind meta-r /buffer #weechat restore default binding for key alt-r: /key reset meta-r key "tab" to stop search in buffer: /key bindctxt search ctrl-I /input search_stop middle button of mouse on a nick to retrieve info on nick: /key bindctxt mouse @item(buffer_nicklist):button3 /msg nickserv info ${nick}
de: list: zeigt die aktuelle Tastenbelegungen an (Standardaufruf) listdefault: zeigt die Standardeinstellung der Tastenbelegung an listdiff: zeigt die Unterschiede zwischen der aktuell genutzten Tastaturbelegung und der Standardbelegung an (hinzugefügte/verändert/gelöschte Tastenbelegungen) context: Name des Kontextes ("default" oder "search") bind: belegt eine Taste mit einem Befehl oder zeigt an welcher Befehl auf eine Taste gelegt wurde (für Kontext "default") bindctxt: belegt eine Taste mit einem Befehl oder zeigt an welcher Befehl auf eine Taste gelegt wurde, dies trifft für Kontext definierte Tasten zu unbind: hebt eine Tastenbelegung auf (für Kontext "default") unbindctxt: hebt eine Tastenbelegung für den angegebenen Kontext auf reset: die Tastenbelegung wird für die ausgewählte Taste auf die Standardeinstellung zurück gesetzt (für Kontext "default") resetctxt: die Tastenbelegung wird für die ausgewählte Taste auf die Standardeinstellung zurück gesetzt, dies trifft für den ausgewählten Kontext zu resetall: die Tastenbelegung wird auf die Standardeinstellungen zurück gesetzt. Dies löscht ALLE persönlichen Tastenbelegungen (Vorsicht!) missing: fügt fehlende Tastenbelegungen hinzu (dazu wird die Standardbelegung genutzt). Dies kann sinnvoll sein wenn man auf eine neue WeeChat Version umgestiegen ist Falls einer Taste ein Befehl zugeordnet werden soll ist es ratsam zuerst mit der Tastenkombination alt+k (oder Esc + k) einen Fangmodus zu aktivieren um damit die neu zu belegende Taste zu greifen. Durch diesen Schritt wird der entsprechende Tasten-Code in die Befehlszeile übernommen. Für Kontext "mouse" (Kontext "cursor" ist auch möglich), hat der zu verwendende Schlüssel folgendes Format: "@area:Schlüssel" oder "@area1>area2:Schlussel". "area" kann folgende Werte habe: *: jedweder Bereich des Bildschirms chat: Chatbereich (für jeden Buffer) chat(xxx): Chatbereich für einen Buffer mit dem Namen "xxx" (vollständiger Name mit Erweiterung. Beispiel: chat(perl.iset):) bar(*): beliebige Bar bar(xxx): Bar mit dem Namen "xxx" item(*): beliebiges Bar-Item item(xxx): Bar-Item mit Namen "xxx" Der zu nutzende Schlüssel kann mit '*' beginnen oder enden um mehrere unterschiedliche Mausereignisse auszuwählen. Für den Kontext "mouse" kann ein besonderer Übergabewert für den zu nutzenden Befehl verwendet werden, "hsignal:name". Dieses sendet das hsignal "name" und als Inhalt ein Hashtable als Argument. Ein weiterer Übergabewert ist "-" und kann genutzt werden um einen Schlüssel zu deaktivieren (der Schlüssel wird bei der Durchführung übersprungen). Beispiele: Mit der Tastenkombination "alt-x" wird die Nicklist-Bar an-und aus geschaltet: /key bind meta-x /bar toggle nicklist Mit der Tastenkombination "alt-r" wird direkt zum IRC #weechat Buffer gewechselt: /key bind meta-r /buffer #weechat Die Tastenkombination "alt-r" wird auf die Standardfunktion zurückgesetzt: /key reset meta-r "Tab"-Taste nutzen um im Kontext "search" die Suche innerhalb eines Buffers zu beenden: /key bindctxt search ctrl-I /input search_stop Auswahl eines Nicknamens mittels mittlerem Mausknopf zeigt zusätzliche Informationen zu dem Nick an: /key bindctxt mouse @item(buffer_nicklist):button3 /msg nickserv info ${nick}

source: save/apply/reset layout for buffers and windows
de: Layout für Buffer und Fenster speichern, anwenden oder zurücksetzen

source: save: save current layout apply: apply saved layout reset: remove saved layout buffers: save/apply only buffers (order of buffers) windows: save/apply only windows (buffer displayed by each window) Without argument, this command displays saved layout.
de: save: speichert das aktuelle Layout apply: das gespeicherte Layout anwenden reset: das gespeicherte Layout entfernen buffers: speichert/verwendet nur Buffer (Reihenfolge der Buffer) windows: speichert/verwendet nur Fenster (Buffer welche im jeweiligen Fenster dargestellt werden) Wird der Befehl ohne Argumente aufgerufen wird das gespeicherte Layout dargestellt.

source: mouse control
de: Maussteuerung

source: enable: enable mouse disable: disable mouse toggle: toggle mouse delay: delay (in seconds) after which initial mouse state is restored (useful to temporarily disable mouse) To enable/disable mouse at startup, use: /set weechat.look.mouse on/off Examples: enable mouse: /mouse enable toggle mouse for 5 seconds: /mouse toggle 5
de: enable: aktiviert Maus disable: deaktiviert Maus toggle: umschalten der Mausunterstützung delay: Verzögerung (in Sekunden) nach der der ursprüngliche Status wiederhergestellt wird (nützlich um zeitgesteuert die Mausunterstützung zu deaktivieren) Um die Mausunterstützung beim Programmstart ein-/auszuschalten: /set weechat.look.mouse on/off Beispiele: Mausunterstützung aktivieren: /mouse enable Mausunterstützung für 5 Sekunden umschalten: /mouse toggle 5

source: execute a command silently
de: Führt einen Befehl ohne Textausgabe aus

source: -current: no output on current buffer -buffer: no output on specified buffer name: full buffer name (examples: "irc.server.freenode", "irc.freenode.#weechat") -all: no output on ALL buffers command: command to execute silently (a '/' is automatically added if not found at beginning of command) If no target is specified (-current, -buffer or -all), then default is to mute WeeChat core buffer only. Examples: config save: /mute save message to current IRC channel: /mute -current msg * hi! message to #weechat channel: /mute -buffer irc.freenode.#weechat msg #weechat hi!
de: -current: Ausgabe im aktuellen Buffer wird unterdrückt -buffer: Ausgabe im ausgewählten Buffer wird unterdrückt name: vollständiger Buffername (Beispiel: "irc.server.freenode", "irc.freenode.#weechat") -all: Ausgabe wird in ALLEN Buffern unterdrückt command: Ein Befehl der ohne Textausgabe ausgeführt werden soll (das Präfix, '/', wird automatisch hinzugefügt, falls es dem Befehl nicht vorangestellt wurde) Wird kein Buffer ausgewählt (-current, -buffer oder -all), dann wird lediglich die Textausgabe im WeeChat Core Buffer unterdrückt. Beispiele: Speichern der Konfiguration: /mute save Nachricht in den aktuellen Channel senden: /mute -current msg * hi! Nachricht an den #weechat Channel senden: /mute -buffer irc.freenode.#weechat msg #weechat hi!

source: list/load/unload plugins
de: Erweiterungen verwalten (auflisten/installieren/deinstallieren)

source: list: list loaded plugins listfull: list loaded plugins (verbose) load: load a plugin autoload: autoload plugins in system or user directory reload: reload a plugin (if no name given, unload all plugins, then autoload plugins) unload: unload a plugin (if no name given, unload all plugins) filename: plugin (file) to load name: a plugin name arguments: arguments given to plugin on load Without argument, this command lists loaded plugins.
de: list: installierte Erweiterungen werden aufgelistet listfull: detaillierte Auflistung aller installierten Erweiterungen load: installiert eine Erweiterung autoload: installiert automatisch alle Erweiterungen aus dem System- oder Benutzerverzeichnis reload: installiert eine Erweiterung erneut (falls kein Name angegeben wird, werden alle Erweiterungen entfernt und neu installiert) unload: deinstalliere eine oder alle Erweiterungen (wird kein Name angegeben dann werden alle Erweiterung entfernt) filename: Erweiterung (Datei) welche installiert werden soll name: Name einer Erweiterung arguments: Argumente die der Erweiterung beim installieren übergeben werden sollen Ohne Angabe eines Arguments werden alle installierten Erweiterungen angezeigt.

source: manage proxies
de: Proxies verwalten

source: list: list all proxies add: add a new proxy name: name of proxy (must be unique) type: http, socks4 or socks5 address: IP or hostname port: port username: username (optional) password: password (optional) del: delete a proxy (or all proxies with -all) set: set a value for a proxy property option: option to change (for options list, look at /set weechat.proxy.<proxyname>.*) value: new value for option Examples: create a http proxy, running on local host, port 8888: /proxy add local http 127.0.0.1 8888 create a http proxy using IPv6 protocol: /proxy add local http 127.0.0.1 8888 /proxy set local ipv6 on create a socks5 proxy with username/password: /proxy add myproxy socks5 sample.host.org 3128 myuser mypass delete a proxy: /proxy del myproxy
de: list: listet alle Proxies auf add: fügt neuen Proxy hinzu name: Name des neuen Proxy (der Name darf nur einmal genutzt werden) type: http, socks4 oder socks5 address: IP oder Hostname port: Port username: Username (optional) password: Passwort (optional) del: entfernt einen Proxy (-all um alle Proxies zu entfernen) set: setzt einen Wert für Proxy option: Optionen die geändert werden (für eine Liste der möglichen Optionen, bitte folgenden Befehl nutzen: /set weechat.proxy.<proxyname>.*) value: neuer Wert für Option Beispiele: erstellt einen HTTP-Proxy, der auf einem lokalen Host läuft und den Port 8888 nutzt: /proxy add local http 127.0.0.1 8888 erstellt einen HTTP-Proxy der das IPv6 Protokoll nutzt: /proxy add local http 127.0.0.1 8888 /proxy set local ipv6 on erstellt einen socks5-Proxy, mit Username und Passwort: /proxy add myproxy socks5 sample.host.org 3128 myuser mypass entferne einen Proxy: /proxy del myproxy

source: quit WeeChat
de: WeeChat beenden

source: -yes: required if option weechat.look.confirm_quit is enabled arguments: text sent with signal "quit" (for example irc plugin uses this text to send quit message to server)
de: -yes: Option muss genutzt werden falls weechat.look.confirm_quit aktiviert sein sollte arguments: Text der beim Signal "quit" verschickt wird (zum Beispiel sendet die IRC Erweiterung diesen Text als Quit-Nachricht an den Server)

source: reload configuration files from disk
de: Konfiguration neu laden

source: file: configuration file to reload (without extension ".conf") Without argument, all files (WeeChat and plugins) are reloaded.
de: file: Konfigurationsdatei die erneut geladen werden soll (ohne Dateinamenserweiterung ".conf") Ohne Angabe von Argumenten werden alle Konfigurationen (WeeChat und Erweiterungen) neu geladen.

source: execute a command several times
de: Führt einen Befehl mehrfach aus

source: delay: delay between execution of commands (in milliseconds) count: number of times to execute command command: command to execute (a '/' is automatically added if not found at beginning of command) All commands are executed on buffer where this command was issued. Example: scroll 2 pages up: /repeat 2 /window page_up
de: delay: Verzögerung zwischen dem Ausführen der Befehle (in Millisekunden) count: Anzahl wie oft der Befehl ausgeführt werden soll command: Befehl welcher ausgeführt werden soll (das Befehlszeichen '/' wird automatisch hinzugefügt, falls es zum Befehlsbeginn nicht gefunden werden sollte) Alle Befehle werden in dem Buffer ausgeführt, in welchem dieser Befehl genutzt wird. Beispiel: scrolle zwei Seiten hoch: /repeat 2 /window page_up

source: save configuration files to disk
de: Konfiguration abspeichern

source: file: configuration file to save (without extension ".conf") Without argument, all files (WeeChat and plugins) are saved.
de: file: Konfigurationsdatei die gesichert werden soll (ohne Dateinamenserweiterung ".conf") Wird keine Datei angegeben dann werden alle Konfigurationen (WeeChat und Erweiterungen) gesichert.

source: set config options
de: Konfigurationsparameter setzen

source: option: name of an option (can start or end with '*' to list many options) value: new value for option New value can be, according to variable type: boolean: on, off or toggle integer: number, ++number or --number string : any string ("" for empty string) color : color name, ++number or --number For all types, you can use null to remove option value (undefined value). This works only for some special plugin variables. Examples: display options about highlight: /set *highlight* add a word to highlight: /set weechat.look.highlight "word"
de: option: Name der zu ändernden Option (darf mit einem Joker '*' beginnen oder enden um mehrere Optionen anzuzeigen) value: neuer Wert, den die Option erhalten soll Abhängig von der ausgewählten Option, kann die Variable folgenden Inhalt haben: boolean: on, off oder toggle integer: Anzahl, ++Anzahl oder --Anzahl string : jede Zeichenkette ("" für eine leere Zeichenkette) color : Name einer Farbe, ++Anzahl oder --Anzahl Für alle Typen von Variablen kann die Zeichenkette "null" (ohne "") genutzt werden um den Wert der Option zu löschen (undefinierter Wert). Dies kann nur bei einigen Erweiterungen genutzt werden. Beispiele: Zeigt alle Optionen an die etwas mit highlight zu tun haben: /set *highlight* Fügt ein highlight-Wort hinzu: /set weechat.look.highlight "word"

source: unset/reset config options
de: Konfigurationsparameter freigeben/zurücksetzen

source: option: name of an option (may begin or end with "*" to mass-reset options, use carefully!) According to option, it's reset (for standard options) or removed (for optional settings, like server values). Examples: reset one option: /unset weechat.look.item_time_format reset all color options: /unset weechat.color.*
de: option: Name einer Option (darf mit Joker "*" beginnen oder enden um mehrere Optionen zurückzusetzen. Nutzen Sie diese Funktion mit äußerster Sorgfalt!) Gemäß der jeweiligen Option wird diese zurückgesetzt (bei Standard-Optionen) oder komplett entfernt (bei optionalen Einstellungen, zum Beispiel die Server-Einstellungen). Beispiele: Eine Option zurücksetzen: /unset weechat.look.item_time_format Alle Farboptionen zurücksetzen: /unset weechat.color.*

source: upgrade WeeChat without disconnecting from servers
de: Aktualisiert WeeChat ohne die Verbindung zum Server zu trennen

source: path_to_binary: path to WeeChat binary (default is current binary) This command upgrades and reloads a running WeeChat session. The new WeeChat binary must have been compiled or installed with a package manager before running this command. Note: SSL connections are lost during upgrade, because reload of SSL sessions is currently not possible with GnuTLS. There is automatic reconnection after upgrade. Upgrade process has 4 steps: 1. save session into files for core and plugins (buffers, history, ..) 2. unload all plugins (configuration files (*.conf) are written on disk) 3. save WeeChat configuration (weechat.conf) 4. execute new WeeChat binary and reload session.
de: path_to_binary: Pfad zu einer ausführbaren WeeChat Binärdatei (Standardeinstellung ist die aktuell ausführbare Datei) Dieser Befehl führt ein Upgrade von WeeChat durch und startet die laufende Sitzung neu. Die neue Version von WeeChat muss deshalb vorab kompiliert oder mit einem Paketmanager installiert worden sein, bevor der Befehl ausgeführt werden kann. Hinweis: SSL Verbindungen werden während eines Upgrades unterbrochen, da solche Verbindungen zur Zeit nicht mit GnuTLS gehalten werden können. Nach einem erfolgten Upgrade findet eine automatische Verbindung zu diesen Servern statt. Der Upgrade Vorgang besteht aus vier Schritten: 1. Speicherung der Session in Dateien für Core und Erweiterungen (buffers, history, ..) 2. alle Erweiterungen werden ausgeschaltet (Konfigurationen *.conf werden gesichert) 3. Speicherung der WeeChat Konfiguration (weechat.conf) 4. ausführen einer neuen WeeChat Session.

source: show WeeChat uptime
de: Zeigt die Uptime von Weechat an

source: -o: send uptime to current buffer as input (english string) -ol: send uptime to current buffer as input (translated string)
de: -o: sendet die WeeChat Laufzeit in den aktuellen Buffer (englisch) -ol: sendet die WeeChat Laufzeit in den aktuellen Buffer (in der voreingestellten Landessprache)

source: show WeeChat version and compilation date
de: Zeigt die WeeChat-Version und das Datum der Kompilierung an

source: -o: send version to current buffer as input (english string) -ol: send version to current buffer as input (translated string)
de: -o: sendet die WeeChat Version in den aktuellen Buffer (englisch) -ol: sendet die WeeChat Version in den aktuellen Buffer (in der Voreingestellten Landessprache)

source: schedule a command execution in future
de: Terminiere einen Befehl der ausgeführt werden soll

source: number: amount of time to wait (integer number) unit: optional, values are: ms: milliseconds s: seconds (default) m: minutes h: hours command: command to execute (or text to send to buffer if command does not start with '/') Note: command is executed on buffer where /wait was executed (if buffer is not found (for example if it has been closed before execution of command), then command is executed on WeeChat core buffer). Examples: join channel in 10 seconds: /wait 10 /join #test set away in 15 minutes: /wait 15m /away -all I'm away say 'hello' in 2 minutes: /wait 2m hello
de: number: die Zeit, die gewartet werden soll (dies muss eine natürlich Zahl sein) unit: mögliche Werte (optional): ms: Millisekunden s: Sekunden (Vorgabewert) m: Minuten h: Stunden command: Befehl der ausgeführt werden soll (ohne das führende '/') oder ein Text der in dem Buffer ausgegeben werden soll Hinweis: Der Befehl der Zeit verzögert gestartet werden soll wird im selben Buffer ausgeführt in dem auch der /wait Befehl aufgerufen wurde. Falls der Buffer nicht gefunden werden kann, da er in der Zwischenzeit zum Beispiel geschlossen wurde, wird der Befehl im WeeChat Core-Buffer ausgeführt. Beispiele: Betritt nach 10 Sekunden den Channel #test: /wait 10 /join #test Setzt nach 15 Minuten eine globale Abwesenheit: /wait 15m /away -all Bin dann mal eben weg Versendet nach zwei Minuten den Text 'Hallo': /wait 2m Hallo

source: manage windows
de: Fenster verwalten

source: list: list opened windows (without argument, this list is displayed) -1: jump to previous window +1: jump to next window b#: jump to next window displaying buffer number # up: switch to window above current one down: switch to window below current one left: switch to window on the left right: switch to window on the right number: window number (see /window list) splith: split current window horizontally splitv: split current window vertically resize: resize window size, new size is <pct> percentage of parent window balance: balance the sizes of all windows merge: merge window with another (all = keep only one window) page_up: scroll one page up page_down: scroll one page down refresh: refresh screen scroll: scroll a number of lines (+/-N) or with time: s=seconds, m=minutes, h=hours, d=days, M=months, y=years scroll_horiz: scroll horizontally a number of columns (+/-N) or percentage of window size (this scrolling is possible only on buffers with free content) scroll_up: scroll a few lines up scroll_down: scroll a few lines down scroll_top: scroll to top of buffer scroll_bottom: scroll to bottom of buffer scroll_previous_highlight: scroll to previous highlight scroll_next_highlight: scroll to next highlight swap: swap buffers of two windows (with optional direction for target window) zoom: zoom on window For splith and splitv, pct is a percentage which represents size of new window, computed with current window as size reference. For example 25 means create a new window with size = current_size / 4 Examples: jump to window displaying buffer #1: /window b1 scroll 2 lines up: /window scroll -2 scroll 2 days up: /window scroll -2d scroll to beginning of current day: /window scroll -d zoom on window #2: /window zoom -window 2
de: list: listet die geöffneten Fenster (ohne Angabe von Parametern wird diese Funktion aufgerufen) -1: springt zum vorherigen Fenster +1: springt zum nächsten Fenster b#: springt zum nächsten Fenster, welches die Buffer Nummer # besitzt up: wechselt zum Fenster über dem aktuellen down: wechselt zum Fenster unter dem aktuellen left: wechselt zum linken Fenster right: wechselt zum rechten Fenster number: Nummer des Fensters (siehe /window list) splith: teilt das aktuelle Fenster horizontal splitv: teilt das aktuelle Fenster vertikal resize: verändert die Größe des aktuellen Fensters. Die neue Größe des Fensters ist prozentual <pct> zum Stammfensters groß balance: passt die Größe aller Fenster an merge: vereinigt Fenster miteinander (all = alle Fenster vereinigen) page_up: scrollt eine Seite nach oben page_down: scrollt eine Seite nach unten refresh: Seite wird neu aufgebaut scroll: scrollt eine Anzahl an Zeilen (+/-N) oder zu einer gewissen Zeit: s=Sekunden, m=Minuten, h=Stunden, d=Tage, M=Monate, y=Jahre scroll_horiz: scrollt horizontal eine Anzahl an Spalten (+/-N) oder prozentual von der Fenstergröße ausgehend (dieses scrolling ist nur in Buffern möglich die über einen freien Inhalt verfügen) scroll_up: scrollt ein paar Zeilen nach oben scroll_down: scrollt ein paar Zeilen nach unten scroll_top: scrollt zum Anfang des Buffers scroll_bottom: scrollt zum Ende des Buffers scroll_previous_highlight: scrollt zum vorherigen Hightlight scroll_next_highlight: scrollt zum nächsten Highlight swap: tauscht die Buffer von zwei Fenstern (mit optionaler Angabe für das Zielfenster) zoom: vergrößert ein Fenster auf 100% Bei splith und splitv gibt "pct" die neue Größe des Fensters im Verhältnis zur aktuellen Größe an. Zum Beispiel würde ein Wert von 25 bedeuten, dass das neue Fenster nur noch ein Viertel der Größe des alten Fensters hat. Beispiele: springt zum Fenster mit dem Buffer #1: /window b1 scrollt zwei Zeilen hoch: /window scroll -2 scrollt zwei Tage hoch: /window scroll -2d /window scroll -2d scrollt zum Beginn des aktuellen Tages: /window scroll -d Fenster #2 wird vergrößert: /window zoom -window 2

source: %sError: missing arguments for "%s" command
de: %sFehler: fehlende Argumente für den Befehl "%s"

source: names of buffers
de: Auflistung der vorhandenen Buffer

source: numbers of buffers
de: Anzahl der Buffer
