Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: list: list buffers (without argument, this list is displayed) clear: clear buffer content (number for a buffer, -merged for merged buffers, -all for all buffers, or nothing for current buffer) move: move buffer in the list (may be relative, for example -1) merge: merge current buffer to another buffer (chat area will be mix of both buffers) (by default ctrl-x switches between merged buffers) unmerge: unmerge buffer from other buffers which have same number close: close buffer (number/range or name is optional) notify: set notify level for current buffer: this level determines whether buffer will be added to hotlist or not: none: never highlight: for highlights only message: for messages from users + highlights all: all messages reset: reset to default value (all) localvar: display local variables for current buffer set: set a property for current buffer get: display a property of current buffer number: jump to buffer by number, possible prefix: '+': relative jump, add number to current '-': relative jump, sub number to current '*': jump to number, using option "weechat.look.jump_current_to_previous_buffer" name: jump to buffer by (partial) name Examples: clear current buffer: /buffer clear move buffer to number 5: /buffer move 5 merge with core buffer: /buffer merge 1 unmerge buffer: /buffer unmerge close current buffer: /buffer close close buffers 5 to 7: /buffer close 5-7 jump to #weechat: /buffer #weechat jump to next buffer: /buffer +1
de: list: alle geöffneten Buffer werden aufgelistet (Standardvorgabe) clear: leert den Bufferinhalt. Entweder durch Angabe der Buffer-Nummer, -merged für zusammengefügte Buffer, -all für alle Buffer. Ohne Angabe eines Arguments wird der aktuelle Buffer gelöscht move: Buffer in der Liste verschieben (kann auch relativ sein, z.B. -1) merge: fügt den aktuellen Buffer mit einem anderen Buffer zusammen (bei einem Chat-Buffer entsteht ein Mix aus beiden Buffern (Bei der Standardtastenbelegung kann mittels "CTRL-x" zwischen zusammengefügten Buffern umgeschaltet werden) unmerge: trennt Buffer wieder voneinander, falls zwei Buffer die selbe Nummer teilen close: Buffer schließen (Nummer oder Bereich ist optional) notify: setzt Benachrichtigung-Status für aktuellen Buffer. Folgende Möglichkeiten bestimmen den Grad der Benachrichtigung: none: keine Benachrichtigung highlight: Benachrichtigung bei hervorgehobenen Nachrichten (Highlights) message: Benachrichtigung bei Nachrichten von Usern + Highlights all: Benachrichtigung bei allen Nachrichten reset: auf Standardwert zurück setzen (all) localvar: zeigt die lokalen Variablen für den aktuellen Buffer an set: setzt eine Eigenschaft für aktuellen Buffer get: zeigt eine Eigenschaft für den aktuellen Buffer an number: Sprung von einem Buffer zu einem anderen, mögliche Optionen: '+': relativer Sprung um 'n'-Buffer '-': relativer Sprung, um 'n'-Buffer '*': springt zum Buffer mit der Nummer 'n', nutzt die interne Option "weechat.look.jump_current_to_previous_buffer" name: springt zum Buffer mit dem Namen 'xyz' Beispiele: leert den aktuellen Buffer: /buffer clear verschiebt Buffer auf Position 5: /buffer move 5 verbindet Buffer mit dem Core-Buffer: /buffer merge 1 trennt Buffer voneinander: /buffer unmerge schließt aktuellen Buffer: /buffer close schließt Buffer 5 bis 7: /buffer close 5-7 wechselt zum Buffer: #weechat: /buffer #weechat wechselt zum nächsten Buffer: /buffer +1

source: define color aliases and display palette of colors
de: definiert Farbaliase und stellt eine Palette der möglichen Farben dar

source: alias: add an alias for a color unalias: delete an alias color: color number (greater than or equal to 0, max depends on terminal, commonly 63 or 255) name: alias name for color (for example: "orange") reset: reset all color pairs (required when no more color pairs are available if automatic reset is disabled, see option weechat.look.color_pairs_auto_reset) Without argument, this command displays colors in a new buffer. Examples: add alias "orange" for color 214: /color alias 214 orange delete color 214: /color unalias 214
de: alias: weist einer Farbzahl einen Namen zu unalias: entfernt einen Namen color: Farbnummer (>= 0, maximale Anzahl ist abhängig vom Terminal, üblicherweise 63 oder 255 Farben) name: Aliasname für eine Farbe (zum Beispiel: "orange") reset: setzt alle Farbpaarungen zurück (nützlich falls keine Farbpaarung mehr verfügbar sein sollte und die automatische Reset-Option deaktiviert ist, siehe Option: weechat.look.color_pairs_auto_reset) Ohne Angabe von Argumenten wird in einem separaten Buffer die darstellbare Farbpalette angezeigt. Beispiele: der Farbe 214 wird das Alias "orange" zugeordnet: /color alias 214 orange löscht die Farbe 214: /color unalias 214

source: launch explicit WeeChat or plugin command
de: führe explizit einen WeeChat Befehl oder eine Erweiterung aus

source: plugin: plugin name ('weechat' for WeeChat internal command) command: command to execute (a '/' is automatically added if not found at beginning of command)
de: Erweiterung: Name der Erweiterung ('weechat' für interne WeeChat Befehle) Befehl: auszuführender Befehl (es wird automatisch ein '/' vorangestellt, falls dieser nicht angegeben wurde)

source: free movement of cursor on screen to execute actions on specific areas of screen
de: Cursor kann frei auf dem Bildschirm bewegt werden um Aktionen in bestimmten Arealen auszuführen

source: go: move cursor to chat area, a bar (using bar name) or coordinates "x,y" move: move cursor with direction stop: stop cursor mode Without argument, this command toggles cursor mode. When mouse is enabled (see /help mouse), by default a middle click will start cursor mode at this point. Examples: go to nicklist: /cursor go nicklist go to coordinates x=10, y=5: /cursor go 10,5
de: go: setzt den Cursor in den Chat Bereich, in eine Bar (Name der Bar muss angegeben werden) oder auf die Koordinaten "x,y" move: Cursor wird in die entsprechende Richtung bewegt stop: beendet den Cursor-Modus Ohne Angabe von Argumenten wird der Cursor-Modus umgeschaltet. Ist die Mausfunktion aktiviert (siehe /help mouse), startet man den Cursor-Modus mit der mittleren Maustaste und positioniert den Cursor an diesen Punkt. Beispiele: gehe zur Nickliste: /cursor go nicklist gehe zu den Koordinaten x=10, y=5: /cursor go 10,5

source: control debug for core/plugins
de: Debug-Kontrolle für Hauptprogramm und/oder Erweiterung

source: list: list plugins with debug levels set: set debug level for plugin plugin: name of plugin ("core" for WeeChat core) level: debug level for plugin (0 = disable debug) dump: save memory dump in WeeChat log file (same dump is written when WeeChat crashes) buffer: dump buffer content with hexadecimal values in log file color: display infos about current color pairs cursor: toggle debug for cursor mode hdata: display infos about hdata (with free: remove all hdata in memory) infolists: display infos about infolists memory: display infos about memory usage mouse: toggle debug for mouse tags: display tags for lines term: display infos about terminal windows: display windows tree
de: list: zeigt alle Erweiterungen mit Debuglevel an set: setzt den Level der Protokollierung für eine Erweiterung plugin: Name der Erweiterung ("core" für den WeeChat Kern) level: Debuglevel der Erweiterung (0 = deaktiviert das Debug) dump: Speicherabbild in die WeeChat Protokolldatei schreiben (wie bei einem Programmabsturz) buffer: speichert den Bufferinhalt als hexadezimale Ausgabe in die Protokolldatei color: zeigt Informationen über die aktuellen Farbpaarungen an cursor: schaltet den debug-Modus für den Cursor-Modus ein/aus hdata: zeigt Informationen zu hdata an (mittels free werden alle hdata Informationen aus dem Speicher entfernt) infolists: zeigt Information über die Infolists an memory: gibt Informationen über den genutzten Speicher aus mouse: schaltet den debug-Modus für den Maus-Modus ein/aus tags: zeigt für jede einzelne Zeile die dazugehörigen Tags an term: gibt Informationen über das Terminal und verfügbare Farben aus windows: zeigt die Fensterstruktur an

source: filter messages in buffers, to hide/show them according to tags or regex
de: Filterfunktion um Nachrichten in Buffern zu aus- oder einzublenden, dazu können Tags oder regulären Ausdrücken verwendet werden

source: list: list all filters enable: enable filters (filters are enabled by default) disable: disable filters toggle: toggle filters name: filter name add: add a filter del: delete a filter -all: delete all filters buffer: comma separated list of buffers where filter is active: - this is full name including plugin (example: "irc.freenode.#weechat") - "*" means all buffers - a name starting with '!' is excluded - name can start or end with '*' to match many buffers tags: comma separated list of tags, for example: "irc_join,irc_part,irc_quit" regex: regular expression to search in line - use '\t' to separate prefix from message, special chars like '|' must be escaped: '\|' - if regex starts with '!', then matching result is reversed (use '\!' to start with '!') - two regular expressions are created: one for prefix and one for message The default key alt+'=' toggles filtering on/off. Tags most commonly used: no_filter, no_highlight, no_log, log0..log9 (log level), notify_none, notify_message, notify_private, notify_highlight, nick_xxx (xxx is nick in message), irc_xxx (xxx is command name or number, see /server raw), irc_numeric, irc_error, irc_action, irc_ctcp, irc_ctcp_reply, irc_smart_filter, away_info. To see tags for lines in buffers: /debug tags Examples: use IRC smart filter on all buffers: /filter add irc_smart * irc_smart_filter * use IRC smart filter on all buffers except those with "#weechat" in name: /filter add irc_smart *,!*#weechat* irc_smart_filter * filter all IRC join/part/quit messages: /filter add joinquit * irc_join,irc_part,irc_quit * filter nicks displayed when joining channels or with /names: /filter add nicks * irc_366 * filter nick "toto" on IRC channel #weechat: /filter add toto irc.freenode.#weechat nick_toto * filter lines containing "weechat sucks" on IRC channel #weechat: /filter add sucks irc.freenode.#weechat * weechat sucks
de: list: alle Filter auflisten enable: Filter wird aktiviert (Filter werden standardmäßig aktiviert) disable: Filter deaktivieren toggle: Filter de-/aktivieren name: Name des Filters add: Filter hinzufügen del: Filter entfernen -all: entfernt alle Filter buffer: durch Kommata getrennte Liste von Buffern in denen der Filter aktiv sein soll: - ist der vollständige Name eines Buffers inklusive seiner Erweiterung (Beispiel: "irc.freenode.#weechat") - "*" bedeutet alle Buffer - beginnt ein Name mit '!' wird für diesen Buffer kein Filter genutzt - ein Name darf mit '*' beginnen oder enden um mehrere Buffer auszuwählen tags: durch Kommata getrennte Liste mit Tags. Zum Beispiel: "irc_join,irc_part,irc_quit" regex: regulärer Ausdruck um in einer Zeile zu suchen - das Präfix (z.B. Nick) wird mittels '\t' von der Nachricht getrennt. Sonderzeichen wie '|' müssen mit einer Escapesequenz : '\|' eingebunden werden) - wird ein regulärer Ausdruck mit '!' eingeleitet dann wird das übereinstimmende Ergebnis umgekehrt (nutze '\!' um mit '!' zu beginnen) - es werden zwei reguläre Ausdrücke erstellt: Der erste für den Präfix und der zweite für die eigentliche Nachricht Die Tastenvoreinstellung alt+'=' schaltet die Filterfunktion an/aus. Die am häufigsten gebrauchten Tags lauten: no_filter, no_highlight, no_log, log0..log9 (log Level), notify_none, notify_message, notify_private, notify_highlight, nick_xxx (xxx ist durch den Nicknamen zu ersetzen), irc_xxx (xxx ist durch einen IRC-Befehl/-Nummer zu ersetzen, siehe /server raw) irc_numeric, irc_error, irc_action, irc_ctcp, irc_ctcp_reply, irc_smart_filter, away_info. Um sich die Tags jeder einzelnen Zeile darstellen zu lassen: /debug tags Beispiele: aktiviert einen einfachen IRC Filter für join/part/quit/nick Nachrichten für alle Buffer: /filter add irc_smart * irc_smart_filter * aktiviert einen einfachen IRC Filter für join/part/quit/nick Nachrichten der für alle Buffer genutzt wird, außer Buffer die "#weechat" im Namen tragen: /filter add irc_smart *,!*#weechat* irc_smart_filter * filtert alle IRC join/part/quit Nachrichten: /filter add joinquit * irc_join,irc_part,irc_quit * filtert Nicks wenn diese den Channel betreten oder durch den Befehl "/names:" angezeigt werden: /filter add nicks * irc_366 * filtert Nick "toto" im IRC Channel #weechat: /filter add toto irc.freenode.#weechat nick_toto * filtert Zeilen die "weechat sucks" im IRC Channel #weechat enthalten: /filter add sucks irc.freenode.#weechat * weechat sucks

source: display help about commands and options
de: Zeigt einen Hilfstext für Befehle und Optionen an

source: -list: list commands, by plugin (without argument, this list is displayed) -listfull: list commands with description, by plugin plugin: list commands for this plugin command: a command name option: an option name (use /set to see list)
de: -list: zeigt alle Befehle, nach Erweiterungen sortiert (ohne Angabe von Argumente wird diese Liste ausgegeben) -listfull: zeigt alle Befehle mit Beschreibung, nach Erweiterung plugin: zeigt Befehle explizit für diese Erweiterung an command: Name eines Befehls option: Name einer Option (nutze /set um Optionen anzeigen zu lassen)

source: show buffer command history
de: Zeigt den Befehlsverlauf des Buffers

source: clear: clear history value: number of history entries to show
de: clear: löscht den Befehlsverlauf value: Anzahl der gewünschten Einträgen im Befehlsverlauf anzeigen

source: functions for command line
de: Funktionen für die Befehlszeile

source: list of actions: return: simulate key "enter" complete_next: complete word with next completion complete_previous: complete word with previous completion search_text: search text in buffer search_switch_case: switch exact case for search search_previous: search previous line search_next: search next line search_stop: stop search delete_previous_char: delete previous char delete_next_char: delete next char delete_previous_word: delete previous word delete_next_word: delete next word delete_beginning_of_line: delete from beginning of line until cursor delete_end_of_line: delete from cursor until end of line delete_line: delete entire line clipboard_paste: paste from clipboard transpose_chars: transpose two chars undo: undo last command line action redo: redo last command line action move_beginning_of_line: move cursor to beginning of line move_end_of_line: move cursor to end of line move_previous_char: move cursor to previous char move_next_char: move cursor to next char move_previous_word: move cursor to previous word move_next_word: move cursor to next word history_previous: recall previous command in current buffer history history_next: recall next command in current buffer history history_global_previous: recall previous command in global history history_global_next: recall next command in global history jump_smart: jump to next buffer with activity jump_last_buffer: jump to last buffer jump_last_buffer_displayed: jump to last buffer displayed (before last jump to a buffer) jump_previously_visited_buffer: jump to previously visited buffer jump_next_visited_buffer: jump to next visited buffer hotlist_clear: clear hotlist grab_key: grab a key (optional argument: delay for end of grab, default is 500 milliseconds) grab_key_command: grab a key with its associated command (optional argument: delay for end of grab, default is 500 milliseconds) grab_mouse: grab mouse event code grab_mouse_area: grab mouse event code with area scroll_unread: scroll to unread marker set_unread: set unread marker for all buffers set_unread_current_buffer: set unread marker for current buffer switch_active_buffer: switch to next merged buffer switch_active_buffer_previous: switch to previous merged buffer insert: insert text in command line This command is used by key bindings or plugins.
de: Auflistung der Aktionen: return: simuliert die "enter" Taste complete_next: vervollständigt Wort mit nächster Komplettierung complete_previous: vervollständigt Word mit vorheriger Komplettierung search_text: sucht nach Text im Buffer search_switch_case: schaltet Groß-/Kleinschreibung ein und aus search_previous: sucht vorheriger Zeile search_next: sucht nächste Zeile search_stop: suche stoppen delete_previous_char: entfernt vorheriges Zeichen delete_next_char: entfernt nächstes Zeichen delete_previous_word: entfernt vorheriges Wort delete_next_word: entfernt nächstes Wort delete_beginning_of_line: entfernt alle Zeichen ab Zeilenanfang bis zum Cursor delete_end_of_line: entfernt alle Zeichen ab Cursor bis zum Ende der Zeile delete_line: löscht die komplette Eingabezeile clipboard_paste: fügt Zeichenkette aus der Zwischenablage ein transpose_chars: Zeichen austauschen undo: letzten Befehl in der Eingabezeile rückgängig machen redo: letzten Befehl in der Eingabezeile wiederherstellen move_beginning_of_line: springt an den Anfang der Eingabezeile move_end_of_line: springt ans Ende der Eingabezeile move_previous_char: setzt den Cursor eine Position nach links move_next_char: setzt den Cursor eine Position nach rechts move_previous_word: springt zum Anfang des vorherigen Wortes, in der Eingabezeile move_next_word: springt zum Anfang des nächsten Wortes, in der Eingabezeile history_previous: ruft vorherigen Befehl oder Nachricht aus dem Befehlsspeicher auf (im Such-Modus: rückwärts suchen) history_next: ruft nächsten Befehl oder Nachricht aus dem Befehlsspeicher auf (im Such-Modus: vorwärts suchen) history_global_previous: ruft vorherigen Befehl/Nachricht aus dem globalen Befehlsspeicher auf (für alle Buffer) history_global_next: ruft nächsten Befehl/Nachricht aus dem globalen Befehlsspeicher auf (für alle Buffer) jump_smart: wechselt zum nächsten Buffer mit Aktivität (nach Priorität: highlight, Nachricht, …) jump_last_buffer: springt zum letzten Buffer, in der Bufferliste jump_last_buffer_displayed: wechselt zum jeweils zuletzt angezeigten Buffer jump_previously_visited_buffer: springt zum letzten besuchten Buffer jump_next_visited_buffer: springt zum nächsten besuchten Buffer hotlist_clear: löscht Hotliste (Aktivitätsanzeige für die Buffer) grab_key: fängt eine Taste (optionales Argument: Verzögerung um eine Taste einzufangen. Standard sind 500 Millisekunden) grab_key_command: zeigt den Tastencode (inklusive des eingebundenen Befehls) einer Tastenkombination an und fügt ihn in die Befehlszeile ein (optionales Argument: Verzögerung um eine Taste einzufangen. Standard sind 500 Millisekunden) grab_mouse: fängt den Code einer Maus Aktivität grab_mouse_area: fängt den Code einer Maus Aktivität mit Bereich scroll_unread: springe zur ersten ungelesenen Zeile im Buffer set_unread: setzt die ungelesen Markierung für alle Buffer set_unread_current_buffer: setzt die ungelesen Markierung für den aktuellen Buffer switch_active_buffer: springt zum nächsten zusammengefügten Buffer switch_active_buffer_previous: springt zum vorherigen zusammengefügten Buffer insert: fügt einen Text in die Eingabezeile ein Dieser Befehl wird durch Tastenbelegungen oder Erweiterungen genutzt.

source: bind/unbind keys
de: Einer Taste einen Befehl zuordnen oder entfernen
