Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: %s%s: cannot find available port for xfer
de: %s%s: Kann keinen freien Port für den Transfer ermitteln

source: %s%s: error creating xfer
de: %s%s: Fehler bei Transfererstellung

source: %s%s: unable to resume file "%s" (port: %d, start position: %llu): xfer not found or not ready for transfer
de: %s%s: Kann die Datei "%s" nicht fortsetzen (Port: %d, Startposition: %llu): xfer nicht gefunden oder nicht bereit für Transfer

source: %s: file %s resumed at position %llu
de: %s: Datei %s wird an Position %llu fortgesetzt

source: %s%s: unable to accept resume file "%s" (port: %d, start position: %llu): xfer not found or not ready for transfer
de: %s%s Kann die Datei "%s" zum Fortsetzen der Übertragung nicht akzeptieren (Port: %d, Startposition: %llu): xfer nicht gefunden oder nicht bereit für Transfer

source: %s%s: aborting active xfer: "%s" from %s
de: %s%s: aktiver Transfer (xfer): "%s" von %s abgebrochen

source: %s%s: error sending data to "%s" via xfer chat
de: %s%s: Fehler beim Senden von Daten an "%s" via Transfer-Chat

source: Connected to %s (%d.%d.%d.%d) via xfer chat
de: Verbindung zu %s (%d.%d.%d.%d) via Transfer-Chat aufgebaut

source: %s%s: can't find xfer for buffer "%s"
de: %s%s: Kann keinen Transfer für Buffer "%s" finden

source: Xfer list:
de: Transfer-Liste:

source: %3d. %s (%s), file: "%s" (local: "%s"), %s %s, status: %s%s%s (%llu %%)
de: %3d. %s (%s), Datei: "%s" (lokal: "%s"), %s %s, Status: %s%s%s (%llu %%)

source: %3d. %s, chat with %s (local nick: %s), started on %s, status: %s%s
de: %3d. %s, Der Chat mit %s (lokaler Nick: %s), wurde am %s gestartet, Status: %s%s

source: plugin: %s (id: %s), file: %llu bytes (position: %llu), address: %d.%d.%d.%d (port %d)
de: Erweiterung: %s (id: %s), Datei: %llu Bytes (Position: %llu), Adresse: %d.%d.%d.%d (Port %d)

source: fast_send: %s, blocksize: %d, started on %s
de: schnelles_senden: %s, Blockgröße: %d, gestartet am %s

source: yes
de: Ja

source: no
de: keine

source: No xfer
de: Kein Transfer (xfer)

source: send a CTCP action to remote host
de: Sendet CTCP Aktion an entfernten Host

source: xfer control
de: Transfer-Steuerung

source: list: list xfer listfull: list xfer (verbose) Without argument, this command opens buffer with xfer list.
de: list: zeigt Liste der Übertragungen listfull: zeigt eine ausführliche Liste der Übertragungen Ohne Angabe von Argumenten wird ein Buffer, mit Übertragungsliste, geöffnet.

source: nicks of DCC chat
de: Nicks vom DCC Chat

source: auto open xfer buffer when a new xfer is added to list
de: öffnet automatisch den Übertragungs-Buffer falls eine neue Übertragung hinzugefügt wird

source: size of progress bar, in chars (if 0, progress bar is disabled)
de: Größe des Fortschrittsbalkens, in Zeichen (0, falls Fortschrittsbalken deaktiviert sein soll)

source: text color of selected xfer line
de: Farbe der selektierten Transfer-Zeile

source: text color for "waiting" status
de: Textfarbe für Status: "wartend"

source: text color for "active" status
de: Textfarbe für Status: "aktiv"

source: text color for "done" status
de: Textfarbe für Status: "fertig"

source: text color for "failed" status
de: Textfarbe für Status: "fehlgeschlagen"

source: text color for "aborted" status
de: Textfarbe für Status: "abgebrochen"

source: timeout for xfer request (in seconds)
de: Zeitüberschreitung bei Transfer-Anfrage (in Sekunden)

source: block size for sending packets, in bytes
de: Blockgröße für versendete Pakete (in Bytes)

source: does not wait for ACK when sending file
de: Wartet beim Versenden von Dateien nicht auf das Bestätigungssignal (ACK)

source: restricts outgoing files/chats to use only ports in the given range (useful for NAT) (syntax: a single port, ie. 5000 or a port range, ie. 5000-5015, empty value means any port, it's recommended to use ports greater than 1024, because only root can use ports below 1024)
de: Schränkt den ausgehenden Datenversand bzw. Chats auf die ausschließliche Nutzung von Ports in einem vorgegebenen Bereich ein (hilfreich bei NAT) (Syntax: ein einzelner Port, z.B. 5000 oder ein Port-Bereich, z.B. 5000-5015. Es wird empfohlen Ports zu nutzen welche Größer als 1024 sind. Denn nur der User "root" kann auf den Port-Bereich <1024 zugreifen)

source: IP or DNS address used for sending files/chats (if empty, local interface IP is used)
de: IP- oder DNS-Adresse für ausgehenden Datentransfer/Chat (falls kein Wert angegeben ist, wird die IP des lokalen Interfaces benutzt)

source: speed limit for sending files, in kilo-bytes by second (0 means no limit)
de: Begrenzung der Übertragungsgeschwindigkeit beim Versenden, in Kilo-Bytes pro Sekunde (0 = keine Begrenzung)

source: path for writing incoming files ("%h" will be replaced by WeeChat home, "~/.weechat" by default)
de: Pfad in welchem die ankommenden Dateien gespeichert werden ("%h" wird durch das WeeChat Verzeichnis ersetzt, Standardverzeichnis: "~/.weechat")

source: path for reading files when sending (when no path is specified by user) ("%h" will be replaced by WeeChat home, "~/.weechat" by default)
de: Pfad in welchem sich die Quelldatei befindet (falls vom Anwender kein Pfad angegeben wurde) ("%h" wird durch das WeeChat Verzeichnis ersetzt, Standardverzeichnis: "~/.weechat")

source: use remote nick as prefix in local filename when receiving a file
de: Nutzt den Nick des Versenders als Präfix für Dateinamen, wenn Daten empfangen werden

source: convert spaces to underscores when sending files
de: Ein Leerzeichen wird in einen Unterstrich gewandelt wenn Daten versendet werden

source: rename incoming files if already exists (add ".1", ".2", ...)
de: Eingehende Dateien werden automatisch umbenannt um ein Überschreiben zu vermeiden (dabei wird dem Dateinamen '.1', '.2', ... hinzugefügt)

source: automatically resume file transfer if connection with remote host is lost
de: Abgebrochene Übertragungen automatisch fortsetzen, falls die Verbindung getrennt wurde

source: automatically accept incoming files (use carefully!)
de: Die Annahme von Daten wird automatisch akzeptiert (Vorsicht!)

source: automatically accept chat requests (use carefully!)
de: Die Annahme einer Chat-Anfrage wird automatisch akzeptiert (Vorsicht!)

source: list of xfer
de: Transfer-Liste

source: xfer pointer (optional)
de: Transfer-Pointer (optional)

source: %s%s: unable to create pipe
de: %s%s: Es kann keine Pipe erstellt werden

source: %s%s: unable to read local file
de: %s%s: lokale Datei kann nicht gelesen werden

source: %s%s: unable to send block to receiver
de: %s%s: Der Block kann nicht an den Empfänger übertragen werden

source: %s%s: unable to read ACK from receiver
de: %s%s: Es wird keine Zustimmung (ACK) vom Empfänger empfangen

source: %s%s: unable to connect to sender
de: %s%s: Eine Verbindung zum Versender kann nicht herstellt werden

source: %s%s: unable to receive block from sender
de: %s%s: Der Block kann vom Versender nicht empfangen werden

source: %s%s: unable to write local file
de: %s%s: Die lokale Datei kann nicht erstellt werden

source: %s%s: unable to fork
de: %s%s: Kann nicht forken

source: %s%s: unable to create socket for sending file
de: %s%s: Für den Dateiversand kann kein Socket erstellt werden

source: %s%s: unable to set option "nonblock" for socket
de: %s%s: Die "nonblock"-Option für den Socket kann nicht festlegt werden

source: %s%s: timeout for "%s" with %s
de: %s%s: Zeitüberschreitung für "%s" mit %s

source: Plugin
de: Erweiterung

source: Description
de: Beschreibung

source: Arguments
de: Argumente

source: Hashtable (input)
de: Hashtable (Eingabe)

source: Hashtable (output)
de: Hashtable (Ausgabe)

source: Variables
de: Variablen

source: Lists
de: Listen
