Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: text color for nicks (comma separated list of colors, background is allowed with format: "fg:bg", for example: "lightred:blue")
de: Textfarbe für Nicks (durch Kommata getrennte Liste von Farben. Eine Hintergrundfarbe kann durch das folgende Format genutzt werden: "fg:bg". Zum Beispiel: "lightred:blue")

source: text color for local nick in chat window
de: Textfarbe für den eigenen Nicknamen, im lokalen Chat-Fenster.

source: text color for other nick in private buffer
de: Farbe des anderen Nicknamens in einem privaten Buffer

source: text color for hostnames
de: Textfarbe für Host-Namen

source: text color for delimiters
de: Farbe der Infobar-Trennzeichen

source: text color for highlighted prefix
de: Textfarbe für Highlight-Präfix

source: background color for highlighted prefix
de: Hintergrundfarbe für Highlight-Präfix

source: text color for unread data marker
de: Farbe in der das Lesezeichen angezeigt werden soll

source: background color for unread data marker
de: Hintergrundfarbe in der das Lesezeichen angezeigt werden soll

source: text color for tags after messages (displayed with command /debug tags)
de: Textfarbe für die Anzeige der Tags nach der jeweiligen Nachricht (wird durch den Befehl "/debug tags" angezeigt)

source: text color for marker on lines where text sought is found
de: Farbe zur Hervorhebung des gesuchten Textes in einer Zeile

source: background color for marker on lines where text sought is found
de: Hintergrundfarbe zur Hervorhebung des gesuchten Textes in einer Zeile

source: text color for values
de: Farbe für Werte

source: text color for current buffer number in status bar
de: Farbe des aktuellen Channels in der Statuszeile

source: text color for current buffer name in status bar
de: Farbe des aktuellen Buffer-Namens in der Statuszeile

source: text color for current buffer name in status bar, if data are secured with a protocol like SSL
de: Farbe in der der aktuelle Buffer-Name in der Statuszeile angezeigt werden soll falls die Verbindung durch ein Protokoll z.B. SSL geschützt ist

source: text color for filter indicator in status bar
de: Farbe des Filterkennzeichens in der Statuszeile

source: text color for buffer with new messages (status bar)
de: Farbe eines Buffers der neue Nachrichten enthält (Statusbar)

source: text color for buffer with private message (status bar)
de: Farbe eines Bufffers mit privater Nachricht (Statusbar)

source: text color for buffer with highlight (status bar)
de: Farbe eines Buffers mit Highlight-Nachricht (Statusbar)

source: text color for buffer with new data (not messages) (status bar)
de: Farbe eines Buffers mit neuen Daten (nicht Nachrichten in der Statusbar)

source: text color for count of messages in hotlist (status bar)
de: Farbe für die Anzahl der Nachrichten die in der Hotlist (Statusbar) dargestellt werden.

source: text color for count of private messages in hotlist (status bar)
de: Farbe für die Anzahl der privaten Nachrichten die in der Hotlist (Statusbar) dargestellt werden.

source: text color for count of highlight messages in hotlist (status bar)
de: Farbe für die Anzahl der Highlight-Nachrichten die in der Hotlist (Statusbar) dargestellt werden.

source: text color for count of other messages in hotlist (status bar)
de: Farbe für die Anzahl aller anderen Nachrichten die in der Hotlist (Statusbar) dargestellt werden.

source: text color for buffer with new data (status bar)
de: Farbe eines Buffers mit neuen Daten (Statusbar)

source: text color for time (status bar)
de: Textfarbe für die Uhrzeit (Statusbar)

source: text color for unsuccessful text search in input line
de: Textfarbe in der Eingabezeile bei einer erfolglosen Textsuche

source: text color for actions in input line
de: Textfarbe in der Eingabezeile bei Aktivität (z.B. beim Einfügen von Zeilen)

source: text color for groups in nicklist
de: Textfarbe für Gruppen in Nickliste

source: text color for away nicknames
de: Textfarbe von abwesenden Nicknamen

source: text color for offline nicknames
de: Textfarbe von Nicknamen die Offline sind

source: if enabled, the base word to complete ends at char before cursor; otherwise the base word ends at first space after cursor
de: Ist diese Option aktiviert beginnt eine Vervollständigung an der aktuellen Position des Cursors; andernfalls beginnt eine Vervollständigung erst wenn ein Leerzeichen als Trennung zum nächsten Wort vorhanden ist

source: default completion template (please see documentation for template codes and values)
de: Standardvorlage für die automatische Vervollständigung (in der Dokumentation finden Sie die vorgegebenen Codes und Werte)

source: add space after nick completion (when nick is not first word on command line)
de: Füge ein Leerzeichen hinter die Nick-Vervollständigung ein (sofern der Nickname nicht das erste Wort in einer Kommandozeile darstellt)

source: string inserted after nick completion
de: Nach Nick-Vervollständigung anzufügende Zeichenfolge

source: complete only with first nick found
de: Nur mit dem ersten, passendem Nick-Namen vervollständigen

source: chars ignored for nick completion
de: Zeichen, die bei der Vervollständigung von Nicks ignoriert werden

source: alert user when a partial completion occurs
de: Informiert User wenn eine teilweise Vervollständigung auftritt

source: partially complete command names (stop when many commands found begin with same letters)
de: teilweise Vervollständigung von Befehlen (stoppt falls zu viele Befehle mit dem selben Buchstaben beginnen)

source: partially complete command arguments (stop when many arguments found begin with same prefix)
de: teilweise Vervollständigung von Befehls-Argumenten (stoppt falls zu viele Befehle mit dem selben Präfix beginnen)

source: partially complete outside commands (stop when many words found begin with same letters)
de: teilweise Vervollständigung von externen Befehlen (stoppt falls zu viele Befehle mit dem selben Buchstaben beginnen)

source: display count for each partial completion in bar item
de: Zeigt bei einer teilweisen Vervollständigung die Anzahl der jeweiligen Möglichkeiten in der Bar-Item an

source: maximum number of lines in history per buffer (0 = unlimited)
de: maximale Anzahl an Zeilen im Verlaufsspeicher. Dies gilt pro Buffer (0: keine Zeilenbegrenzung)

source: maximum number of minutes in history per buffer (0 = unlimited, examples: 1440 = one day, 10080 = one week, 43200 = one month, 525600 = one year)
de: maximale Anzahl in Minuten wie Lange die Zeilen m Verlaufspeicher pro Buffer gehalten werden sollen (0 = unbegrenzt, Beispiele: 1440 = einen Tag, 10080 = eine Woche, 43200 = einen Monat, 525600 = ein Jahr)

source: maximum number of user commands in history (0 = unlimited)
de: maximale Anzahl an Befehlen im Verlauf (0: kein Begrenzung)

source: maximum number of visited buffers to keep in memory
de: maximale Anzahl an besuchten Buffern welche im Speicher gehalten werden sollen

source: maximum number of commands to display by default in history listing (0 = unlimited)
de: Wert für die maximale Anzahl der angezeigten Befehle im Verlaufsspeicher, die mittels /history angezeigt werden (0: unbegrenzt)

source: file containing the certificate authorities ("%h" will be replaced by WeeChat home, "~/.weechat" by default)
de: Datei beinhaltet die digitalen Zertifikate ("%h" wird durch das WeeChat Verzeichnis ersetzt, Standardverzeichnis: "~/.weechat")

source: timeout (in seconds) for gnutls handshake
de: Zeitüberschreitung (in Sekunden) für gnutls handshake

source: comma separated list of plugins to load automatically at startup, "*" means all plugins found, a name beginning with "!" is a negative value to prevent a plugin from being loaded, names can start or end with "*" to match several plugins (examples: "*" or "*,!lua,!tcl")
de: Eine durch Kommata getrennte Liste der Erweiterungen die beim Programmstart automatisch geladen werden sollen, "*" lädt alle gefundenen Erweiterungen. Beginnt der Name hingegen mit "!" wird die Erweiterung nicht geladen. Suchmuster können mit einem Joker ("*") beginnen oder enden um mehrere Erweiterungen zu laden (Beispiele: "*" oder "*,!lua,!tcl")

source: enable debug messages by default in all plugins (option disabled by default, which is highly recommended)
de: aktiviere Debug-Nachrichten für alle Erweiterungen (diese Option ist standardmäßig deaktiviert und das ist auch gut so)

source: comma separated list of file name extensions for plugins
de: Durch Kommata getrennte Liste von Dateinamenerweiterungen welche für die Erweiterungen genutzt werden sollen

source: path for searching plugins ("%h" will be replaced by WeeChat home, "~/.weechat" by default)
de: Suchpfad für Erweiterungen ("%h"' wird durch das WeeChat-Basisverzeichnis ersetzt, voreingestellt ist "~/.weechat")

source: save configuration files when unloading plugins
de: Speichere Konfiguration falls Erweiterungen deinstalliert werden

source: FATAL: error initializing configuration options
de: FATAL: Fehler bei der Initialisierung der Konfiguration-Optionen

source: %sError reading configuration
de: %sFehler beim lesen der Konfiguration

source: Writing configuration file %s %s
de: speichere Konfigurationsdatei %s %s

source: (default options)
de: (Standardoption)

source: %sError: cannot create file "%s"
de: %sFehler: kann die Datei "%s" nicht erstellen

source: %sError writing configuration file "%s"
de: %sEs ist ein Fehler beim Speichern der Konfigurationsdatei "%s" aufgetreten

source: %sWarning: configuration file "%s" not found
de: %sWarnung: Konfigurationsdatei "%s" nicht gefunden.

source: Reading configuration file %s
de: lese Konfigurationsdatei %s

source: %sWarning: %s, line %d: invalid syntax, missing "]"
de: %sWarnung: %s, Zeile %d: Syntaxfehler, "]" erwartet

source: %sWarning: %s, line %d: unknown section identifier ("%s")
de: %sWarnung: %s, Zeile %d: unbekannte Sektion ("%s")

source: %sWarning: %s, line %d: unknown option for section "%s": %s
de: %sWarnung: %s, Zeile %d: unbekannte Option für Sektion "%s": %s

source: %sWarning: %s, line %d: option outside section: %s
de: %sWarnung: %s, Zeile %d: unbekannte Option %s (außerhalb einer Sektion)

source: %sWarning: %s, line %d: invalid value for option: %s
de: %sWarnung: %s, Zeile %d: ungültige Wert für Option %s

source: Reloading configuration file %s
de: Konfigurationsdatei %s wird erneut geladen

source: Windows tree:
de: Fensterstruktur:

source: Memory usage (see "man mallinfo" for help):
de: Auslastung des Speichers (siehe"man mallinfo" für Hilfe):

source: Memory usage not available (function "mallinfo" not found)
de: Speicheranzeige nicht verfügbar (Funktion "mallinfo" nicht gefunden)

source: %sError: another command "%s" already exists for plugin "%s"
de: %sFehler: ein anderer Befehl "%s" existiert bereits für Erweiterung "%s"

source: System clock skew detected (%+ld seconds), reinitializing all timers
de: Die Systemzeit ist nicht korrekt (%+ld Sekunden), reinitialisiere alle Uhren

source: %sError: bad file descriptor (%d) used in hook_fd
de: %sFehler: bad file descriptor (%d) wurde in hook_fd Funktion genutzt

source: End of command '%s', timeout reached (%.1fs)
de: Befehl '%s' beendet, Zeit ist verstrichen (%.1fs)

source: %sYou can not write text in this buffer
de: %sIn diesen Buffer kann nicht geschrieben werden

source: %sError with command "%s" (try /help %s)
de: %sFehler mit dem Befehl "%s" aufgetreten (nutze: /help %s)

source: %sError: ambigous command "%s": it exists in many plugins and not in "%s" plugin
de: %sFehler: mehrdeutiger Befehl "%s": existiert für mehrere Erweiterungen aber nicht für die Erweiterung "%s"

source: %sError: too much calls to command "%s" (looping)
de: %sFehler zu viele Aufrufe des Programms "%s" (Wiederholungen)

source: %sError: unknown command "%s" (type /help for help)
de: %sFehler: Der Befehl "%s" ist nicht bekannt. Für eine Hilfe nutze /help

source: Error: unable to create/append to log file (weechat.log) If another WeeChat process is using this file, try to run WeeChat with another home using "--dir" command line option.
de: Fehler: kann Protokoll-Datei nicht erzeugen oder keine Daten anhängen (weechat.log) Falls ein anderer WeeChat-Prozess die Datei benutzt sollte dann können Sie versuchen, durch den Aufruf der "--dir" Kommandozeilenoption, WeeChat mit einem anderen Home-Verzeichnis zu starten.

source: invalid priorities
de: ungültige Priorität

source: proxy type (http (default), socks4, socks5)
de: Proxy-Typ (http (Standard), socks4, socks5)

source: connect to proxy using ipv6
de: Verbindung zum Proxy über IPv6 aufbauen

source: proxy server address (IP or hostname)
de: Adresse des Proxy-Servers (IP oder Hostname)

source: port for connecting to proxy server
de: Port, auf dem der Proxy-Server läuft

source: username for proxy server
de: Benutzername für die Proxy-Verbindung

source: password for proxy server
de: Passwort für die Proxy-Verbindung

source: debug: removing file: %s
de: debug: lösche Datei: %s

source: Upgrade done (%.02f %s)
de: Upgrade durchgeführt (%.02f %s)

source: %sError upgrading WeeChat with file "%s":
de: %sFehler bei der Aktualisierung von WeeChat, mit der Datei "%s":

source: %s error: %s%s%s%s
de: %s Fehler: %s%s%s%s

source: %s last read: position: %ld, length: %d
de: %s letzter Lesezugriff: Position: %ld, Länge: %d

source: %s source: %s, line: %d
de: %s Quelle: %s, Zeile: %d

source: %s *** Please report above info to developers ***
de: %s *** Bitte senden Sie obige Informationen an die Entwickler ***

source: write - object type
de: schreibe - Objekt-Typ

source: write - object id
de: schreibe - Objekt-ID

source: write - variable name
de: schreibe - Variablenname

source: write - infolist type
de: schreibe - Infolist-Typ

source: write - variable
de: schreibe - Variable

source: read - object type
de: lese - Objekt-Typ

source: read - bad object type ('object start' expected)
de: lese - falscher Typ für Objekt ('object start' wurde erwartet)

source: read - object id
de: lese - Objekt-ID

source: read - infolist creation
de: lese - Infolist Erstellung

source: read - infolist item creation
de: lese - Infolist-Item Erstellung

source: read - variable name
de: lese - Variablenname

source: read - variable type
de: lese - Variablen-Typ

source: read - variable
de: lese - Variable

source: read - signature not found
de: lese - Signatur nicht gefunden

source: read - bad signature (upgrade file format may have changed since last version)
de: lese - falsche Signatur (das Dateiformat wurde vermutlich seit der letzten Version verändern)

source: Warning: the %d color pairs are used, do "/color reset" to remove unused pairs
de: Warnung: das Farbpaar %d wird bereits genutzt. Nutze "/color reset" um ungenutzte Farbpaarungen zu entfernen

source: Terminal infos:
de: Terminal Informationen:

source: No color support in terminal.
de: Keine Unterstützung von Farben im Terminal.

source: Default colors:
de: Standardfarben:

source: Terminal colors:
de: Terminal-Farben:

source: WeeChat colors | Actions: [e] Display extra infos [r] Refresh [z] Reset colors [q] Close buffer | Keys: [alt-c] Temporarily switch to terminal colors
de: WeeChat Farben | Aktionen: [e] Zeigt zusätzliche Informationen an [r] aktualisieren [z] Farben zurücksetzen [q] Buffer schließen | Befehle: [alt-c] wechselt Farben

source: WeeChat color pairs (in use: %d, left: %d):
de: WeeChat Farbpaare (in Benutzung: %d, noch frei verfügbar: %d):

source: Last auto reset of pairs: %s
de: zuletzt durchgeführter Reset der Farbpaare: %s

source: WeeChat basic colors:
de: WeeChat Basisfarben:

source: Nick colors:
de: Farben für Nicks:

source: Color aliases:
de: Farbalias:

source: Content of colors (r/g/b):
de: Inhalt der Farben (r/g/b):

source: WeeChat colors (in use: %d, left: %d):
de: WeeChat Farben (in Benutzung: %d, noch frei verfügbar: %d):

source: Terminal lost, exiting WeeChat...
de: Terminal verloren, beende WeeChat...

source: Signal %s received, exiting WeeChat...
de: Signal %s empfangen, beende WeeChat...

source: Signal SIGHUP received, reloading configuration files
de: Signal SIGHUP empfangen, lese Konfigurationsdateien neu

source: Mouse is enabled
de: Maus ist aktiviert

source: Mouse is disabled
de: Maus ist deaktiviert

source: TERM='%s', size: %dx%d
de: TERM='%s', Größe: %dx%d

source: %sUnable to change bar type: you must delete bar and create another to do that
de: %sKann Bar-Typ nicht ändern: Es muss zuerst die Bar gelöscht und danach neu erstellt werden

source: true if bar is hidden, false if it is displayed
de: Einschalten, falls Bar versteckt werden soll. Ausschalten, falls Bar angezeigt werden soll.

source: bar priority (high number means bar displayed first)
de: Priorität der Bar (eine höhere Zahl bedeutet, das die Bar zuerst dargestellt wird)

source: bar type (root, window, window_active, window_inactive)
de: Bar-Typ (root, window, window_active, window_inactive)

source: condition(s) for displaying bar (for bars of type "window"): "active" = window must be active, "inactive" = window must be inactive, "nicklist" = buffer must have a nicklist
de: Bedingung(en) um eine Bar anzuzeigen (gilt für Bars des Typs "window"): "active" = window muss aktiv sein "inactive" = window muss inaktiv sein, "nicklist" = Buffer muss über eine Nickliste verfügen

source: bar position (bottom, top, left, right)
de: Position der Infobar (unten, oben, links, rechts)

source: bar filling direction ("horizontal" (from left to right) or "vertical" (from top to bottom)) when bar position is top or bottom
de: Darstellung innerhalb der Infobar, falls die Infobar oben/unten angezeigt wird ("horizontal" (von links nach rechts) oder "vertikal" (von oben nach unten))

source: bar filling direction ("horizontal" (from left to right) or "vertical" (from top to bottom)) when bar position is left or right
de: Darstellung innerhalb der Infobar, falls die Infobar links/rechts angezeigt wird ("horizontal" (von links nach rechts) oder "vertikal" (von oben nach unten))

source: bar size in chars (0 = auto size)
de: Größe der Infobar, in Zeichen (0 = automatische Anpassung)

source: max bar size in chars (0 = no limit)
de: Maximale Länge der Infobar, in Zeichen (0: keine Limitierung)

source: default text color for bar
de: Standardfarbe des Infobar-Textes

source: default delimiter color for bar
de: Standardfarbe der Trennzeichen in der Infobar

source: default background color for bar
de: Standardhintergrundfarbe der Infobar

source: separator line between bar and other bars/windows
de: Trennzeichen zwischen verschieden Infobars und Fenstern

source: items of bar, they can be separated by comma (space between items) or "+" (glued items)
de: Items einer Bar können durch Kommata voneinander getrennt werden (Leerzeichen zwischen Items) oder "+" (zusammengefügte Items)

source: Bar "%s" updated
de: Infobar "%s" aktualisiert

source: %sPaste %d lines ? [ctrl-Y] Yes [ctrl-N] No
de: %sEinfügen von %d Zeilen? [ctrl-Y] Ja [ctrl-N] Nein

source: Text search
de: Textsuche

source: Text search (exact)
de: Textsuche (genau)

source: %s-MORE(%d)-
de: %s-MEHR(%d)-

source: Act:
de: Aktiv:

source: Notify changed for "%s%s.%s%s": "%s%s%s" to "%s%s%s"
de: Benachrichtigung wurde von "%s%s.%s%s": "%s%s%s" auf "%s%s%s" geändert

source: %sError: a buffer with same name (%s) already exists
de: %sFehler: Ein Buffer mit dem selben Namen (%s) existiert bereits

source: %sError: it is only possible to merge buffers with formatted content
de: %sFehler: Es ist nur möglich Buffer mit formatiertem Inhalt zusammenzufügen

source: Debug enabled for cursor mode (%s)
de: Debug-Modus (%s) für Cursor aktiviert

source: verbose
de: ausführlich

source: Debug disabled for cursor mode
de: Debug für Cursor Modus deaktiviert

source: Error: not enough memory to add a buffer to hotlist
de: Fehler: nicht genügend Speicher um den Buffer der Hotlist hinzu zu fügen

source: New key binding (context "%s"): %s%s => %s%s
de: Neue Tastenbelegung (Kontext "%s"): %s%s => %s%s

source: Key "%s" unbound (context: "%s")
de: Tastenbelegung "%s" entfernt (Kontext: "%s")

source: Hashtable focus:
de: Hashtable Fokus:

source: Command for key: "%s"
de: Befehl für Taste: "%s"

source: Sending hsignal: "%s"
de: sende hsignal: "%s"

source: Executing command: "%s"
de: führe Befehl "%s" aus

source: Not enough memory for new line
de: Nicht genügend Speicher für eine neue Zeile

source: Debug enabled for mouse (%s)
de: Debug-Modus (%s) für Maus aktiviert

source: Debug disabled for mouse
de: Debug für Maus deaktiviert

source: %s%s: error, circular reference when calling alias "%s"
de: %s%s: Fehler, Zirkelbezug beim Aufruf des Alias "%s"

source: %s%s: error creating alias "%s" => "%s"
de: %s%s: Fehler beim Erstellen von Alias "%s" => "%s"

source: Alias "%s" => "%s" created
de: Alias "%s" => "%s" angelegt

source: List of aliases:
de: Liste der Alias:

source: No alias found matching "%s"
de: Keinen passenden Alias zu "%s" gefunden

source: No alias defined
de: Keine Alias definiert

source: %sAlias "%s" not found
de: %sAlias "%s" nicht gefunden

source: Alias "%s" removed
de: Alias "%s" entfernt

source: %s%s: error creating configuration file
de: %s%s: Fehler beim Erstellen einer Konfigurationsdatei

source: create an alias for a command
de: Einem Befehl wird ein Alias zugewiesen

source: completion: completion for alias (optional, by default completion is done with target command) alias: name of alias (can start or end with "*" for alias listing) command: command name with arguments (many commands can be separated by semicolons) Without argument, this command lists all defined alias. Note: in command, special variables are replaced: $n: argument 'n' (between 1 and 9) $-m: arguments from 1 to 'm' $n-: arguments from 'n' to last $n-m: arguments from 'n' to 'm' $*: all arguments $~: last argument $nick: current nick $channel: current channel $server: current server To remove an alias, use command /unalias. Examples: alias /split to split window horizontally: /alias split /window splith alias /hello to say "hello" on all channels but not on #weechat: /alias hello /allchan -exclude=#weechat msg * hello alias /forcejoin to send IRC command "forcejoin" with completion of /sajoin: /alias -completion %%sajoin forcejoin /quote forcejoin
de: completion: optionale Vervollständigung für einen Alias-Befehl (Standardverhalten: Vervollständigung wird auf den Zielbefehl angewendet) alias: Name des Alias (kann mit Joker "*" beginnen oder enden um Aliase aufzulisten) command: Name des zuzuordnenden Befehls (WeeChat- oder IRC-Befehl ohne führenden '/', mehrere Befehle müssen durch Semikolon getrennt werden) Ohne Angabe von Argumenten werden alle definierten Aliase angezeigt. Anmerkung: Im Befehl können Variablen genutzt werden, die dann durch den entsprechenden Wert ersetzt werden: $n: Argument 'n' (zwischen 1 und 9) $-m: Argumente von 1 bis 'm' $n-: Argumente von 'n' bis zum letzten Argument $n-m: Argumente von 'n' bis 'm' $*: alle Argumente $~: letztes Argument $nick: aktueller Nick $channel: aktueller Channel $server: aktueller Server Um ein Alias zu löschen, nutze "/unalias". Beispiele: Alias "/split" wird anlegt um damit ein Fenster horizontal zu teilen: /alias split /window splith Alias "/hallo" wird angelegt um in allen Channels, außer im #weechat Channel, den Text "Hallo" auszugeben: /alias hallo /allchan -exclude=#weechat msg * Hallo Alias "/forcejoin" wird angelegt um den IRC Befehl "forcejoin" mit einer Vervollständigung von /sajoin auszuführen: /alias -completion %%sajoin forcejoin /quote forcejoin

source: remove aliases
de: Entferne Alias

source: alias: name of alias to remove
de: alias: Name des zu löschenden Alias

source: list of aliases
de: Liste der Alias

source: value of alias
de: Wert von Alias
