Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: names of buffers (including plugins names)
de: Liste der Buffer (inkl. der Erweiterungen)

source: properties that can be set on a buffer
de: Eigenschaften die für den Buffer gesetzt werden können

source: properties that can be read on a buffer
de: Eigenschaften die für den Buffer gelesen werden können

source: numbers of windows
de: Nummern der Fenster

source: palette colors
de: Farbpalette

source: configuration files
de: Konfigurationsdateien

source: filename
de: Dateinamen

source: names of filters
de: Liste der Filter

source: commands (weechat and plugins)
de: Befehle (WeeChat und Erweiterungen)

source: names of infos hooked
de: Namen der ge-hook-ten Infos

source: names of infolists hooked
de: Namem der ge-hook-ten Infolisten

source: nicks in nicklist of current buffer
de: Nicks in Nickliste des aktuellen Buffers

source: configuration options
de: Konfigurationsoptionen

source: names of plugins
de: Liste der Erweiterungen

source: commands defined by plugins
de: Befehle, definiert durch Erweiterungen

source: names of bars
de: Namen der Infobars

source: values for a configuration option
de: Werte für eine Konfigurationsoption

source: weechat commands
de: WeeChat Befehle

source: names of proxies
de: Namen der Proxies

source: options for proxies
de: Optionen für Proxies

source: options for bars
de: Optionen für Infobars

source: key contexts
de: Tastaturkontext

source: key codes
de: Tastaturcodes

source: key codes that can be reset (keys added, redefined or removed)
de: Tastenbelegungen die zurückgesetzt werden können (hinzugefügte/verändert/gelöschte Tastenbelegungen)

source: areas ("chat" or bar name) for free cursor movement
de: Bereiche ("chat" oder Name einer Bar) in denen der Cursor frei bewegt werden kann

source: Warning: you should now issue /save to write "save_config_on_exit" option in configuration file
de: Warnung: Sie sollten jetzt /save ausführen, um die Option "save_config_on_exit" in die Konfigurationsdatei zu übernehmen.

source: WARNING: this option can cause serious display bugs, if you have such problems, you must turn off this option.
de: WARNUNG: Diese Option kann schwerwiegende Grafikfehler verursachen. Sollten Grafikfehler auftreten dann ist es ratsam diese Option zu deaktivieren.

source: Day changed to %s
de: Ein neuer Tag bricht an. Heute ist %s

source: debug level for plugin ("core" for WeeChat core)
de: Debug-Level für Erweiterung ("core" für den WeeChat Core)

source: alias for color
de: Alias für Farbe

source: %sError: palette option must be numeric
de: %sFehler: Option Palette muss numerisch sein

source: Notify level for buffer
de: Benachrichtigungsstufe für Buffer

source: command executed when WeeChat starts, after loading plugins
de: Nach dem Start von WeeChat wird dieser Befehl aufgerufen. Dies geschieht, nachdem die Erweiterungen geladen worden sind (mehrere Befehle sind durch ";" zu trennen)

source: command executed when WeeChat starts, before loading plugins
de: Nach dem Start von WeeChat wird dieser Befehl aufgerufen. Dies geschieht, bevor die Erweiterungen geladen werden (mehrere Befehle sind durch ";" zu trennen)

source: display WeeChat logo at startup
de: WeeChat-Logo beim Start anzeigen

source: display WeeChat version at startup
de: WeeChat-Version beim Start anzeigen

source: alignment for end of lines (all lines after the first): they are starting under this data (time, buffer, prefix, suffix, message (default))
de: Einstellung bei einem Zeilenumbruch (betrifft alle Zeilen, außer der ersten Zeile). Die Darstellung der nachfolgenden Zeile beginnt unter: (Zeit = time, Buffer = buffer, Präfix = prefix, Suffix = suffix, Nachricht = message (Standardwert))

source: string displayed when bar can be scrolled to the left (for bars with filling "horizontal")
de: Zeichen welches anzeigt, dass die Bar nach links gescrollt werden kann (dies trifft nur auf Bars zu bei denen die Option "/set *.filling_*" nicht auf "horizontal" eingestellt ist).

source: string displayed when bar can be scrolled to the right (for bars with filling "horizontal")
de: Zeichen welches anzeigt, dass die Bar nach rechts gescrollt werden kann (dies trifft nur auf Bars zu bei denen die Option "/set *.filling_*" nicht auf "horizontal" eingestellt ist).

source: string displayed when bar can be scrolled up (for bars with filling different from "horizontal")
de: Zeichen welches anzeigt, dass die Bar nach oben gescrollt werden kann (dies trifft nur auf Bars zu bei denen die Option "/set *.filling_*" nicht auf "horizontal" eingestellt ist).

source: string displayed when bar can be scrolled down (for bars with filling different from "horizontal")
de: Zeichen welches anzeigt, dass die Bar nach unten gescrollt werden kann (dies trifft nur auf Bars zu bei denen die Option "/set *.filling_*" nicht auf "horizontal" eingestellt ist).

source: default notify level for buffers (used to tell WeeChat if buffer must be displayed in hotlist or not, according to importance of message): all=all messages (default), message=messages+highlights, highlight=highlights only, none=never display in hotlist
de: Standardeinstellung der Benachrichtigungsstufe für Buffer (dies wird genutzt um WeeChat mitzuteilen ob der Buffer in der Hotlist angezeigt werden soll oder nicht, entsprechend der Wichtigkeit der Nachricht): all=alle Nachrichten (Standard), message=Nachrichten+Highlights, highlights=nur Highlights, none=Hotlist wird niemals angezeigt.

source: time format for each line displayed in buffers (see man strftime for date/time specifiers), colors are allowed with format "${color}", for example french time: "${lightblue}%H${white}%M${lightred}%S"
de: Format für die Zeitanzeige welche in jeder Zeile eines Buffers dargestellt wird (siehe man strftime für Datum/Zeit Platzhalter). Durch das Format "${Farbe}" ist es möglich eine Farbauswahl zu treffen, zum Beispiel eine französische Uhr: "${lightblue}%H${white}%M${lightred}%S"

source: force "bold" attribute for light colors and "darkgray" in basic colors (this option is disabled by default: bold is used only if terminal has less than 16 colors)
de: erzwingt das Textattribut "fett" für helle Farben und "darkgray" um diese Farben stärker hervorzuheben (diese Option ist standardmäßig deaktiviert: "fett" findet ausschließlich dann Verwendung falls das Terminal weniger als 16 Farben zur Verfügung stellt)

source: use a different color for lines in inactive window (when window is not current window)
de: Textfarbe der Zeilen in einem inaktiven Fenster (betrifft das Fenster, welches nicht aktiv ist)

source: use a different color for lines in inactive buffer (when line is from a merged buffer not selected)
de: Textfarbe der Zeilen in einem inaktiven Buffer (betrifft Zeilen in einem zusammengefügt Buffer, welcher nicht aktiv ist)

source: use a different color for inactive time (when window is not current window, or if line is from a merged buffer not selected)
de: nutzt eine andere Farbe um die inaktive Zeitangabe darzustellen (Fenster ist nicht das aktuelle Fenster oder die Zeile des zusammengefügten Buffers ist nicht aktiv)

source: use a different color for inactive buffer name in prefix (when window is not current window, or if line is from a merged buffer not selected)
de: nutzt eine andere Farbe um den inaktiven BUffernamen im Prefix (Fenster ist nicht das aktuelle Fenster oder die Zeile des zusammengefügten Buffers ist nicht aktiv)

source: use a different color for inactive prefix (when window is not current window, or if line is from a merged buffer not selected)
de: nutzt eine andere Farbe um den inaktiven Prefix darzustellen (Fenster ist nicht das aktuelle Fenster oder die Zeile des zusammengefügten Buffers ist nicht aktiv)

source: use a different color for inactive message (when window is not current window, or if line is from a merged buffer not selected)
de: nutzt eine andere Farbe um die inaktiven Nachrichten darzustellen (Fenster ist nicht das aktuelle Fenster oder die Zeile des zusammengefügten Buffers ist nicht aktiv)

source: automatically reset table of color pairs when number of available pairs is lower or equal to this number (-1 = disable automatic reset, and then a manual "/color reset" is needed when table is full)
de: automatischer Reset der Farbpaarungen sobald die verfügbare Anzahl an Paaren kleiner oder gleich der hier angegebenen Anzahl ist (-1 = deaktiviert den automatischen Reset, dann ist ein manueller Reset mittels "/color reset" notwendig falls alle Farbpaarungen belegt sind)

source: if set, uses real white color, disabled by default for terms with white background (if you never use white background, you should turn on this option to see real white instead of default term foreground color)
de: Falls diese Option aktiviert ist, wird echtes weiß als Farbe genutzt. In der Standardeinstellung ist diese Option allerdings deaktiviert damit es zu keinen Problemen mit Terminals kommt die einen weißen Hintergrund nutzen (falls man keinen weißen Hintergrund nutzt dann ist es ratsam diese Option zu aktivieren, andernfalls wird die voreingestellte Vordergrundfarbe des Terminals verwendet)

source: chars used to determine if input string is a command or not: input must start with one of these chars; the slash ("/") is always considered as command prefix (example: ".$")
de: Bestimmt ein- oder mehrere Zeichen mit denen man ebenfalls einen Befehl ausführen kann. Zum Beispiel mittels ".$". Der Schrägstrich (slash: "/") ist ein reserviertes Zeichen und kann immer genutzt werden.

source: if set, /quit command must be confirmed with extra argument "-yes" (see /help quit)
de: Falls diese Option aktiviert ist muss der "/quit" Befehl mit der Option "-yes" ausgeführt werden (siehe /help quit)

source: display special message when day changes
de: Wenn ein neuer Tag beginnt wird eine entsprechende Nachricht angezeigt

source: time format for date displayed when day changed
de: Format für die Uhrzeit und das Datum, dass beim Datumswechsel angezeigt werden soll

source: if set, the eat_newline_glitch will be set to 0; this is used to not add new line char at end of each line, and then not break text when you copy/paste text from WeeChat to another application (this option is disabled by default because it can cause serious display bugs)
de: aktiviert man diese Option, dann wird "eat_newline_glitch" auf 0 gesetzt; dies bedeutet, dass am Ende einer Zeile kein Zeilenumbruch angehangen wird und somit der Text beim kopieren aus WeeChat und beim einfügen in einer anderen Applikation nicht umgebrochen wird (diese Option ist standardmäßig deaktiviert, da es zu schwerwiegenden Grafikfehlern kommen kann)

source: comma separated list of words to highlight (case insensitive comparison, words may begin or end with "*" for partial match)
de: Durch Kommata getrennte Liste der hervorzuhebenden Wörter (Groß-/Kleinschreibung wird nicht beachtet. Die Schlagwörter können mit "*", als Joker, beginnen oder enden)

source: regular expression used to check if a message has highlight or not, at least one match in string must be surrounded by word chars (alphanumeric, "-", "_" or "|"), regular expression is case sensitive, example: "FlashCode|flashy"
de: Suchmuster (regulärer Ausdrück) dass genutzt werden soll um zu überprüfen ob eine Nachricht ein Highlight enthält oder nicht. Mindestens eine Zeichenkette muss dabei auf das Suchmuster passen (alphanumerisch, "-", "_" oder "|"), das Suchmuster unterscheidet zwischen Groß-und Kleinschreibung. Beispiel: "FlashCode|flashy"

source: comma separated list of tags to highlight (case insensitive comparison, examples: "irc_notice" for IRC notices, "nick_flashcode" for messages from nick "FlashCode")
de: Durch Kommata getrennte Liste der hervorzuhebenden Wörter (Groß-/Kleinschreibung wird nicht beachtet. Beispiele: "irc_notice" für IRC Nachrichten, "nick_flashcode" für Nachrichten vom Nick "FlashCode")

source: add any buffer to hotlist (including current or visible buffers) if local variable "away" is set on buffer
de: fügt einen beliebigen Buffer zur Hotlist hinzu (dies schließt den aktuellen oder jeden anderen sichtbaren Buffer ein) sofern die lokale Variable "away" für den Buffer gesetzt wurde

source: string displayed between buffers in hotlist
de: Zeichen welches zum Trennen zwischen den verschiedenen Buffern in der Hotlist genutzt werden soll.

source: max number of messages count to display in hotlist for a buffer (0 = never display messages count)
de: Maximale Anzahl an Nachrichten für den Nachrichtenzähler in der Hotlist, pro Buffer (0 = der Nachrichtenzähler wird nicht dargestellt)

source: display messages count if number of messages is greater or equal to this value
de: Zeigt einen Nachrichtenzähler an sofern die Anzahl der Nachrichten größer oder gleich diesen Wertes ist.

source: max number of names in hotlist (0 = no name displayed, only buffer numbers)
de: Maximale Anzahl an Namen in der Hotlist (0 = es werden keine Namen angezeigt, sondern nur die Nummern der Buffer)

source: max length of names in hotlist (0 = no limit)
de: maximale Länge der Namen in der Hotlist (0: kein Limitierung)

source: level for displaying names in hotlist (combination of: 1=join/part, 2=message, 4=private, 8=highlight, for example: 12=private+highlight)
de: Level für Namensanzeige in der Hotlist (Kombination aus: 1=join/part, 2=Nachricht, 4=Query, 8=Highlight, z.B. 12=Query+Highlight)

source: if set, force display of names in hotlist for merged buffers
de: Falls diese Option aktiviert ist, werden die Namen der zusammengefügten Buffer auf jeden Fall dargestellt

source: if set, uses short names to display buffer names in hotlist (start after first '.' in name)
de: Falls diese Option aktiviert ist, wird der Kurzname der zusammengefügten Buffer in der Hotlist dargestellt (die Darstellung geschieht nach dem ersten '.' im Namen)

source: hotlist sort type (group_time_asc (default), group_time_desc, group_number_asc, group_number_desc, number_asc, number_desc)
de: Sortierung der Hotlist (group_time_asc (Standardwert), group_time_desc, group_number_asc, group_number_desc, number_asc, number_desc)

source: keep only unique numbers in hotlist (this applies only on hotlist items where name is NOT displayed after number)
de: Es wird nur jeweils einmal die Nummer des Buffers in der Hotlist angezeigt (diese Option kommt nur zum Tragen sofern KEINE Buffernamen angezeigt werden)

source: number of chars displayed after end of input line when scrolling to display end of line
de: Anzahl an Zeichen die nach links verschoben werden sollen, falls das Ende der Eingabezeile erreicht wird.

source: share commands, text, or both in input for all buffers (there is still local history for each buffer)
de: Mit dieser Option kann man den Inhalt der Eingabezeile in allen Buffern verwenden. Es können dabei nur Befehle (commands), nur Text (text) oder beides (all) berücksichtigt werden (Der Befehlsverlauf der einzelnen Buffer bleibt hierbei erhalten)

source: if set and input is shared, always overwrite input in target buffer
de: Falls diese Option aktiviert ist und die Eingabezeile für alle Buffer genutzt wird dann wird ggf. der Inhalt im Zielbuffer überschrieben

source: max number of "undo" for command line, by buffer (0 = undo disabled)
de: maximale Anzahl von "Rücknahmen" für Befehle im Verlauf, pro Buffer (0: deaktiviert die Funktion)

source: time format for "time" bar item (see man strftime for date/time specifiers)
de: Format für die Zeitanzeige, "time", in der Bar-Item (siehe man strftime für Datum/Zeit Platzhalter)

source: string used to show that some lines are filtered in current buffer (bar item "buffer_filter")
de: Zeichen mit welchem in der Bar-Item ("buffer_filter") signalisiert wird ob im aktuellen Buffer die Filterfunktion eingeschaltet ist.

source: jump to previous buffer displayed when jumping to current buffer number with /buffer *N (where N is a buffer number), to easily switch to another buffer, then come back to current buffer
de: Wechselt zum vorher genutzten Buffer falls man mit dem Befehl /buffer *N (N ist die Buffer-Nummer) zum aktuellen Buffer gewechselt hat. Dies dient dazu um zwischen zwei Buffern einfach hin- und her zu springen.

source: jump to previously visited buffer when closing a buffer (if disabled, then jump to buffer number - 1)
de: Wechselt zum vorher genutzten Buffer falls der aktuelle Buffer geschlossen wird (wenn diese Funktion deaktiviert ist wird zum Buffer gewechselt der die Position -1 einnimmt)

source: enable mouse support at startup (to enable it now, see /help mouse)
de: Mausunterstützung beim Start aktivieren (um die Funktion direkt zu aktivieren, siehe /help mouse)

source: delay (in milliseconds) to grab a mouse event: WeeChat will wait this delay before processing event
de: Verzögerung (in Millisekunden) um ein Mauskommado zu fangen: WeeChat wartet zuerst diese Verzögerung ab bevor das Kommando verarbeitet wird

source: display nick mode ((half)op/voice) before each nick
de: Nickmode ((half)op/voice [@%+]) vor dem Nicknamen anzeigen

source: display space if nick mode is not (half)op/voice
de: Leerzeichen anzeigen wenn Nickmode nicht (half)op/voice (@%+) ist

source: max number of lines for paste without asking user (0 = disable this feature)
de: maximale Anzahl der Zeilen die eingefügt werden dürfen ohne dass der Anwender gefragt wird (0 = schaltet diese Funktion ab)

source: prefix for error messages
de: Präfix für Fehlermeldungen

source: prefix for network messages
de: Präfix für Netzwerkmeldungen

source: prefix for action messages
de: Präfix für Action-Nachrichten

source: prefix for join messages
de: Präfix für Join-Nachrichten

source: prefix for quit messages
de: Präfix für Quit-Nachrichten

source: prefix alignment (none, left, right (default))
de: Einstellung für Präfix (keine = none, links = left, rechts = right (Voreinstellung))

source: max size for prefix (0 = no max size)
de: maximale Größe des Präfix (0 = keine Limitierung)

source: min size for prefix
de: minimale Größe des Präfix

source: display '+' if prefix is truncated
de: Anzeige eines '+' falls das Präfix abgeschnitten ist

source: prefix alignment for buffer name, when many buffers are merged with same number (none, left, right (default))
de: Einstellung des Präfix für den Buffer-Namen falls viele Buffer zu einem Buffer zusammengefügt wurden (keine = none, links = left, rechts = right (Standardwert))

source: max size for buffer name, when many buffers are merged with same number (0 = no max size)
de: maximale Größe für einen Buffer-Namen falls mehrere Buffer zusammengefügt worden sind (0 = keine Größenbegrenzung)

source: display '+' if buffer name is truncated (when many buffers are merged with same number)
de: Stellt das Symbol '+' dar falls der Buffername gekürzt wurde (wenn mehrere Buffer zusammengefügt wurden und diese somit die selbe Nummer besitzen)

source: string displayed after prefix
de: Nach dem Präfix anzufügende Zeichenfolge

source: use a marker (line or char) on buffers to show first unread line
de: Nutzt eine Linie oder ein Zeichen um die erste ungelesene Nachricht in einem Buffer zu markieren

source: always show read marker, even if it is after last buffer line
de: Das Lesezeichen wird immer dargestellt auch wenn noch keine neue Nachricht im Buffer geschrieben wurde

source: string used to draw read marker line (string is repeated until end of line)
de: Zeichen dass als Lesezeichen genutzt werden soll (das Zeichen wird bis zum Ende der Zeile wiederholt)

source: save configuration file on exit
de: Konfiguration beim Beenden abspeichern

source: save layout on exit (buffers, windows, or both)
de: Beim Beenden wird das Layout gespeichert (Buffer, Fenster oder beides)

source: how many lines to scroll by with scroll_up and scroll_down
de: Anzahl der zu scrollenden Zeilen wenn Seitenweise geblättert wird (Bild hoch/runter)

source: percent of screen to scroll when scrolling one page up or down (for example 100 means one page, 50 half-page)
de: Angabe in Prozent, die die Seite hoch oder runter gescrollt werden soll (Beispiel: 100 für eine ganze Seite, 50 für eine halbe Seite)

source: alert user when text sought is not found in buffer
de: Informiert den Anwender falls der gesuchte Text nicht im Buffer gefunden wurde

source: char used to draw horizontal separators around bars (empty value will draw a real line with ncurses, but may cause bugs with URL selection under some terminals), wide chars are NOT allowed here
de: Das angegebene Zeichen wird genutzt um damit die horizontalen Linien zu zeichnen. Wird kein Zeichen angegeben zeichnet ncurses eine durchgezogene Linie. Dies kann allerdings bei einigen Terminals zu Fehlern führen, falls die URL Auswahl genutzt wird. Wide Chars sind für diese Option NICHT erlaubt.

source: char used to draw vertical separators around bars (empty value will draw a real line with ncurses), wide chars are NOT allowed here
de: Das angegebene Zeichen wird genutzt um damit die vertikale Linien zu zeichnen. Wird kein Zeichen angegeben zeichnet ncurses eine durchgezogene Linie. Wide Chars sind für diese Option NICHT erlaubt.

source: set title for window (terminal for Curses GUI) with name and version
de: setzen des Fenstertitels (oder Terminal-Titel im Curses-GUI), mit Name und Version

source: time format for dates converted to strings and displayed in messages
de: Zeitstempel für das Datum. Der Zeitstempel wird in eine Zeichenkette umgewandelt und in Nachrichten dargestellt.

source: background color for window separators (when split)
de: Hintergrundfarbe der Fenster-Separatoren im Chatfenster (bei geteiltem Bildschirm)

source: text color for '+' when scrolling bars
de: Farbe des '+' beim Verschieben der InfoBars

source: text color for chat
de: Farbe vom Chat-Text

source: background color for chat
de: Hintergrundfarbe des Chats

source: text color for chat when window is inactive (not current selected window)
de: Textfarbe für Chat wenn das Fenster inaktiv ist (betrifft nicht das aktuell ausgewählte Fenster)

source: text color for chat when line is inactive (buffer is merged with other buffers and is not selected)
de: Textfarbe für inaktive Zeilen im Chatfenster (Buffer wurde mit anderen Buffern zusammengefügt und der Buffer ist nicht aktiv)

source: text color for time in chat window
de: Textfarbe der Zeit im Chatfenster

source: text color for time delimiters
de: Farbe für das Zeit-Trennzeichen

source: text color for buffer name (before prefix, when many buffers are merged with same number)
de: Textfarbe des Buffer-Namens (vor dem Präfix, wenn mehrere Buffer mit der selben Zahl zusammengefügt worden sind)

source: text color for inactive buffer name (before prefix, when many buffers are merged with same number and if buffer is not selected)
de: Textfarbe für den inaktiven Namen des Buffer (vor dem Präfix, falls mehrere Buffer zu einem zusammengefügt worden sind und der Buffer nicht ausgewählt ist)

source: text color for error prefix
de: Textfarbe für Fehler-Präfix

source: text color for network prefix
de: Textfarbe für Netzwerk-Präfix

source: text color for action prefix
de: Textfarbe für Action-Präfix

source: text color for join prefix
de: Textfarbe für Join-Präfix

source: text color for quit prefix
de: Textfarbe für Quit-Präfix

source: text color for '+' when prefix is too long
de: Farbe des '+' falls Präfix zu lang sein sollte

source: text color for suffix (after prefix)
de: Textfarbe für den Suffix (senkrechter Strich)

source: text color for buffer names
de: Textfarbe für den Namen des Buffers

source: text color for server names
de: Textfarbe für den Namen des Servers

source: text color for channel names
de: Farbe für den Channel-Namen

source: text color for nicks in chat window
de: Farbe für Nicks im Chat-Fenster
