Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: list: list all ignores add: add an ignore nick: nick or hostname (can be regular expression if "re:" is given or a mask using "*" to replace one or more chars) del: delete an ignore number: number of ignore to delete (look at list to find it) -all: delete all ignores server: internal server name where ignore is working channel: channel name where ignore is working Examples: ignore nick "toto" everywhere: /ignore add toto ignore host "toto@domain.com" on freenode server: /ignore add toto@domain.com freenode ignore host "toto*@*.domain.com" on freenode/#weechat: /ignore add toto*@*.domain.com freenode #weechat
de: list: zeigt alle Ignorierungen an add: fügt eine Ignorierung hinzu nick: Nick oder Hostname (dies kann ein regulärer Ausdruck sein, sofern "re:" angegeben wird oder eine Maske mittels "*" genutzt wird um ein oder mehrere Zeichen zu ersetzen) del: entfernt eine Ignorierung number: Nummer der Ignorierung die entfernt werden soll (nutze "list" um den entsprechenden Eintrag zu finden) -all: entfernt alle Einträge server: interner Name des Server auf welchem die Ignorierung statt finden soll channel: Name des Channel, in dem die Ignorierung statt finden soll Beispiele: ignoriert den Nick "toto" global: /ignore add toto ignoriert den Host "toto@domain.com" auf dem freenode Server: /ignore add toto@domain.com freenode ignoriert den Host "toto*@*.domain.com" im Chat freenode/#weechat: /ignore add toto*@*.domain.com freenode #weechat

source: get information describing the server
de: Information über den Server abfragen

source: invite a nick on a channel
de: Jemanden in einen Channel einladen

source: nick: nick to invite channel: channel to invite
de: nick: Nick welcher eingeladen werden soll channel: Channel für den die Einladung gelten soll

source: check if a nick is currently on IRC
de: Überprüft ob ein Nick gegenwärtig auf IRC angemeldet ist

source: join a channel
de: einen Channel betreten

source: server: send to this server (internal name) channel: channel name to join key: key to join the channel (channels with a key must be the first in list) Examples: /join #weechat /join #protectedchan,#weechat key /join -server freenode #weechat
de: server: sendet an diesen Server (interner Name) channel: Name des Channels der betreten werden soll key: Zugriffsschlüssel für einen Channel (Channels die einen Zugriffsschlüssel benötigen müssen zuerst aufgeführt werden) Beispiele: /join #weechat /join #geschützterChannel,#weechat Zugriffsschlüssel /join -server freenode #weechat

source: forcibly remove a user from a channel
de: Einen User aus einem Channel herauskicken

source: channel: channel where user is nick: nick to kick reason: reason for kick
de: channel: Channel in dem der Benutzers sich befindet nick: Nick der rausgeworfen werden soll reason: Begründung für den Rauswurf

source: kicks and bans a nick from a channel
de: Kickt und verbannt jemanden aus einem Channel

source: channel: channel where user is nick: nick to kick and ban reason: reason for kick It is possible to kick/ban with a mask, nick will be extracted from mask and replaced by "*". Example: ban "*!*@host.com" and then kick "toto": /kickban toto!*@host.com
de: channel: Channel in dem sich der User befindet nick: Nickname der ge-kick-t und gebannt werden soll reason: Begründung weshalb der User ge-kick-t wurde Es ist möglich kick/ban mittels einer Maske durchzuführen. Der Nick wird aus der Maske heraus gefiltert und durch Joker ("*") ersetzt. Beispiel: Sperre "*!*@host.com" und kicke dann "toto": /kickban toto!*@host.com

source: close client-server connection
de: Jemanden vom Server werfen

source: nick: nick to kill reason: reason for kill
de: nick: Nick, der rausgeworfen werden soll reason: Begründung für den Rauswurf

source: list all servernames which are known by the server answering the query
de: Alle dem antwortenden Server bekannten Servernamen auflisten

source: server: this server should answer the query server_mask: list of servers must match this mask
de: Server: dieser Server soll die Anfrage beantworten Servermaske: die aufzulistenden Server sollen diesem Muster entsprechen

source: list channels and their topic
de: Channels mit ihrem Thema auflisten

source: channel: channel to list server: server name regex: regular expression used to filter results Examples: list all channels on server (can be very slow on large networks): /list list channel #weechat: /list #weechat list all channels beginning with "#weechat" (can be very slow on large networks): /list -re #weechat.*
de: channel: aufzulistender Channel server: Servername regexp: regulärer Ausdruck der für die Ausgabe angewendet werden soll Beispiele: listet alle Channels des Servers auf (dies kann bei umfangreichen Netzwerken sehr lange dauern): /list listet den Channel #weechat auf: /list #weechat listet alle Channels auf die mit "#weechat" beginnen (dies kann bei umfangreichen Netzwerken sehr lange dauern): /list -re #weechat.*

source: get statistics about the size of the IRC network
de: Statistik über die Größe dieses IRC-Netzwerks abfragen

source: mask: servers matching the mask only target: server for forwarding request
de: Maske: Nur Server, die diesem Muster entsprechen Ziel: Server, der die Anfrage weiterleiten soll

source: show a graphical map of the IRC network
de: Zeigt das IRC Netzwerk, in Form einer Baumstruktur, an

source: send a CTCP action to the current channel
de: Eine CTCP ACTION an den aktuellen Channel senden

source: message: message to send
de: Message: zu sendende Nachricht

source: change channel or user mode
de: Modus von einem Channel oder User ändern

source: channel modes: channel: channel name to modify (default is current one) o: give/take channel operator privileges p: private channel flag s: secret channel flag i: invite-only channel flag t: topic settable by channel operator only flag n: no messages to channel from clients on the outside m: moderated channel l: set the user limit to channel b: set a ban mask to keep users out e: set exception mask v: give/take the ability to speak on a moderated channel k: set a channel key (password) user modes: nick: nick to modify i: mark a user as invisible s: mark a user for receive server notices w: user receives wallops o: operator flag List of modes is not comprehensive, you should read documentation about your server to see all possible modes. Examples: protect topic on channel #weechat: /mode #weechat +t become invisible on server: /mode nick +i
de: Channel-Modi: channel: zu ändernder Channel (standardmäßig der erste Channel) o: vergebe/nehme Operator Privilegien p: privater Channel s: geheimer Channel i: geschlossener Channel (Zutritt nur mit Einladung) t: nur Operatoren dürfen das Thema setzen n: keine Channeln-Nachrichten von außerhalb des Channels m: moderierter Channel (schreiben nur mit Voice) l: maximale Anzahl an Usern im Channel festlegen b: Bannmaske für zu sperrende User (in nick!ident@host-Form) e: lege Ausnahmemaske fest v: vergebe/nehme Voice (d.h. Schreibrechte bei moderierten Channels) k: lege ein Passwort für den Channel fest User-Modi: nick: zu ändernder Nickname i: User als unsichtbar kennzeichnen s: User empfängt Server-Nachrichten w: User empfängt WALLOPS o: User ist Channel-Operator Die Liste der hier dargestellten Modi ist nicht vollständig. Es sollte die Dokumentation des jeweiligen Servers zu Rate gezogen werden um alle verfügbaren Modi zu erfahren. Beispiele: Schützt das Thema des Channels #weechat: /mode #weechat +t sich auf dem Server unsichtbar machen: /mode nick +i

source: get the "Message Of The Day"
de: Die "Mitteilung des Tages" abfragen

source: send message to a nick or channel
de: Nachricht an Nick/Channel verschicken

source: server: send to this server (internal name) target: nick or channel (may be mask, '*' = current channel) text: text to send
de: server: schicke an diesen Server (interner Servername) target: Nick oder Channel (darf eine Maske sein, '*' = aktueller Channel) text: zu sendender Text

source: list nicks on channels
de: Nicknamen in Channels auflisten

source: change current nick
de: Aktuellen Nicknamen ändern

source: -all: set new nick for all connected servers nick: new nick
de: -all: Nickname auf allen verbundenen Servern ändern nick: neuer Nickname

source: send notice message to user
de: Mitteilung (notice) an einen User verschicken

source: server: send to this server (internal name) target: nick or channel text: text to send
de: server: an diesen Server senden (interner Name) target: Nickname oder Channel text: zu sendender Text

source: add a notification for presence or away status of nicks on servers
de: Fügt eine Benachrichtigung für An- oder Abwesenheit von Nicks auf Servern hinzu

source: add: add a notification nick: nick server: internal server name (by default current server) -away: notify when away message is changed (by doing whois on nick) del: delete a notification -all: delete all notifications Without argument, this command displays notifications for current server (or all servers if command is issued on core buffer). Examples: notify when "toto" joins/quits current server: /notify add toto notify when "toto" joins/quits freenode server: /notify add toto freenode notify when "toto" is away or back on freenode server: /notify add toto freenode -away
de: add: fügt eine Benachrichtigung hinzu nick: Nickname server: interner Name des Servers (Standard: aktueller Server) -away: gibt eine Benachrichtigung aus falls sich die Abwesenheitsnachricht ändert (der Nick wird mittels whois abgefragt) del: entfernt eine Benachrichtigung -all: entfernt alle Benachrichtigungen Ohne Angabe von Argumenten werden alle Benachrichtigungen für den aktuellen Server angezeigt (um alle Server abzufragen muss der Befehl im Core Buffer ausgeführt werden). Beispiele: Benachrichtigung falls sich "toto" am aktuellen Server an- oder abmeldet: /notify add toto Benachrichtigung falls sich "toto" am freenode Server an- oder abmeldet: /notify add toto freenode Benachrichtigung falls "toto" den Befehl away am freenode Server nutzt: /notify add toto freenode -away

source: give channel operator status to nick(s)
de: Channel-Operator Status an Nicknamen vergeben

source: get operator privileges
de: Operator Privilegien anfordern

source: user: user password: password
de: user: Username password: Passwort

source: leave a channel
de: Einen Channel verlassen

source: channel: channel name to leave message: part message (displayed to other users)
de: channel: Name des Channels welcher verlassen werden soll message: Abschiedsnachricht (wird anderen Usern angezeigt)

source: send a ping to server
de: sendet einen Ping an den Server

source: server1: server server2: forward ping to this server
de: server1: Server server2: Ping an diesen Server weiterleiten

source: answer to a ping message
de: Auf Ping antworten

source: daemon: daemon who has responded to Ping message daemon2: forward message to this daemon
de: Daemon: Daemon welcher auf die Ping-Nachricht geantwortet hat Daemon2: Nachricht an diesen Daemon weiterleiten

source: send a private message to a nick
de: Eine private Nachricht an einen Nick schicken

source: server: send to this server (internal name) nick: nick for private conversation text: text to send
de: server: an diesen Server senden (interner Name) nick: Nickname für privaten Chat text: Text der gesendet werden soll

source: send raw data to server without parsing
de: Daten direkt an Server senden (siehe RFC 2812)

source: server: send to this server (internal name) data: raw data to send
de: server: an diesen Server senden (interner Name wird genutzt) data: unbearbeitete (RAW) Daten die gesendet werden sollen

source: reconnect to server(s)
de: Mit einem oder mehreren Server(n) erneut verbinden

source: server: server name to reconnect -all: reconnect to all servers -nojoin: do not join any channel (even if autojoin is enabled on server) -switch: switch to next server address
de: server: Servername zu welchem neu verbunden werden soll -all: mit allen Servern neu verbinden -nojoin: Channels werden nicht betreten (auch falls autojoin für diesen Server aktiviert ist) -switch: wechselt zur nächsten Server-Adresse

source: tell the server to reload its config file
de: Den Server dazu bringen seine Konfigurationsdatei neu zu laden

source: option: extra option, for some servers
de: option: zusätzliche Option, die von manchen Servern berücksichtigt wird.

source: tell the server to restart itself
de: Den Server dazu bringen sich selbst neu zu starten

source: force a user to join channel(s)
de: Zwingt einen User einen oder mehrere Channel zu betreten

source: nick: nick channel: channel name
de: nick: Nickname channel: Name des Channels

source: change mode on channel, without having operator status
de: Ändert den Modus des Channels ohne das Operator-Privilegien vorliegen

source: channel: channel name mode: mode for channel
de: Channel: Name des Channel Mode: neuer Modus für Channel

source: force a user to use another nick
de: Zwingt einen User den Nick zu ändern

source: nick: nick new_nick: new nick
de: nick: Nickname new_nick: neuer Nickname

source: force a user to leave channel(s)
de: Zwingt einen User den/die Channel(s) zu verlassen

source: force a user to quit server with a reason
de: Zwingt einen User den Server zu verlassen, mit Begründung

source: nick: nick reason: reason
de: nick: Nickname reason: Grund der Abmeldung

source: register a new service
de: Einen neuen Service eintragen

source: distribution: visibility of service type: reserved for future usage
de: distribution: Sichtbarkeit des Services type: für spätere Verwendung reserviert

source: list, add or remove IRC servers
de: Auflisten, Hinzufügen oder Entfernen von IRC-Servern

source: list: list servers (without argument, this list is displayed) listfull: list servers with detailed info for each server add: create a new server server: server name, for internal and display use hostname: name or IP address of server, with optional port (default: 6667), many addresses can be separated by a comma temp: create temporary server (not saved) option: set option for server (for boolean option, value can be omitted) nooption: set boolean option to 'off' (for example: -nossl) copy: duplicate a server rename: rename a server keep: keep server in config file (for temporary servers only) del: delete a server deloutq: delete messages out queue for all servers (all messages WeeChat is currently sending) jump: jump to server buffer raw: open buffer with raw IRC data Examples: /server listfull /server add oftc irc.oftc.net/6697 -ssl -autoconnect /server add oftc6 irc6.oftc.net/6697 -ipv6 -ssl /server add freenode2 chat.eu.freenode.net/6667,chat.us.freenode.net/6667 /server add freenode3 irc.freenode.net -password=mypass /server copy oftc oftcbis /server rename oftc newoftc /server del freenode /server deloutq
de: list: listet Server auf (Standardaufruf) listfull: listet Server mit detaillierten Informationen über jeden einzelnen Server auf add: erstellt einen neuen Server server: Servername, dient der internen Nutzung und zur Darstellung hostname: Name oder IP-Adresse des Servers. Optional kann noch der Port festgelegt werden (Standard-Port: 6667). Verschiedene Ports können durch Kommata getrennt werden temp: erstellt temporären Server (wird nicht gespeichert) option: legt die Optionen für den Server fest (die Boolean-Optionen können weggelassen werden) nooption: stellt die Boolean Option auf "off" (Beispiel: -nossl) copy: erstellt eine Kopie des Servers rename: benennt den Server um keep: behält den Server in der Konfigurationsdatei (ausschließlich für die Nutzung bei temporären Servern) del: entfernt einen Server deloutq: löscht bei allen Servern alle ausgehende Nachrichten, die in der Warteschlange stehen (dies betrifft alle Nachrichten die WeeChat gerade sendet) jump: springt zum Server-Buffer raw: öffnet Buffer mit Roh-IRC-Daten Beispiele: /server listfull /server add oftc irc.oftc.net/6697 -ssl -autoconnect /server add oftc6 irc6.oftc.net/6697 -ipv6 -ssl /server add freenode2 chat.eu.freenode.net/6667,chat.us.freenode.net/6667 /server add freenode3 irc.freenode.net -password=mypass /server copy oftc oftcbis /server rename oftc newoftc /server del freenode /server deloutq

source: list services currently connected to the network
de: Zur Zeit verbundene Services auflisten

source: mask: list only services matching this mask type: list only services of this type
de: mask: nur zutreffende Services auflisten type: nur Services von diesem Typ auflisten

source: deliver a message to a service
de: Nachricht an einen Service senden

source: service: name of service text: text to send
de: service: Name des Service text: zu sendender Text

source: disconnect server links
de: Serververbindungen trennen

source: server: server name comment: comment for quit
de: server: Servername comment: Trennungsgrund

source: query statistics about server
de: Serverstatistik abfragen

source: query: c/h/i/k/l/m/o/y/u (see RFC1459) server: server name
de: query: c/h/i/k/l/m/o/y/u (siehe RFC1459) server: Name des Servers

source: give users who are on a host running an IRC server a message asking them to please join IRC
de: Nutzer die auf dem IRC-Server arbeiten darum bitten auf den IRC-Server zu kommen

source: user: username target: server name channel: channel name
de: user: Benutzername target: Servername channel: Channelname

source: query local time from server
de: Ortszeit des Servers abfragen

source: target: query time from specified server
de: Ziel: Zeit des angegebenen Servers abfragen.

source: get/set channel topic
de: Thema des Channels abfragen/setzen

source: channel: channel name topic: new topic for channel -delete: delete channel topic
de: channel: Name des Channels topic: Thema für den Channel -delete: entfernt das Thema des Channels

source: find the route to specific server
de: Route zum angegebenen Server ermitteln

source: unban nicks or hosts
de: Bann aufheben (Nicks oder Hosts)

source: channel: channel for unban nick: user or host to unban
de: channel: Channel in dem der Bann aufzuheben ist nick: User oder Host für den der Bann aufzuheben ist

source: return a list of information about nicks
de: Zeigt Informationen zu Nicknamen an

source: list of users logged into the server
de: Auflistung der User die bei dem Server angemeldet sind

source: give the version info of nick or server (current or specified)
de: Versionsinformation des Nicknamen oder Servers ermitteln (des aktuellen oder angegebenen Nick/Server)

source: server: server name nick: nick
de: server: Servername nick: Nickname

source: give voice to nick(s)
de: Voice an Nick(s) vergeben

source: send a notice to channel ops
de: Nachricht an Channel-Operator verschicken

source: channel: channel name text: text to send
de: channel: Name des Channel text: Text der versendet werden soll

source: send a message to all currently connected users who have set the 'w' user mode for themselves
de: Nachricht an alle User schicken die den 'w'-Mode gesetzt haben

source: text: text to send
de: text: Text der gesendet werden soll

source: generate a query which returns a list of information
de: Erstellung einer Anfrage die eine Anzahl von Informationen zurück gibt.

source: mask: only information which match this mask o: only operators are returned according to the mask supplied
de: Maske: nur Information über betreffende Nicknamen abfragen o: nur Operatoren ausgeben, die dem Filter entsprechen

source: query information about user(s)
de: Information über User abfragen

source: server: server name nick: nick (may be a mask)
de: server: Servername nick: Nickname (oder eine Maske)

source: ask for information about a nick which no longer exists
de: Informationen über einem Nicknamen abfragen welcher nicht mehr angemeldet ist

source: nick: nick to search count: number of replies to return (full search if negative number) target: reply should match this mask
de: nick: Nickname, welcher gesucht werden soll count: maximale Anzahl an Antworten (negative Zahl für eine vollständige Liste) target: Antwort soll auf diese Suchmaske zutreffen

source: %s%s: too few arguments for "%s" command
de: %s%s: Zu wenige Argumente für den Befehl "%s"

source: %s%s: command "%s" must be executed on irc buffer (server or channel)
de: %s%s: Der Befehl "%s" kann nur im IRC-Buffer ausgeführt werden (Server oder Channel)

source: current IRC server
de: aktueller IRC-Server

source: nick on current IRC server
de: Nick beim derzeitigen IRC-Server

source: channels on current IRC server
de: Channels des derzeitigen IRC-Server

source: privates on current IRC server
de: Privat auf aktuellem IRC Server

source: nicks on all channels of current IRC server
de: Nicks für alle Channels auf dem aktuellen IRC-Server

source: IRC servers (internal names)
de: IRC-Server (interne Namen)

source: current IRC channel
de: Aktueller IRC-Channel

source: nicks of current IRC channel
de: Liste der Nicks im aktuellen Channel

source: nicks and hostnames of current IRC channel
de: Liste der Nicks und Hostnamen des aktuellen Channels

source: topic of current IRC channel
de: Thema des aktuellen IRC-Channels

source: channels on all IRC servers
de: Channels auf allen IRC Servern

source: privates on all IRC servers
de: Private auf allen IRC Servern

source: default part message for IRC channel
de: Standardnachricht beim Verlassen (/part) eines IRC-Channels

source: numbers for defined ignores
de: Anzahl für festgelegte /ignores

source: nicks in notify list
de: Nicks für die eine Benachrichtigung existiert

source: %s%s: invalid priorities string, error at this position in string: "%s"
de: %s%s: ungültige Zeichenkette für Prioritäten, Fehler befindet sich an folgender Position der Zeichenkette: "%s"

source: %s%s: warning: server "%s" not found in configuration file, not deleted in memory because it's currently used
de: %s%s: Warnung: Der Server "%s" konnte in der Konfigurationsdatei nicht gefunden werden. Da der Server zur Zeit genutzt wird, konnte er noch nicht entfernt werden

source: buffer used to display message received from IRC server
de: Buffer welcher zur Ausgabe von IRC Server Nachrichten genutzt werden soll

source: %s%s: error creating "%s" => "%s"
de: %s%s: Fehler beim Erstellen von "%s" => "%s"

source: format for CTCP reply or empty string for blocking CTCP (no reply), following variables are replaced: $version (WeeChat version), $compilation (compilation date), $osinfo (info about OS), $site (WeeChat site), $download (WeeChat site, download page), $time (current date and time as text), $username (username on server), $realname (realname on server)
de: Format der CTCP Antwort. Folgende Variablen werden durch den entsprechenden Wert ersetzt: $version (WeeChat Version), $compilation (Datum der Kompilierung), $osinfo (Informationen über genutztes Betriebssystem), $site (WeeChat Webseite), $download (Download-Seite von WeeChat), $time (aktuelles Datum und Uhrzeit, als Text), $username (Username auf Server), $realname (Realname auf Server). Durch die Nutzung einer leeren Zeichenkette wird die CTCP Antwort blockiert.

source: %s%s: error creating CTCP "%s" => "%s"
de: %s%s: Fehler bei CTCP Erstellung "%s" => "%s"

source: list of hostname/port or IP/port for server (separated by comma)
de: Liste der Hostnamen/Ports oder IP/Ports des Servers (durch Komma getrennt)

source: proxy used for this server (optional)
de: Proxy, der für diesen Server verwendet wird (optional)

source: use IPv6 protocol for server communication
de: Server über IPv6 ansprechen

source: use SSL for server communication
de: Server über SSL ansprechen
