Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: WeeChat %s Copyright %s, compiled on %s %s Developed by Sebastien Helleu <flashcode@flashtux.org> - %s
de: WeeChat %s Copyright %s, kompiliert am %s %s Entwickelt von Sebastien Helleu <flashcode@flashtux.org> - %s

source: Usage: %s [option...] [plugin:option...]
de: Aufruf: %s [Option...] [Erweiterung:Option...]

source: -a, --no-connect disable auto-connect to servers at startup -c, --colors display default colors in terminal -d, --dir <path> set WeeChat home directory (default: ~/.weechat) -h, --help this help -k, --keys display WeeChat default keys -l, --license display WeeChat license -p, --no-plugin don't load any plugin at startup -s, --no-script don't load any script at startup -v, --version display WeeChat version plugin:option option for plugin for example, irc plugin can connect to server with url like: irc[6][s]://[nickname[:password]@]irc.example.org[:port][/#channel1][,#channel2[...]] (look at plugins documentation for more information about possible options)
de: -a, --no-connect deaktiviert das automatische Verbinden mit den Servern, beim Start von WeeChat -c, --colors zeigt die Standardfarben des Terminals an -d, --dir <Pfad> legt den Konfigurationsordner für WeeChat fest (Voreinstellung: ~/.weechat) -h, --help zeigt diese Hilfe an -k, --keys zeigt die Standard-Tastaturbelegung an -l, --license zeigt die Lizenz von WeeChat an -p, --no-plugin unterbindet das Laden der Erweiterungen, beim Programmstart -s, --no-script Skripten werden beim Programmstart nicht geladen -v, --version zeigt die Version von WeeChat an plugin:option Option für Erweiterung Beispiel: Die IRC-Erweiterung kann sich mit einem Server folgender URL verbinden: irc[6][s]://[nickname[:password]@]irc.beispiel.org[:port][/#channel1][,#channel2[...]] (siehe Dokumentation zu den IRC-Erweiterungen um zusätzliche Informationen zu den mögliche Optionen zu erhalten.)

source: %s default keys (context: "%s"):
de: %s Standardtastenbelegungen (Kontext: "%s"):

source: Error: missing argument for "%s" option
de: Fehler: fehlendes Argument für die Option "%s"

source: Error: WEECHAT_HOME is undefined, check build options
de: Fehler: WEECHAT_HOME ist nicht definiert, bitte überprüfen Sie die build Optionen

source: Error: unable to get HOME directory
de: Fehler: Das HOME-Verzeichnis kann nicht ermittelt werden

source: Error: not enough memory for home directory
de: Fehler: nicht genug Speicher für das HOME-Verzeichnis

source: Error: home (%s) is not a directory
de: Fehler: HOME (%s) ist kein Verzeichnis

source: Error: cannot create directory "%s"
de: Fehler: Das Verzeichnis "%s" kann nicht anlegt werden.

source: List of bars:
de: Liste der vorhandenen Infobars:

source: %s%s%s: %s%s%s (cond: %s), %s, filling: %s(top/bottom)/%s(left/right), %s: %s
de: %s%s%s: %s%s%s (Zustand: %s), %s, Füllstand: %s(oben/unten)/%s(links/rechts), %s: %s

source: (hidden)
de: (versteckt)

source: height
de: Höhe

source: width
de: Breite

source: priority: %d, fg: %s, bg: %s, items: %s%s
de: Priorität: %d, fg: %s, bg: %s, Objekte: %s%s

source: , with separator
de: , mit Separator

source: No bar defined
de: Keine Infobar definiert

source: List of bar items:
de: Auflistung der Bar-Items:

source: %s (plugin: %s)
de: %s (Erweiterung: %s)

source: No bar item defined
de: Es wurde kein Bar-Item festgelegt

source: %sError: name can not start with "#"
de: %sFehler: Name darf nicht mit "#"beginnen

source: %sNot enough memory
de: %sNicht genügend Speicher

source: %sError: wrong type "%s" for bar "%s"
de: %sFehler: falscher Typ "%s" für Bar "%s"

source: %sError: wrong position "%s" for bar "%s"
de: %sFehler: ungültige Position "%s" für Bar "%s"

source: Bar "%s" created
de: Infobar "%s" erstellt

source: %sError: failed to create bar "%s"
de: %sFehler: Infobar "%s" konnte nicht erstellt werden

source: %sError: wrong size "%s" for bar "%s"
de: %sFehler: fehlerhafte Größe "%s" für Infobar "%s"

source: All bars have been deleted
de: Alle Infobars wurden entfernt

source: %sError: unknown bar "%s"
de: %sFehler: Infobar "%s" ist unbekannt

source: Bar deleted
de: Infobar entfernt

source: %sError: unable to set option "%s" for bar "%s"
de: %sFehler: Die Option "%s" kann für Infobar "%s" nicht gesetzt werden

source: %sError: window not found for "%s" command
de: %sFehler: Fenster für den Befehl "%s" nicht gefunden

source: %sError: unable to scroll bar "%s"
de: %sFehler: Infobar "%s" kann nicht gescrollt werden

source: %sError: unknown option for "%s" command
de: %sFehler: unbekannte Option für den Befehl "%s"

source: Buffers list:
de: Liste der vorhandenen Buffer:

source: %s[%s%d%s]%s (%s) %s%s%s (notify: %s)
de: %s[%s%d%s]%s (%s) %s%s%s (Benachrichtigung: %s)

source: %sError: incorrect buffer number
de: %sFehler: falsche Buffer-Nummer

source: %sError: WeeChat main buffer can't be closed
de: %sFehler: Der WeeChat-Hauptbuffer kann nicht geschlossen werden

source: Local variables for buffer "%s":
de: Lokale Variablen für Buffer "%s":

source: No local variable defined for buffer "%s"
de: Keine lokale Variable definiert für Buffer "%s"

source: %sInvalid color number "%s" (must be between %d and %d)
de: %sungültige Farbnummer "%s" (der Wert muss zwischen %d und %d liegen)

source: %sColor "%s" is not defined in palette
de: %sFarbe "%s" ist in der Farbpalette nicht definiert

source: %sPlugin "%s" not found
de: %sErweiterung "%s" wurde nicht gefunden

source: Raw content of buffers has been written in log file
de: Der Inhalt des Buffers wurde im Rohformat in die Protokolldatei geschrieben.

source: Debug disabled for "%s"
de: Debug deaktiviert für "%s"

source: (disabled)
de: (deaktiviert)

source: Message filtering enabled
de: Filterung von Nachrichten ist aktiviert

source: Message filtering disabled
de: Filterung von Nachrichten deaktiviert

source: Message filters:
de: Nachrichtenfilter:

source: No message filter defined
de: Kein Nachrichtenfilter definiert

source: Filter "%s" enabled
de: Filter "%s" ist aktiviert

source: %sError: filter "%s" not found
de: %sFehler: Filter "%s" nicht gefunden

source: Filter "%s" disabled
de: Filter "%s" deaktiviert

source: %sError: filter "%s" already exists
de: %sFehler: Filter "%s" existiert bereits

source: %sError: you must specify at least tag(s) or regex for filter
de: %sFehler: Für Filter muss ein tag oder ein regulärer Ausdruck spezifiziert werden

source: Filter "%s" added:
de: Filter "%s" hinzugefügt:

source: %sError adding filter
de: %sFehler: Beim Hinzufügen eines Filters

source: Filter "%s" renamed to "%s"
de: Filter "%s" wurde umbenannt. Der neue Name lautet "%s"

source: %sError: unable to rename filter "%s" to "%s"
de: %sFehler: Umbenennung des Filters von "%s" in "%s" nicht möglich

source: All filters have been deleted
de: Alle Filter wurden gelöscht

source: Filter "%s" deleted
de: Filter "%s" gelöscht

source: description
de: Beschreibung

source: type
de: Typ

source: boolean
de: boolesch

source: values
de: Werte

source: default value
de: Standardwert

source: (undefined)
de: (nicht definiert)

source: current value
de: aktueller Wert

source: string
de: Zeichenkette

source: any string
de: beliebige Zeichenkette

source: any char
de: beliebiges Zeichen

source: max chars
de: maximale Zeichenanzahl

source: color
de: Farbe

source: a WeeChat color name (default, black, (dark)gray, white, (light)red, (light)green, brown, yellow, (light)blue, (light)magenta, (light)cyan), a terminal color number or an alias; attributes are allowed before color (for text color only, not background): "*" for bold, "!" for reverse, "_" for underline
de: ein Farbname für WeeChat (default, black, (dark)gray, white, (light)red, (light)green, brown, yellow, (light)blue, (light)magenta, (light)cyan), eine Terminal-Farbnummer oder ein Alias; Attribute werden vor einer Farbe gesetzt (ausschließlich für die Textfarbe und nicht für den Hintergrund): "*" für fett, "!" für invertiert, "_" für unterstrichen

source: undefined value allowed (null)
de: undefinierter Wert erlaubt (NULL)

source: %sNo help available, "%s" is not a command or an option
de: %sKeine Hilfe verfügbar. "%s" ist weder ein Befehl noch eine Option

source: Buffer command history:
de: Befehlsverlauf des Buffers:

source: default command:
de: Standardbefehl:

source: %d key bindings added or redefined for context "%s":
de: %d Tastenbelegungen die für den Kontext "%s" hinzugefügt oder verändert wurden:

source: %d key bindings deleted for context "%s":
de: %d Tastenbelegungen die für Kontext "%s" entfernt wurden:

source: No key binding added, redefined or removed for context "%s"
de: Es sind für Kontext "%s" weder Tastenbelegungen hinzugefügt, verändert oder gelöscht worden

source: %sError: unable to bind key "%s"
de: %sFehler: kann die Taste "%s" nicht zuordnen

source: Key "%s" has already default value
de: Die Taste "%s" ist schon mit einem Standardbefehl belegt

source: %sError: unable to unbind key "%s"
de: %sFehler: kann die Tastenbelegung "%s" nicht entfernen

source: %sKey "%s" not found
de: %sTastenbelegung "%s" nicht gefunden

source: No key binding defined for context "%s"
de: Keine Tastenbelegung für Kontext "%s" definiert

source: %d key bindings for context "%s":
de: %d Tastenbelegungen für Kontext "%s":

source: No default key binding for context "%s"
de: keine Standardtastenbelegungen für Kontext "%s" vorhanden

source: %d default key bindings for context "%s":
de: %d Standardtastenbelegungen für Kontext "%s":

source: Key:
de: Taste:

source: No key found
de: Keine Taste gefunden

source: %sError: context "%s" not found
de: %sFehler: Kontext"%s" nicht gefunden

source: Default key bindings restored for context "%s"
de: Standardtastenbelegungen wiederhergestellt für Kontext "%s"

source: %sError: "-yes" argument is required for keys reset (security reason)
de: %sFehler: "-yes" Argument ist aus Sicherheitsgründen für den Reset der Tastenbelegung notwendig

source: %d new key added
de: (%d) neue Taste hinzugefügt

source: leaf: id: %d, parent: %d, plugin: "%s", buffer: "%s"
de: Blatt: id: %d, Stamm: %d, Erweiterung: "%s", Buffer: "%s"

source: node: id: %d, parent: %d, child1: %d, child2: %d, size: %d%% (%s)
de: Node: id: %d, Stamm: %d, Kind1: %d, Kind2: %d, Größe: %d%% (%s)

source: horizontal split
de: horizontale Aufteilung

source: vertical split
de: vertikale Aufteilung

source: Saved layout for buffers:
de: Layout gespeichert für die Buffer:

source: Saved layout for windows:
de: gespeicherte Layouts für Fenster:

source: No layout saved
de: Kein Layout gespeichert

source: Layout saved for buffers (order of buffers)
de: Layout der Buffer gesichert (Reihenfolge der Buffer)

source: Layout saved for windows (buffer displayed by each window)
de: Layout der Fenster gesichert (Buffer werden durch jedes Fenster dargestellt)

source: Layout reset for buffers
de: Layout für Buffer zurücksetzen

source: Layout reset for windows
de: Zurücksetzen des Fensterlayouts

source: Mouse enabled
de: Maus ist aktiviert

source: Mouse disabled
de: Maus ist deaktiviert

source: Plugins loaded:
de: Installierte Erweiterungen:

source: written by "%s", license: %s
de: geschrieben von "%s", Lizenz: %s

source: commands hooked:
de: eingehangene (hooked) Befehle:

source: command_run hooked:
de: Befehl_läuft ge-hooked:

source: timers hooked:
de: eingehangene (hooked) Timer:

source: %d %s (%d calls remaining)
de: %d %s (%d Aufrufe verbleiben)

source: second
de: Sekunde

source: millisecond
de: Millisekunde

source: %d %s (no call limit)
de: %d %s (keine Begrenzung für Aufruf)

source: fd hooked:
de: fd ge-hooked:

source: read
de: lese

source: write
de: schreibe

source: exception
de: Unterbrechung

source: process hooked:
de: eingehangener (hooked) Prozess:

source: command: '%s', child pid: %d
de: Befehl: '%s', Kind pid: %d

source: connect hooked:
de: eingehangener (hooked) Connect:

source: socket: %d, address: %s, port: %d, child pid: %d
de: Socket: %d, Adresse: %s, Port: %d, Kind pid: %d

source: prints hooked:
de: eingehangene (hooked) Prints:

source: buffer: %s, message: "%s"
de: Buffer: %s, Nachricht: "%s"

source: (none)
de: (keine)

source: message: "%s"
de: Nachricht: "%s"

source: signals hooked:
de: eingehangene (hooked) Signale:

source: (all)
de: (alle(s))

source: configuration options hooked:
de: eingehangene (hooked) Konfiguration-Optionen:

source: completions hooked:
de: eingehangene (hooked) Vervollständigungen:

source: modifiers hooked:
de: modifiers ge-hooked:

source: No plugin found
de: Keine Erweiterung gefunden

source: (no plugin)
de: (keine Erweiterung)

source: %sError: wrong argument count for "%s" command
de: %sFehler: fehlerhafte Anzahl von Argumenten für den Befehl "%s"

source: List of proxies:
de: Liste der Proxys:

source: %s%s%s: %s, %s/%d (%s), username: %s, password: %s
de: %s%s%s: %s, %s/%d (%s), Username: %s, Passwort: %s

source: No proxy defined
de: Kein Proxy definiert

source: %sError: wrong type "%s" for proxy "%s"
de: %sFehler: falscher Typ "%s" für Proxy "%s"

source: Proxy "%s" created
de: Proxy "%s" erstellt

source: %sError: failed to create proxy "%s"
de: %sFehler: konnte den Proxy "%s" nicht erstellen

source: %sError: wrong port "%s" for proxy "%s"
de: %sFehler: falscher Port "%s" für den Proxy "%s"

source: All proxies have been deleted
de: Alle Proxys wurden gelöscht

source: %sError: unknown proxy "%s"
de: %sFehler: unbekannter Proxy "%s"

source: Proxy deleted
de: Proxy gelöscht

source: %sError: unable to set option "%s" for proxy "%s"
de: %sFehler: Option "%s" kann für den Proxy "%s" nicht setzt werden

source: %sYou must confirm quit command with extra argument "-yes" (see /help quit)
de: %sUm WeeChat zu beenden muss der "/quit" Befehl mit der Option "-yes" ausgeführt werden (siehe /help quit)

source: Options reloaded from %s
de: Konfiguration, %s, wurde neu geladen

source: %sError: failed to reload options from %s
de: %sFehler: Optionen von %s konnten nicht neu geladen werden

source: Unknown configuration file "%s"
de: Unbekannte Konfigurationsdatei "%s"

source: %sError: incorrect number
de: %sFehler: fehlerhafte Nummer

source: Options saved to %s
de: Optionen gesichert unter %s

source: %sError: failed to save options to %s
de: %sFehler: Optionen konnten nicht unter %s gesichert werden

source: (unknown)
de: (unbekannt)

source: %sOption "%s" not found (tip: you can use "*" at beginning and/or end of option to see a sublist)
de: %sOption "%s" nicht gefunden (Tipp: Der Platzhalter "*" kann zu Beginn und/oder am Ende genutzt werden um Gruppen von Optionen anzusprechen)

source: No configuration option found
de: Konfigurationsoption nicht gefunden

source: %s%d%s configuration option found matching with "%s"
de: %s%d%s Konfigurationsoption gefunden die auf "%s" zutrifft.

source: %s%d%s configuration option found
de: %s%d%s Konfigurationsoption gefunden

source: %sError: failed to set option "%s"
de: %sFehler: Option "%s" konnte nicht gesetzt werden

source: %sError: configuration option "%s" not found
de: %sFehler: Konfigurationsoption "%s" nicht gefunden

source: Option changed:
de: Option geändert:

source: Option created:
de: Option erstellt:

source: Option changed
de: Option geändert

source: %sFailed to unset option "%s"
de: %sOption "%s" konnte nicht zurück gesetzt werden

source: Option reset:
de: Option wieder hergestellt:

source: Option removed: %s
de: Option gelöscht: %s

source: %d option(s) reset, %d option(s) removed
de: %d Option(en) wieder hergestellt, %d Option(en) entfernt

source: %sCan't upgrade: there is one or more background process (hook type 'process' or 'connect')
de: %sUpgrade nicht möglich: Ein- oder mehrere Hintergrundprozesse laufen noch (Hook-Typ 'process' oder 'connect')

source: %sCan't upgrade: WeeChat binary "%s" does not exist
de: %sUpgrade nicht möglich: WeeChat Binärcode "%s" existiert nicht

source: %sCan't upgrade: WeeChat binary "%s" does not have execute permissions
de: %sUpgrade nicht möglich: WeeChat Binärcode "%s" besitzt nicht die notwendigen Rechte

source: Upgrading WeeChat with binary file: "%s"...
de: Aktualisiere WeeChat mit Binärdatei "%s"....

source: %sError: unable to save session in file
de: %sFehler: Sitzung kann nicht in eine Datei gespeichert werden

source: ***** Error: exec failed (program: "%s"), exiting WeeChat
de: ***** Fehler: Ausführung schlug fehl (Programm: "%s"), WeeChat wird beendet

source: WeeChat uptime: %d %s %02d:%02d:%02d, started on %s
de: WeeChat Uptime: %d %s %02d:%02d:%02d, gestartet am %s

source: day
de: Tag

source: WeeChat uptime: %s%d %s%s %s%02d%s:%s%02d%s:%s%02d%s, started on %s%s
de: WeeChat Uptime: %s%d %s%s %s%02d%s:%s%02d%s:%s%02d%s, gestartet am %s%s

source: compiled on
de: kompiliert am

source: Upgraded %d %s, first start: %s
de: Es wurde zum %d %s ein Upgrade durchgeführt, erster Start: %s

source: time
de: mal

source: Windows list:
de: Fensterliste:

source: %sError: incorrect window number
de: %sFehler: falsche Nummer für Fenster

source: %sError: can not merge windows, there's no other window with same size near current one
de: %sFehler: Fenster können nicht nicht zusammenfügt werden. Es existiert kein Fenster mit der selben Größe neben dem aktuellen Fenster

source: toggle away status
de: Abwesenheitsstatus ein-/ausschalten

source: -all: toggle away status on all connected servers message: message for away (if no message is given, away status is removed)
de: -all: Abwesenheitszustand auf allen Servern ändern message: Abwesenheitsnachricht (ohne eine Nachricht wird der Abwesenheitszustand deaktivieren)

source: manage bars
de: Infobars verwalten

source: list: list all bars listfull: list all bars (verbose) listitems: list all bar items add: add a new bar name: name of bar (must be unique) type: root: outside windows, window: inside windows, with optional conditions (see below) cond1,...: condition(s) for displaying bar (only for type "window"): active: on active window inactive: on inactive windows nicklist: on windows with nicklist without condition, bar is always displayed position: bottom, top, left or right size: size of bar (in chars) separator: 1 for using separator (line), 0 or nothing means no separator item1,...: items for this bar (items can be separated by comma (space between items) or "+" (glued items)) default: create a default bar (all default bars if no bar name is given) del: delete a bar (or all bars with -all) set: set a value for a bar property option: option to change (for options list, look at /set weechat.bar.<barname>.*) value: new value for option hide: hide a bar show: show an hidden bar toggle: hide/show a bar scroll: scroll bar window: window number (use '*' for current window or for root bars) scroll_value: value for scroll: 'x' or 'y' (optional), followed by '+', '-', 'b' (beginning) or 'e' (end), value (for +/-), and optional % (to scroll by % of width/height, otherwise value is number of chars) Examples: create a bar with time, buffer number + name, and completion: /bar add mybar root bottom 1 0 [time],buffer_number+:+buffer_name,completion hide a bar: /bar hide mybar scroll nicklist 10 lines down on current buffer: /bar scroll nicklist * y+10 scroll to end of nicklist on current buffer: /bar scroll nicklist * ye
de: list: listet alle Infobars auf listfull: listet alle Infobars detailliert auf (Standardaufruf) listitems: listet alle Items auf, die in den Infobars genutzt werden add: füge eine neue Infobar hinzu name: Name der Infobar (muss einmalig sein) type: root: außerhalb des Fensters, window: innerhalb des Fensters, mit optionalen Merkmalen (siehe unten) cond1,...: Merkmal(e) für eine Infobar (nur nutzbar mit der Type-Option "window"): active: in einem aktiven Fenster inactive: in einem inaktiven Fenster nicklist: in Fenstern mit einer Nickliste werden keine Merkmale angegeben, ist die Infobar immer sichtbar position: bottom (unten), top (oben), left (links) oder right (rechts) size: Größe der Infobar (in Zeichen) separator: 1 um eine Trennlinien zu zeichnen, bei 0 oder ohne eine Angabe wird keine Trennlinien gezeichnet item1,...: Items die in der Infobar genutzt werden sollen (Items können durch Kommata oder Leerzeichen getrennt werden ("+" (verbindet Items)) default: erstellt standardisierte Infobars del: entfernt eine Infobar (alle Infobars können mit der Option "-all" entfernt werden). set: setzt einen Wert für Infobar option: Option die verändert werden soll (für eine Liste aller möglichen Optionen, bitte folgenden Befehl nutzen: /set weechat.bar.<barname>.*) value: neuer Wert für Option hide: Infobar wird ausgeblendet show: zeigt eine ausgeblendete Infobar an toggle: zeigt/versteckt eine Infobar scroll: scrollt Infobar hoch/runter window: Nummer des Fensters (nutze '*' für aktuelles Fenster oder für die Root-Bars) scroll_value: Werte für Scroll-Funktion: 'x' oder 'y', gefolgt von '+', '-', 'b' (Beginn) oder 'e' (Ende), Wert (für +/-), und optional % (zum scrollen der Breite/Höhe in %, ansonsten wird dieser Wert als Anzahl der Zeichen interpretiert um die gescrollt werden soll) Beispiele: erstellt eine Infobar mit den Items: time, buffer number + name, und Vervollständigung: /bar add mybar root bottom 1 0 [time],buffer_number+:+buffer_name,completion versteckt die Infobar (meinebar): /bar hide meinebar scrollt die Nickliste im aktuellen Buffer um 10 Zeilen nach unten: /bar scroll nicklist * y+10 scrollt zum Ende der Nicklist im aktuellen Buffer: /bar scroll nicklist * ye

source: manage buffers
de: Buffer verwalten
