Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: ssl certificate file used to automatically identify your nick ("%h" will be replaced by WeeChat home, "~/.weechat" by default)
de: Datei für ssl Zertifikat um automatisch den eigenen Nick zu identifizieren ("%h" wird durch das WeeChat Verzeichnis ersetzt, Standardverzeichnis: "~/.weechat")

source: string with priorities for gnutls (for syntax, see documentation of function gnutls_priority_init in gnutls manual, common strings are: "PERFORMANCE", "NORMAL", "SECURE128", "SECURE256", "EXPORT", "NONE")
de: Zeichenkette mit Prioritäten für gnutls (für die korrekte Syntax siehe gnutls Dokumentation unter Funktion gnutls_priority_init. Gebräuchliche Zeichenketten sind: "PERFORMANCE", "NORMAL", "SECURE128", "SECURE256", "EXPORT", "NONE")

source: size of the key used during the Diffie-Hellman Key Exchange
de: Größe des Schlüssels der während des Diffie-Hellman-Schlüsselaustausches genutzt wurde

source: check that the ssl connection is fully trusted
de: Überprüfe ob die SSL-Verbindung vertrauenswürdig ist

source: password for server
de: Passwort für den Server

source: mechanism for SASL authentication
de: Vorrichtung zur SASL Authentifizierung

source: username for SASL authentication
de: Username für SASL Authentifizierung

source: password for SASL authentication
de: Passwort für SASL Authentifizierung

source: timeout (in seconds) before giving up SASL authentication
de: Zeitüberschreitung (in Sekunden) bis zum Abbruch der SASL Authentifizierung

source: automatically connect to server when WeeChat is starting
de: Beim Programmstart von Weechat automatisch mit dem Server verbinden

source: automatically reconnect to server when disconnected
de: Nach einer Trennung vom Server die Verbindung automatisch wiederherstellen

source: delay (in seconds) before trying again to reconnect to server
de: Zeit (in Sekunden) die gewartet werden soll bevor ein neuer Verbindungsaufbau durchgeführt werden soll

source: nicknames to use on server (separated by comma)
de: Nicknamen, die auf dem IRC-Server benutzt werden sollen (durch Komma getrennt)

source: user name to use on server
de: Benutzername für diesen Server

source: real name to use on server
de: Realen Namen bei diesem Server nutzen

source: custom local hostname/IP for server (optional, if empty local hostname is used)
de: benutzerdefinierter lokaler Hostname bzw. IP-Adresse für den entsprechenden Server (optional). Falls kein Eintrag vorhanden sein sollte wird der lokale Hostname verwendet

source: command(s) to run when connected to server (many commands should be separated by ";", use "\;" for a semicolon, special variables $nick, $channel and $server are replaced by their value)
de: Enthält Befehle die nach der Verbindung zum Server ausgeführt werden sollen. Mehrere Befehle müssen durch ein ";" getrennt werden. Möchte man ein Semikolon schreiben muss man "\;" verwenden. Die speziellen Variablen $nick, $channel und $server werden dabei durch den jeweiligen Wert ersetzt

source: delay (in seconds) after command was executed (example: give some time for authentication)
de: Wartezeit in Sekunden nach Ausführung des Befehls, um z.B. eine Authentifizierung zu ermöglichen

source: comma separated list of channels to join when connected to server (example: "#chan1,#chan2,#chan3 key1,key2")
de: Durch Kommata getrennte Liste der Channels, die beim Verbinden zum Server betreten werden sollen (Beispiel: "#chan1,#chan2,#chan3 key1,key2")

source: automatically rejoin channels after kick
de: Channels automatisch betreten, falls man ge-kickt wurde.

source: delay (in seconds) before autorejoin (after kick)
de: Wartezeit, in Sekunden, die verstreichen soll bevor man den Channel automatisch erneut betritt (nachdem man ge-kickt wurde)

source: timeout (in seconds) between TCP connection to server and message 001 received, if this timeout is reached before 001 message is received, WeeChat will disconnect from server
de: Wartezeit (in Sekunden) zwischen einer TCP Verbindung mit dem Server und des Empfanges der message 001. Falls die Wartezeit verstreichen sollte bevor die message 001 empfangen wurde dann wird WeeChat die Verbindung zum Server trennen.

source: anti-flood for high priority queue: number of seconds between two user messages or commands sent to IRC server (0 = no anti-flood)
de: Anti-Flood für dringliche Inhalte: Zeit in Sekunden zwischen zwei Benutzernachrichten oder Befehlen die zum IRC Server versendet wurden (0 = Anti-Flood deaktivieren)

source: anti-flood for low priority queue: number of seconds between two messages sent to IRC server (messages like automatic CTCP replies) (0 = no anti-flood)
de: Anti-Flood für weniger dringliche Inhalte: Zeit in Sekunden zwischen zwei Benutzernachrichten, die zum IRC Server versendet wurden. Beispiel: automatische CTCP Antworten. (0 = Anti-Flood deaktivieren)

source: interval between two checks for away (in minutes, 0 = never check)
de: Überprüft die Abwesenheit (/away) der Nutzer, in dem angegebenen Intervall (in Minuten, 0 = nicht überprüfen)

source: do not check away nicks on channels with high number of nicks (0 = unlimited)
de: Die Abwesenheit von Nutzern in Channels wird nicht überprüft wenn die Anzahl der Nutzer höher ist, als der angegebene Wert (0 = unbegrenzte Anzahl an Nutzern im Channel)

source: default part message (leaving channel) ("%v" will be replaced by WeeChat version in string)
de: Standardnachricht beim Verlassen eines Channels ("%v": wird durch die WeeChat-Version ersetzt)

source: default quit message (disconnecting from server) ("%v" will be replaced by WeeChat version in string)
de: Standardnachricht beim Beenden (Verbindung zum Server trennen) ("%v": wird durch die WeeChat-Version ersetzt)

source: notify list for server (you should not change this option but use /notify command instead)
de: Liste mit Benachrichtigung für Server (diese Option sollte nicht direkt verändert werden. Dazu sollte der Befehl /notify genutzt werden)

source: %s%s: error creating server "%s"
de: %s%s: Fehler bei der Erstellung des Servers "%s"

source: %s%s: error creating server option "%s"
de: %s%s: Fehler bei der Erstellung der Server-Option "%s"

source: auto switch to channel buffer when it is auto joined (with server option "autojoin")
de: wechselt automatisch zum Channel-Buffer falls dieser automatisch betreten wurde (mittels der Server-Option "autojoin")

source: auto switch to channel buffer when it is manually joined (with /join command)
de: wechselt automatisch zum Channel-Buffer falls dieser manuell betreten wurde (mittels dem /join Befehl)

source: use nick color in output of /names (or list of nicks displayed when joining a channel)
de: nutzt in der Ausgabe von /names die Nickfarbe (oder bei der Auflistung der Nicks wenn man einen Channel betritt)

source: use nick color in nicklist
de: Nutzt die Nickfarben in der Nicklist

source: use nick color in messages from server
de: Nutze Nick-Farbe bei Nachrichten vom Server

source: use same nick color for channel and private
de: Nutzt die selbe Farbe für die Darstellung des Nicks im Channel als auch Privat

source: merge server buffers
de: Server-Buffer zusammenlegen

source: force position of new channel in list of buffers (none = default position (should be last buffer), next = current buffer + 1, near_server = after last channel/pv of server)
de: Ein neu geöffneter Channel wird auf eine Position gezwungen (none = standardmäßige Position (sollte der letzte Buffer in der Liste sein), next = aktueller Buffer + 1, near_server = nach dem letztem Channel/privaten Buffer des jeweiligen Servers)

source: force position of new private in list of buffers (none = default position (should be last buffer), next = current buffer + 1, near_server = after last channel/pv of server)
de: Ein neuer privater Buffer wird auf eine Position gezwungen (none = standardmäßige Position (sollte der letzte Buffer in der Liste sein), next = aktueller Buffer + 1, near_server = nach dem letztem Channel/privaten Buffer des jeweiligen Servers)

source: text to display before nick in chat window
de: Text, der im Chatfenster vor dem Nickname erscheinen soll

source: text to display after nick in chat window
de: Text, der im Chatfenster nach dem Nickname erscheinen soll

source: force color for some nicks: hash computed with nickname to find color will not be used for these nicks (format is: "nick1:color1;nick2:color2")
de: Erzwingt für einen Nick eine spezielle Farbe. Die mittels Streuwertfunktion aus dem Nicknamen generierte Nickfarbe findet für diese Nicks keine Anwendung (Format:"Nick1:Farbe1;Nick2:Farbe2")

source: chars used to stop in nick when computing color with letters of nick (at least one char outside this list must be in string before stopping) (example: nick "|nick|away" with "|" in chars will return color of nick "|nick")
de: Zeichen die genutzt werden sollen damit bei der Generierung der Farbe für einen Nicknamen abgebrochen wird. Es muss mindestens ein Zeichen im Nicknamen enthalten sein der nicht in dieser Liste aufgeführt wird, damit eine Farbe für den Nicknamen erstellt werden kann (Beispiel: Der Nickname lautet "|nick|abwesend" wobei das Zeichen "|" ignoriert werden soll. Die Farbe für den Nicknamen wird nun für "|nick" anstelle von "|nick|abwesend" erstellt).

source: smart completion for nicks (completes first with last speakers)
de: Intelligente Vervollständigung von Nicknamen (vervollständigt zuerst den letzten Nick, mit dem gesprochen wurde)

source: display message when (un)marking as away
de: Bei Abwesenheit und Rückkehr eine Nachricht anzeigen

source: display CTCP message even if it is blocked
de: CTCP Nachrichten werden angezeigt, obwohl sie unterdrückt werden

source: display CTCP reply sent by WeeChat
de: CTCP Antworten, die durch WeeChat versendet wurden, werden angezeigt

source: display CTCP message even if it is unknown CTCP
de: unbekannte CTCP Nachrichten werden angezeigt.

source: display host in join messages
de: Zeigt den Host in einer join Nachricht an

source: display host in join messages from local client
de: Zeigt den Host in join Nachrichten des lokalen Client an

source: display host in part/quit messages
de: Zeigt den Host in einer part/quit Nachricht an

source: display old topic when channel topic is changed
de: Zeige das alte Thema, falls das Thema des Channels geändert wurde

source: display remote away message only once in private
de: In einer privaten Unterhaltung nur einmal eine Abwesenheitsnachricht anzeigen

source: display a message in private when user is back (after quit on server)
de: Es wird bei einer privaten Unterhaltung eine Mitteilung ausgegeben falls der User wieder zurück ist (falls der User sich beim Server abgemeldet hat)

source: display server away message in away bar item
de: Abwesenheitsnachricht in der Away-Bar-Item anzeigen

source: display channel modes in "buffer_name" bar item
de: Zeige die Channel-Modi mittels "buffer_name" in der Bar-Item an

source: hide channel key if modes are displayed in "buffer_name" bar item (this will hide all channel modes arguments if mode +k is set on channel)
de: Unterdrückt Channel-Key falls die Modi in der Bar-Item mittels "buffer_name" dargestellt werden (diese Option unterdrückt alle Channel-Modi falls der Modus für den Channel auf +k gesetzt wurde)

source: display nick modes in "input_prompt" bar item
de: Zeige Nick-Modi in "input_prompt" Bar-Item

source: display nick prefix in "input_prompt" bar item
de: Der Nick-Präfix wird in "input_prompt" Bar-Item angezeigt

source: hide password displayed by nickserv
de: Von NickServ angezeigte Passwörter verstecken

source: comma separated list of tags for messages that may produce highlight (usually any message from another user, not server messages,..)
de: Eine durch Kommata getrennte Liste von Tags die bei einer Nachricht selbige hervorhebt (Highlight). (normalerweise trifft dies auf jede Nachricht eines Users zu, ausgenommen Nachrichten vom Server,..)

source: name of bar item where IRC server is displayed (for status bar)
de: Name der Bar-Item in dem der IRC Server angezeigt wird (für Status-Bar)

source: default target buffer for msgbuffer options when target is private and that private buffer is not found
de: Standardbuffer der für Ausgaben genutzt werden soll falls ein privater Buffer nicht gefunden wird.

source: display notices as private messages (if auto, use private buffer if found)
de: Zeigt Notizen als private Nachricht an (wird die "auto" Option verwendet dann wird ein privater Buffer genutzt, falls vorhanden)

source: comma separated list of tags used in messages printed by notify when a nick joins or quits server (result of command ison), for example: "notify_highlight", "notify_message" or "notify_private"
de: Durch Kommata getrennte Liste von Tags die in der Nachricht von notify ausgegeben werden sollen falls sich ein Nick beim Server an- oder abmeldet (Rückgabe vom Befehl ison), zum Beispiel: "notify_highlight","notify_message" oder "notify_private"

source: comma separated list of tags used in messages printed by notify when a nick away status changes (result of command whois), for example: "notify_highlight", "notify_message" or "notify_private"
de: Durch Kommata getrennte Liste von Tags die in der Nachricht von notify ausgegeben werden sollen falls ein Nick den Befehl away nutzt (Rückgabe vom Befehl whois), zum Beispiel: "notify_highlight", "notify_message" oder "notify_private"

source: close buffer when /part is issued on a channel
de: Schließt den Buffer wenn "/part" im Channel ausgeführt wird

source: number of raw messages to save in memory when raw data buffer is closed (messages will be displayed when opening raw data buffer)
de: Anzahl der IRC-RAW-Nachrichten die im Speicher gehalten werden sollen falls der RAW-Daten-Buffer geschlossen ist (die Nachrichten werden umgehend angezeigt sobald der RAW-Daten-Buffer geöffnet wird)

source: filter join/part/quit/nick messages for a nick if not speaking for some minutes on channel (you must create a filter on tag "irc_smart_filter")
de: Filtert join/part/quit/nick Nachrichten für einen Nick der einige Minuten im Channel inaktiv gewesen ist. Dazu muss ein Filter im tag "irc_smart_filter" erstellt werden.

source: delay for filtering join/part/quit messages (in minutes)
de: Verzögerung, in Minuten, in denen join/part/quit Nachrichten gefiltert werden

source: enable smart filter for "join" messages
de: aktiviert einen Filter für "join" Nachrichten

source: enable smart filter for "part" and "quit" messages
de: aktiviert einen Filter für "part" und "quit" Nachrichten

source: enable smart filter for "nick" messages
de: aktiviert einen Filter für Nachrichten von einem "Nick"

source: strip colors in topic (used only when displaying buffer title)
de: Farben werden im Channel-Thema entfernt (wird nur genutzt wenn der Buffer-Titel angezeigt wird)

source: color for text in join messages
de: Textfarbe in der die Meldungen für das Betreten eines Channels angezeigt werden soll

source: color for text in part/quit messages
de: Textfarbe in der die Meldungen für das Verlassen/Beenden eines Channels angezeigt werden soll

source: remap mirc colors in messages using a hashtable: keys are "fg,bg" as integers between -1 (not specified) and 15, values are WeeChat color names or numbers (format is: "1,-1:color1;2,7:color2"), example: "1,-1:darkgray;1,2:white,blue" to remap black on any bg to "darkgray" and black on blue to "white,blue"; default WeeChat colors for IRC codes: 0:white, 1:black, 2:blue, 3:green, 4:lightred, 5:red, 6:magenta, 7:brown, 8:yellow, 9: lightgreen, 10:cyan, 11:lightcyan, 12:lightblue, 13:lightmagenta, 14:gray, 15:white
de: ersetzt mirc Farben in Nachrichten mittels einer Hashtabelle: Schlüssel sind "fg,bg" als Integerwerte zwischen -1 (nicht angegeben) und 15, als Werte sind die Farbnamen oder Farbnummer von WeeChat möglich (Format ist: "1,-1:Farbe1;2,7:Farbe2"), Beispiel: "1,-1:darkgray;1,2:white,blue" ersetzt Schwarz auf jedem Hintergrund durch "darkgray" und Schwarz auf Blau durch "white,blue"; Stardard-IRC-Farben Tabelle von WeeChat: 0:weiß, 1:schwarz, 2:blau, 3:grün, 4:hellrot, 5:rot, 6:violett, 7:braun, 8:gelb, 9: hellgrün, 10:türkis, 11:helltürkis, 12:hellblau, 13:hellviolett, 14:grau, 15:weiß

source: color for nick prefixes using mode char (o=op, h=halfop, v=voice, ..), format is: "o:color1;h:color2;v:color3" (if a mode is not found, WeeChat will try with next modes received from server ("PREFIX"); a special mode "*" can be used as default color if no mode has been found in list)
de: Farben für Nick Prefix für das Modus-Symbol (o=op, h=halfop, v=voice, ..), Format ist: "o:color1;h:color2;v:color3" (falls ein Modus nicht gefunden wird versucht WeeChat die nächsten Modi die der Server sendet ("PREFIX"); ein spezieller Modus "*" kann als Standardfarbe genutzt werden falls kein Modus in der Liste gefunden wurde)

source: color for nick prefix (prefix is custom string displayed before nick)
de: Farbe für den Nick Präfix (Präfix ist die editierbare Zeichenkette die vor dem Nick steht)

source: color for nick suffix (suffix is custom string displayed after nick)
de: Farbe für den Nick Suffix (Suffix ist die editierbare Zeichenkette die nach dem Nick steht)

source: color for text "Notice" in notices
de: Farbe des "Notice"-Textes in Notizen

source: color for nick in input bar
de: Farbe des eigenen Nicknamens in der Eingabezeile

source: color for away item
de: Farbe des Abwesenheit-Textes in der Eingabezeile

source: color for channel modes, near channel name
de: Farbe der Channel-Modes (neben dem Channelnamen)

source: color for lag indicator, when counting (pong not received from server, lag is increasing)
de: Farbe in der die Anzeige für die Verzögerung (Lag) dargestellt werden soll, sobald auf Antwort gewartet wird ("pong" wurde vom Server nicht empfangen und die Verzögerungszeit wird erhöht)

source: color for lag indicator, when pong has been received from server
de: Farbe in der die Anzeige für die Verzögerung (Lag) dargestellt werden soll, sobald ein "pong" vom Server empfangen wurde

source: color for reason in part/quit messages
de: Textfarbe in der die Begründung einer part/quit Nachricht angezeigt werden soll

source: color for old channel topic (when topic is changed)
de: Farbe in dem das alte Thema des Channels dargestellt werden soll, falls das Thema des Channels geändert wurde

source: color for new channel topic (when topic is changed)
de: Farbe in dem das neue Thema des Channels dargestellt werden soll, falls das Thema des Channels geändert wurde

source: growing factor for autoreconnect delay to server (1 = always same delay, 2 = delay*2 for each retry, ..)
de: Multiplikator für die Verzögerung bei der automatischen Wiederverbindung zum Server (1 = immer die selbe Verzögerung nutzen, 2 = Verzögerung*2 für jeden weiteren Versuch, ..)

source: maximum autoreconnect delay to server (in seconds, 0 = no maximum)
de: maximale Verzögerung bei der automatischen wiederverbindung zum Server (in Sekunden, 0 = keine Begrenzung)

source: when off, colors codes are ignored in incoming messages
de: Falls deaktiviert, werden Farben-Codes von eingehenden Nachrichten ignoriert.

source: allow user to send colors with special codes (ctrl-c + a code and optional color: b=bold, cxx=color, cxx,yy=color+background, u=underline, r=reverse)
de: Erlaube Benutzern, spezielle Codes zu versenden (ctrl-c + Code und optional Farbe: b=fett, cxx=Farbe, cxx,yy=Farbe+Hintergrund, u=unterstrichen, r=invertiert)

source: interval between two checks for lag (in seconds, 0 = never check)
de: Intervall zwischen zwei Überprüfungen auf Verfügbarkeit (Lag) des Servers (in Sekunden, 0 = keine Überprüfung)

source: minimum lag to show (in milliseconds)
de: geringste Verzögerungszeit (Lag) die angezeigt werden soll (in Millisekunden)

source: disconnect after important lag (in minutes, 0 = never disconnect)
de: Maximal Verzögerung (Lag) bis zum Trennen der Verbindung (in Minuten - 0 = niemals trennen)

source: interval between two refreshs of lag item, when lag is increasing (in seconds)
de: Intervall zwischen zwei Aktualisierungen der Verzögerungsanzeige (Lag-Item), wenn die Verzögerungszeit sich erhöht (in Sekunden)

source: send unknown commands to server
de: Sende unbekannte Befehle an den Server

source: interval between two checks for notify with IRC command "ison" (in minutes)
de: Intervall zwischen zwei notify Überprüfungen mit dem IRC Befehl "ison" (in Minuten)

source: interval between two checks for notify with IRC command "whois" (in minutes)
de: Intervall zwischen zwei notify Überprüfungen mit dem IRC Befehl "whois" (in Minuten)

source: %sCTCP requested by %s%s%s: %s%s%s%s%s%s
de: %sCTCP angefordert von %s%s%s: %s%s%s%s%s%s

source: (blocked)
de: (unterdrückt)

source: %sCTCP reply from %s%s%s: %s%s%s %ld.%ld %s
de: %sCTCP Antwort von %s%s%s: %s%s%s %ld.%ld %s

source: %sCTCP reply from %s%s%s: %s%s%s%s%s
de: %sCTCP Antwort von %s%s%s: %s%s%s%s%s

source: %sCTCP reply to %s%s%s: %s%s%s%s%s
de: %sCTCP Antwort an %s%s%s: %s%s%s%s%s

source: %s%s: not enough memory for "%s" command
de: %s%s: Nicht genug Speicher für den Befehl "%s"

source: %s%s: cannot parse "%s" command
de: %s%s: Kann den Befehl "%s" nicht parsen

source: %s%s: unknown DCC CHAT type received from %s%s%s: "%s"
de: %s%s: Unbekannter DCC CHAT-Typ empfangen von %s%s%s: "%s"

source: %sUnknown CTCP requested by %s%s%s: %s%s%s%s%s
de: %sUnbekannte CTCP Anfrage von %s%s%s: %s%s%s%s%s

source: connected
de: verbunden

source: not connected
de: nicht verbunden

source: (temporary)
de: (temporär)

source: on
de: an

source: off
de: aus

source: 1 if string is a valid IRC channel name
de: 1, falls die Zeichenkette ein gültiger IRC-Channel ist

source: 1 if string is a valid IRC nick name
de: 1, falls die Zeichenkette ein gültiger IRC Nickname ist

source: get current nick on a server
de: Aktuellen Nicknamen für den Server erhalten

source: get nick from IRC host
de: Nicknamen des IRC-Hosts erhalten

source: IRC host (like `:nick!name@server.com`)
de: IRC host (in der Form `:nick!name@server.com`)

source: get nick color code
de: Hole Farbe-Code des Nick

source: get nick color name
de: Hole Namen der Farbe des Nick

source: get buffer pointer for an IRC server/channel/nick
de: hole Buffer Pointer für einen IRC Server/Channel/Nick

source: server,channel,nick (channel and nicks are optional)
de: server,channel,nick (Channel und Nicks sind optional)

source: 1 if server supports this feature (from IRC message 005)
de: 1 falls der Server die Funktion unterstützen sollte (durch IRC Message 005)

source: server,feature
de: Server,Funktion

source: value of feature, if supported by server (from IRC message 005)
de: Wert der Funktion, sofern es vom Server unterstützt wird (durch IRC Message 005)

source: parse an IRC message
de: Parse eine IRC Nachricht

source: "message": IRC message
de: "message": IRC Nachricht

source: "nick": nick, "host": host, "command": command, "channel": channel, "arguments": arguments (includes channel)
de: "nick": nick, "host": host, "command": command, "channel": channel, "arguments": arguments (beinhaltet Channel)

source: split an IRC message (to fit in 512 bytes)
de: dient zum Aufteilen einer überlangen IRC Nachricht (in maximal 512 Bytes große Nachrichten)

source: "message": IRC message, "server": server name (optional)
de: "message": IRC Nachricht, "server": Servername (optional)

source: "msg1" ... "msgN": messages to send (without final "\r\n"), "args1" ... "argsN": arguments of messages, "count": number of messages
de: "msg1" ... "msgN": Nachrichten die versendet werden sollen (ohne abschließendes "\r\n"), "args1" ... "argsN": Argumente für Nachrichten, "count": Anzahl der Nachrichten

source: list of IRC servers
de: Liste der IRC-Server
