Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: %s%s: error creating completion for alias "%s": alias not found
de: %s%s: Fehler bei der Erstellung der Vervollständigung für den Alias-Befehl "%s": Alias wurde nicht gefunden

source: alias name (can start or end with "*" as wildcard) (optional)
de: Alias Name (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: %s: "%s" removed
de: %s: "%s" entfernt

source: %s dictionaries list:
de: %s Wörterbücher:

source: %s: error: dictionary "%s" is not available on your system
de: %s: Fehler: das Wörterbuch "%s" ist auf diesem Rechner nicht verfügbar.

source: %s: word "%s" added to personal dictionary
de: %s: Das Wort "%s" wurde dem persönlichen Wörterbuch hinzugefügt.

source: %s%s: failed to add word to personal dictionary
de: %s%s: Es kann kein Wort zum persönlichen Wörterbuch hinzugefügt werden

source: %s%s: no dictionary on this buffer for adding word
de: %s%s: Es ist kein Wörterbuch für diesen Buffer aktiviert, deshalb kann das Wort nicht hinzugefügt werden.

source: %s%s: many dictionaries are defined for this buffer, please specify dictionary
de: %s%s: mehrere Wörterbücher sind für diesen Buffer definiert. Bitte definieren Sie ein Wörterbuch

source: aspell plugin configuration
de: Konfiguration für Aspell-Erweiterung

source: dictlist: show installed dictionaries enable: enable aspell on current buffer disable: disable aspell on current buffer addword: add a word in your personal aspell dictionary Input line beginning with a '/' is not checked, except for some commands (see /set aspell.check.commands). To enable aspell on all buffers, use option "default_dict", for example: /set aspell.check.default_dict "en"
de: dictlist: listet installierte Wörterbücher auf enable: aktiviert Aspell in aktuellem Buffer [lang = Wörterbuch) disable: deaktiviert Aspell in aktuellem Buffer addword: fügt ein Wort in das persönliche Wörterbuch von Aspell hinzu Eingaben die mit '/' beginnen werden nicht überprüft, davon ausgenommen sind einige Befehle (siehe /set aspell.check.commands). Um in allen Buffern Aspell anzuwenden sollte man die Option "default_dict" nutzen , als Beispiel: /set aspell.check.default_dict "de_DE-neu"

source: list of supported langs for aspell
de: Liste der Unterstützten Übersetzungen (lang) für Aspell

source: comma separated list of dictionaries to use on this buffer
de: Durch Kommata getrennte Liste der Wörterbücher, die in diesem Buffer genutzt werden

source: %s%s: error creating aspell dictionary "%s" => "%s"
de: %s%s: Fehler beim Erstellen des Aspell-Wörterbuches "%s" => "%s"

source: option for aspell (for list of available options and format, run command "aspell config" in a shell)
de: Option für Aspell (um eine detaillierte Liste aller verfügbaren Optionen und Formate zu erhalten, muss der Befehl "aspell config" in einer Shell ausgeführt werden)

source: %s%s: error creating aspell option "%s" => "%s"
de: %s%s: Fehler beim Erstellen der Aspell-Option "%s" => "%s"

source: color used for misspelled words
de: In dieser Farbe wird ein Wort mit einem Rechtschreibfehler hervorgehoben

source: comma separated list of commands for which spell checking is enabled (spell checking is disabled for all other commands)
de: Durch Kommata getrennte Liste der Befehle, für die eine Rechtschreibprüfung gelten soll (Rechtschreibprüfung ist für andere Befehle deaktiviert)

source: default dictionary (or comma separated list of dictionaries) to use when buffer has no dictionary defined (leave blank to disable aspell on buffers for which you didn't explicitly enabled it)
de: Voreingestelltes Wörterbuch (oder durch Kommata getrennte Liste der Wörterbücher) welche(s) genutzt werden soll, sofern kein Wörterbuch für einen Buffer definiert wurde. Wird kein Wörterbuch angegeben dann ist Aspell in allen Buffer deaktiviert, für die nicht explizit ein Wörterbuch angegeben wurde.

source: check words during text search in buffer
de: Überprüfe Wörter während im Buffer nach einem Text gesucht wird

source: real-time spell checking of words (slower, disabled by default: words are checked only if there's delimiter after)
de: Echtzeit Korrektur während der Texteingabe (da dies langsamer ist, ist diese Funktion standardmäßig deaktiviert. Wörter werden erst überprüft wenn ein Leerzeichen dem Wort folgt)

source: minimum length for a word to be spell checked (use 0 to check all words)
de: Minimallänge für ein Wort welches auf Rechtschreibung überprüft werden soll (bei 0 werden alle Wörter überprüft)

source: %s: warning: dictionary "%s" is not available on your system
de: %s: Hinweis: das Wörterbuch "%s" ist auf dem Rechner nicht verfügbar

source: %s%s: not enough memory to create new speller
de: %s%s: Nicht genug Speicher um neue Rechtschreibung zu erstellen

source: %s%s: error creating charset "%s" => "%s"
de: %s%s: Fehler bei Zeichensatz Erstellung "%s" => "%s"

source: global decoding charset
de: globaler Zeichensatz zum dekodieren

source: global encoding charset
de: globaler Zeichensatz zum kodieren

source: %s: %s, "%s": removed
de: %s: %s, "%s": entfernt

source: %s: terminal: %s, internal: %s
de: %s: Terminal: %s, Intern: %s

source: %s%s: wrong charset type (decode or encode expected)
de: %s%s: Falscher Zeichensatz (De-/Kodieren erwartet)

source: %s%s: invalid charset: "%s"
de: %s%s: Ungültiger Zeichensatz: "%s"

source: change charset for current buffer
de: ändere Zeichensatz für aktuellen Buffer

source: decode: change decoding charset encode: change encoding charset charset: new charset for current buffer reset: reset charsets for current buffer
de: decode: ändere Zeichensatz zum dekodieren encode: ändere Zeichensatz zum kodieren charset: wähle neuen Zeichensatz für aktuellen Buffer reset: setze im aktuellen Buffer den Zeichensatz zurück

source: demo message without prefix
de: Demo-Nachricht, ohne Präfix

source: %sdemo message with error prefix
de: %sDemo-Nachricht mit fehlerhaftem Präfix

source: colors
de: Farben

source: Available infos:
de: verfügbare Informationen:

source: Available infolists:
de: verfügbare Infolisten:

source: demo_signal: signal: %s, type_data: %s, signal_data: "%s"
de: Demo_Signal: Signal: %s, Datentyp: %s, Datensignal: "%s"

source: demo_signal: signal: %s, type_data: %s, signal_data: %d
de: Demo_Signal: Signal: %s, Datentyp: %s, Datensignal: %d

source: demo_signal: signal: %s, type_data: %s, signal_data: 0x%lx
de: Demo_Signal: Signal: %s, Datentyp: %s, Datensignal: 0x%lx

source: demo_signal: signal: %s, type_data: %s, signal_data: 0x%lx (unknown type)
de: Demo_Signal: Signal: %s, Datentyp: %s, Datensignal: 0x%lx (unbekannter Typ)

source: print some messages on current buffer
de: Gibt ein paar Nachrichten im aktuellen Buffer aus

source: text: write this text
de: Text: schreibe diesen Text

source: open a new buffer
de: Öffne einen neuen Buffer

source: get and display an info
de: Hole eine Info und zeige sie an

source: info: info to display arguments: optional arguments for info Without argument, this command displays list of available infos
de: Info: Information die dargestellt werden soll Argumente: optionale Argumente für Info Wird der Befehl ohne Argumente aufgerufen werden alle verfügbaren Informationen angezeigt

source: get and display an infolist
de: Hole eine Infolist und zeige sie an

source: infolist: infolist to display arguments: optional arguments for infolist Without argument, this command displays list of available infolists
de: Infolist: Infoliste die dargestellt werden soll Argumente: optionale Argumente für Infoliste Wird der Befehl ohne Argumente aufgerufen werden alle verfügbaren Informationen der Infoliste angezeigt

source: %s: removing old fifo pipe "%s"
de: %s: Entferne alte FIFO Pipe "%s"

source: %s: pipe opened
de: %s: Pipe ist geöffnet

source: %s%s: unable to open pipe (%s) for reading
de: %s%s: Kann Pipe (%s) nicht zum Lesen öffnen

source: %s%s: unable to create pipe for remote control (%s)
de: %s%s: Kann die Pipe, zur Fernsteuerung, nicht anlegen (%s)

source: %s: pipe closed
de: %s: Pipe geschlossen

source: %s%s: error, invalid text received on pipe
de: %s%s: Fehler: Ungültiger Text von Pipe empfangen

source: %s%s: error, buffer not found for pipe data
de: %s%s: Fehler: Buffer für PIPE-Daten nicht gefunden

source: %s%s: error reading pipe, closing it
de: %s%s: Fehler beim Lesen der Pipe. Pipe wird aufgrund dessen geschlossen

source: %s%s: error opening file, closing it
de: %s%s: Fehler beim öffnen der Datei, schließe Datei wieder

source: name of FIFO pipe
de: Name der FIFO-Pipe

source: away
de: abwesend

source: %s%s: disconnecting from server because upgrade can't work for servers connected via SSL
de: %s%s: Verbindung zum Server wird getrennt. Ein Upgrade ist über eine SSL-Verbindung nicht möglich

source: %s%s: disconnected from %d %s (SSL connection not supported with upgrade)
de: %s%s: Verbindung mit %d %s getrennt. (Upgrade über eine SSL Verbindung nicht möglich)

source: %s%s: error with server from URL ("%s"), ignored
de: %s%s: Fehler mit Server von URL ('%s') aufgetreten. Wird deshalb ignoriert

source: %s%s: WARNING: some network connections may still be opened and not visible, you should restart WeeChat now (with /quit).
de: %s%s: WARNUNG: Es scheinen noch Netzwerkverbindungen zu bestehen, die nicht angezeigt werden können. Deshalb sollte WeeChat neu gestartet werden (nutze /quit).

source: %s%s: cannot allocate new channel
de: %s%s: Neuer Channel konnte nicht alloziert werden

source: %s%s%s %s(%s%s%s)%s is back on server
de: %s%s%s %s(%s%s%s)%s hat sich wieder am Server angemeldet

source: %s: future away: %s
de: %s: Künftige Abwesenheit: %s

source: %s: future away removed
de: %s: Künftige Abwesenheit zurückziehen

source: %s%s: "%s" command can only be executed in a channel buffer
de: %s%s: Der Befehl "%s" kann nur im Channel-Buffer ausgeführt werden

source: %s%s: already connected to server "%s"!
de: %s%s: Zum Server "%s" besteht bereits eine Verbindung!

source: %s%s: currently connecting to server "%s"!
de: %s%s: Verbindungsaufbau zum Server "%s" läuft bereits!

source: %s: server %s%s%s created (temporary server, NOT SAVED!)
de: %s: Server %s%s%s angelegt (Vorübergehender Server, NICHT GESICHERT!)

source: %s%s: unable to create server "%s"
de: %s%s: Der Server "%s" kann nicht anlegt werden

source: %sCTCP query to %s%s%s: %s%s%s%s%s
de: %sCTCP Abfrage an %s%s%s: %s%s%s%s%s

source: %s%s: "%s" command can not be executed on a server buffer
de: %s%s: Der Befehl "%s" kann nicht in einem Server-Buffer ausgeführt werden

source: %s%s: wrong arguments for "%s" command
de: %s%s: Fehlerhaftes Argument für den Befehl "%s"

source: %s%s: not connected to server "%s"!
de: %s%s: Keine Verbindung zum Server "%s"!

source: %s: auto-reconnection is cancelled
de: %s: automatische Wiederverbindung abgebrochen

source: %s%s: server "%s" not found
de: %s%s: Server "%s" nicht gefunden

source: %s[%s%d%s]%s mask: %s / server: %s / channel: %s
de: %s[%s%d%s]%s Maske: %s / Server: %s / Channel: %s

source: %s: ignore list:
de: %s: Liste der Ignorierten:

source: %s: no ignore in list
de: %s Keine /ignore-Regel gefunden

source: %s%s: missing arguments for "%s" command
de: %s%s: Fehlende Argumente für den Befehl "%s"

source: %s%s: ignore already exists
de: %s%s: Diese /ignore-Regel existiert bereits

source: %s: ignore added:
de: %s: /ignore-Befehl hinzugefügt:

source: %s%s: error adding ignore
de: %s%s: Fehler beim hinzufügen mittels /ignore-Befehl

source: %s: all ignores deleted
de: %s: Alle /ignore-Regeln gelöscht

source: %s: ignore deleted
de: %s: /ignore-Regel gelöscht

source: %s%s: ignore not found
de: %s%s: /ignore-Regel nicht gefunden

source: %s%s: wrong ignore number
de: %s%s: Falsche Nummer für /ignore-Regel

source: %s%s: unknown option for "%s" command
de: %s%s: Unbekannte Option für den Befehl "%s"

source: %s%s: command "%s" must be executed on connected irc server
de: %s%s: Der Befehl "%s" kann nur bei einem verbundenen IRC-Server ausgeführt werden

source: %s%s: mask must begin with nick
de: %s%s: Die Maske muss mit einem Nick beginnen

source: %s%s: "%s" is not a valid regular expression (%s)
de: %s%s: "%s" ist kein korrekter regulärer Ausdruck (%s)

source: %s%s: not enough memory for regular expression
de: %s%s: Nicht genügend Speicher für regulären Ausdruck vorhanden

source: %s%s: you must specify channel for "%s" command if you're not in a channel
de: %s%s: Für den Befehl, "%s", muss ein Channel angegeben werden, falls man sich nicht in einem Channel befindet

source: %s%s: "%s" command can only be executed in a channel or private buffer
de: %s%s: Der Befehl "%s" kann nur in einem Channel- oder privaten Buffer ausgeführt werden

source: Notice
de: Hinweis

source: %s%s: server must be specified because you are not on an irc server or channel
de: %s%s: Ein Server muss angegeben werden da der Befehl weder in einem Server- noch in einem Channel-Buffer ausgeführt wurde

source: %s%s: notify already exists
de: %s%s: Benachrichtigung existiert schon

source: %s: notification added for %s%s
de: %s: Benachrichtigung für %s%s hinzugefügt

source: %s%s: error adding notification
de: %s%s: Fehler beim Erstellen der Benachrichtigung

source: %s: all notifications deleted
de: %s: alle Benachrichtigungen wurden gelöscht

source: %s: no notification in list
de: %s keine Benachrichtigung in Liste vorhanden

source: %s: notification deleted
de: %s: Benachrichtigung gelöscht

source: %s%s: notification not found
de: %s%s: Benachrichtigung nicht gefunden

source: %s%s: cannot create new private buffer "%s"
de: %s%s: Kann keinen neuen privaten Buffer "%s" erzeugen

source: All servers:
de: Alle Server:

source: No server
de: Kein Server

source: Servers with "%s":
de: Server mit "%s":

source: No server found with "%s"
de: Keinen Server mit "%s" gefunden

source: %s%s: server "%s" already exists, can't create it!
de: %s%s: Der Server "%s" existiert bereits und kann daher nicht angelegt werden!

source: %s%s: name can not start with "#"
de: %s%s: Name darf nicht mit "#" beginnen

source: %s%s: unable to create server
de: %s%s: Kann den Server nicht anlegen

source: %s: server %s%s%s created
de: %s: Server %s%s%s angelegt

source: %s%s: server "%s" not found for "%s" command
de: %s%s: Server "%s" nicht gefunden für den Befehl "%s"

source: %s%s: server "%s" already exists for "%s" command
de: %s%s: Server "%s" für den Befehl "%s" existiert bereits

source: %s: server %s%s%s has been copied to %s%s%s
de: %s: Server %s%s%s wurde nach %s%s%s kopiert

source: %s: server %s%s%s has been renamed to %s%s%s
de: %s: Server %s%s%s wurde in %s%s%s umbenannt

source: %s%s: server "%s" is not a temporary server
de: %s%s: Server "%s" ist kein temporärer Server

source: %s: server %s%s%s is not temporary any more
de: %s: Server %s%s%s ist nicht mehr temporär

source: %s%s: you can not delete server "%s" because you are connected to. Try "/disconnect %s" before.
de: %s%s: Sie können den Server "%s" nicht austragen, weil Sie noch verbunden sind. Probieren Sie dazu vorher /disconnect %s

source: %s: Server %s%s%s has been deleted
de: %s: Server %s%s%s wurde gelöscht

source: %s: messages outqueue DELETED for all servers. Some messages from you or WeeChat may have been lost!
de: %s: Alle ausgehenden Nachrichten, die in der Warteschlange standen, sind GELÖSCHT worden. Einige Nachrichten, von Ihnen oder WeeChat, sind dadurch vermutlich verloren gegangen!

source: %s%s: wrong argument count for "%s" command
de: %s%s: Fehlerhafte Anzahl von Argumenten für den Befehl "%s"

source: %s%s: you are not on channel "%s"
de: %s%s: Du befindest dich nicht in einem Channel "%s"

source: find information about the administrator of the server
de: Information über den Server-Administrator abfragen

source: target: server
de: Ziel: Server

source: execute a command on all channels of all connected servers
de: Führt einen Befehl aus der an alle Channels gesendet wird, die mit einem Server verbunden sind

source: -current: execute command for channels of current server only -exclude: exclude some channels ('*' is allowed at beginning or end of channel name, to exclude many channels) command: command to execute arguments: arguments for command Examples: execute '/me is testing' on all channels: /allchan me is testing say 'hello' everywhere but not on #weechat: /allchan -exclude=#weechat msg * hello say 'hello' everywhere but not on #weechat and channels beginning with #linux: /allchan -exclude=#weechat,#linux* msg * hello
de: -current: führt einen Befehl aus der an alle Channels des aktuellen Servers gesendet wird -exclude: dient zum Ausschluss ausgewählter Channels ('*' wird zu Beginn oder am Ende des Channel-Namens akzeptiert, um mehrere Channels auszuschließen) command: Befehl der ausgeführt werden soll arguments: Argumente des Befehls Beispiele: Führe den Befehl '/me Ich teste gerade etwas...' für alle Channels aus: /allchan me Ich teste gerade etwas... Schicke 'Hallo Welt' an jeden Channel, ausgenommen an den #weechat Channel: /allchan -exclude=#weechat msg * Hallo Welt Schicke 'Hallo Welt' an jeden Channel, ausgenommen an den #weechat Channel und Channels die mit #linux beginnen: /allchan -exclude=#weechat,#linux* msg * Hallo Welt

source: execute a command on all connected servers
de: Führt einen Befehl aus, der zu allen verbundenen Server gesendet wird

source: -exclude: exclude some servers ('*' is allowed at beginning or end of server name, to exclude many servers) command: command to execute arguments: arguments for command Examples: change nick on all servers: /allserv nick newnick set away on all servers: /allserv away I'm away
de: -exclude: dient zum Ausschluss ausgewählter Server ('*' wird zu Beginn oder am Ende des Server-Namens akzeptiert, um mehrere Server auszuschließen) command: Befehl der ausgeführt werden soll arguments: Argumente des Befehls Beispiele: Ändere den Nick auf allen Servern: /allserv nick newnick Setzt den Status, auf allen Servern,auf abwesend: /allserv away I'm away

source: ban nicks or hosts
de: Nicknamen oder Hosts sperren/verbannen

source: channel: channel for ban nick: user or host to ban Without argument, this command display ban list for current channel.
de: channel: Channel in dem der Bann ausgeführt werden soll nick: User oder Host für den der Bann gelten soll Ohne Angabe von Argumenten wird die Ban-Liste für den aktuellen Channel angezeigt.

source: connect to IRC server(s)
de: Mit IRC-Server(n) verbinden

source: server: server name, which can be: - internal server name (created by /server add, recommended usage) - hostname/port or IP/port (this will create a TEMPORARY server), port is 6667 by default - URL with format: irc[6][s]://[nickname[:password]@]irc.example.org[:port][/#channel1][,#channel2[...]] option: set option for server (for boolean option, value can be omitted) nooption: set boolean option to 'off' (for example: -nossl) -all: connect to all servers defined in configuration -open: connect to all opened servers that are not currently connected -nojoin: do not join any channel (even if autojoin is enabled on server) -switch: switch to next server address Examples: /connect freenode /connect irc.oftc.net/6667 /connect irc6.oftc.net/6667 -ipv6 /connect irc6.oftc.net/6697 -ipv6 -ssl /connect my.server.org/6697 -ssl -password=test /connect irc://nick@irc.oftc.net/#channel /connect -switch
de: server: Name des Servers (folgende Möglichkeiten bestehen): - intern genutzter Servername mit dem verbunden werden soll (Der Server sollte zuerst mittels "/server add" angelegt werden) - Hostname/Port oder IP/Port (damit wird lediglich ein TEMPORÄRER Server erstellt), Port 6667 wird standardmäßig verwendet - URL mit folgendem Format: irc[6][s]://[nickname[:password]@]irc.example.org[:port][/#channel1][,#channel2[...]] option: legt die Optionen für den Server fest (die Boolean-Optionen können weggelassen werden) nooption: stellt die Boolean Option auf "off" (Beispiel: -nossl) -all: Verbindung wird mit allen Servern hergestellt -open: stellt eine Verbindung zu allen geöffneten Servern her, zu denen aktuell keine Verbindung besteht -nojoin: Channel(s) werden nicht betreten (auch falls die Funktion "autojoin" aktiviert sein sollte) -switch: wechselt zur nächsten Server-Adresse Beispiele: /connect freenode /connect irc.oftc.net/6667 /connect irc6.oftc.net/6667 -ipv6 /connect irc6.oftc.net/6697 -ipv6 -ssl /connect my.server.org/6697 -ssl -password=test /connect irc://nick@irc.oftc.net/#channel /connect -switch

source: send a CTCP message (Client-To-Client Protocol)
de: CTCP-Nachricht verschicken

source: target: nick or channel to send CTCP to type: CTCP type (examples: "version", "ping", ..) arguments: arguments for CTCP
de: target: User oder Channel an welchen eine CTCP-Nachricht geschickt werden soll type: CTCP-Nachricht (z.B. "version", "ping", ..) arguments: Argumente für CTCP

source: leave and rejoin a channel
de: Einen Channel verlassen und wieder betreten

source: channel: channel name for cycle message: part message (displayed to other users)
de: channel: Name des Channels message: Nachricht beim Verlassen des Channels (die den anderen Usern angezeigt wird)

source: start a DCC (file transfer or direct chat)
de: Startet DCC (Datentransfer oder einen Direktchat)

source: nick: nick for chat or file file: filename (on local host) Examples: chat with nick "toto": /dcc chat toto send file "/home/foo/bar.txt" to nick "toto": /dcc send toto /home/foo/bar.txt
de: nick: Empfänger einer Datei bzw. eines Chats file: zu versendende (lokal vorliegende) Datei Beispiel: Sendet eine Chat-Anfrage an den User "toto" /dcc chat toto Sendet die Datei "/home/foo/bar.txt" an den User "toto" /dcc send toto /home/foo/bar.txt

source: remove channel half-operator status from nick(s)
de: halb-Operator-Privilegien einem oder mehreren Nick(s) entziehen

source: remove channel operator status from nick(s)
de: Operator-Privilegien einem oder mehreren Nicknamen entziehen

source: remove voice from nick(s)
de: Voice-Privilegien einem oder mehreren Nicknamen entziehen

source: shutdown the server
de: Server herunterfahren

source: target: server name
de: Ziel: Servername

source: disconnect from one or all IRC servers
de: Verbindung zu einem oder mehreren IRC-Server(n) trennen

source: server: server name to disconnect -all: disconnect from all servers reason: reason for quit
de: server: Name des Servers zu dem die Verbindung getrennt werden soll -all: Verbindung zu allen Servern trennen reason: Begründung der Trennung

source: give channel half-operator status to nick(s)
de: halb-Operator Status an Nick(s) vergeben

source: ignore nicks/hosts from servers or channels
de: Ignoriert Nicks/Hosts von Channels oder Servern
