Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: bar item name (can start or end with "*" as wildcard) (optional)
de: Bar-Item Name (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: list of bar windows
de: Liste der Bar-Fenster

source: bar window pointer (optional)
de: Bar-Fenster Pointer (optional)

source: list of buffers
de: Liste der Buffer

source: buffer name (can start or end with "*" as wildcard) (optional)
de: Name des Buffers (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: lines of a buffer
de: Zeilen des Buffers

source: list of filters
de: Liste der Filter

source: filter name (can start or end with "*" as wildcard) (optional)
de: Name des Filters (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: history of commands
de: Verlaufspeicher der Befehle

source: buffer pointer (if not set, return global history) (optional)
de: Buffer Pointer (falls nicht gesetzt, wird der globale Verlauf zurückgegeben) (optional)

source: list of hooks
de: Auflistung der Hooks

source: type,arguments (type is command/timer/.., arguments to get only some hooks (can start or end with "*" as wildcard), both are optional)
de: type,arguments (type ist ein command/timer/.., arguments dient dazu nur einige hooks abzufragen (darf mit einem "*" als Platzhalter beginnen oder enden), beide Optionen sind optional)

source: list of buffers in hotlist
de: Liste der Buffer in Hotlist

source: list of key bindings
de: Auflistung der Tastenzuweisungen

source: context ("default", "search", "cursor" or "mouse") (optional)
de: Kontext ("default", "search", "cursor" oder "mouse") (optional)

source: nicks in nicklist for a buffer
de: Nicks in Nickliste für einen Buffer

source: nick_xxx or group_xxx to get only nick/group xxx (optional)
de: nick_xxx oder group_xxx um nur den Nick/Group xxx abzufragen (optional)

source: list of options
de: Liste der Optionen

source: option name (can start or end with "*" as wildcard) (optional)
de: Name einer Option (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: list of plugins
de: Auflistung der Erweiterungen

source: plugin pointer (optional)
de: Pointer der Erweiterung (optional)

source: plugin name (can start or end with "*" as wildcard) (optional)
de: Name einer Erweiterung (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: list of windows
de: Auflistung der Windows

source: window pointer (optional)
de: Fenster Pointer (optional)

source: "current" for current window or a window number (optional)
de: "current" für aktuelles Fenster oder die Nummer eines Fensters (optional)

source: bar window
de: Bar-Fenster

source: structure with completion
de: Struktur mit Vervollständigung

source: structure with partial completion
de: Struktur mit teilweise Vervollständigung

source: config file
de: Konfigurationsdatei

source: config section
de: Konfigurationssektion

source: config option
de: Konfigurationsoptionen

source: history of commands in buffer
de: Verlaufspeicher von Befehlen in einem Buffer

source: structure with undo for input line
de: Struktur der Rücknahmen für die Befehlszeile

source: a key (keyboard shortcut)
de: Tastenbelegung (Tastaturkurzbefehl)

source: structure with lines
de: Struktur mit Zeilen

source: structure with one line
de: Struktur mit einer Zeile

source: structure with one line data
de: Struktur mit einzeiligen Daten

source: group in nicklist
de: Gruppen in Nickliste

source: nick in nicklist
de: Nick in Nickliste

source: plugin
de: Erweiterung

source: window
de: Fenster

source: scroll info in window
de: Scroll-Info in Fenstern

source: tree of windows
de: Baumstruktur der Fenster

source: %sError: unable to load plugin "%s": %s
de: %sFehler: Kann Erweiterung "%s" nicht installieren: %s

source: %sIf you're trying to load a script and not a C plugin, try command to load scripts (/perl, /python, ...)
de: %sFalls ein Skript installiert werden soll und keine C-Erweiterung dann muss der Befehl zum Installieren von Skripten genutzt werden (/perl, /python, ...)

source: %sError: symbol "%s" not found in plugin "%s", failed to load
de: %sFehler: Symbol "%s" in Erweiterung "%s" nicht gefunden, Installation fehlgeschlagen

source: %sIf plugin "%s" is old/obsolete, you can delete this file.
de: %sFalls die Erweiterung "%s" alt oder obsolet ist sollte diese gelöscht werden.

source: %sError: API mismatch for plugin "%s" (current API: "%s", plugin API: "%s"), failed to load
de: %sFehler: API Inkompatibilität mit Erweiterung "%s" (genutzte API: "%s", neue API: "%s"), Installation fehlgeschlagen

source: %sError: unable to load plugin "%s": a plugin with same name already exists
de: %sFehler: Kann Erweiterung "%s" nicht laden: eine gleichnamige Erweiterung existiert bereits

source: %sError: function "%s" not found in plugin "%s", failed to load
de: %sFehler: Funktion "%s" nicht in Erweiterung "%s" gefunden. Installation fehlgeschlagen

source: %sError: unable to initialize plugin "%s"
de: %sFehler: Erweiterung "%s" kann nicht initialisiert werden

source: %sError: unable to load plugin "%s" (not enough memory)
de: %sFehler: Erweiterung "%s" kann nicht installiert werden (Speichermangel)

source: Plugin "%s" loaded
de: Erweiterung "%s" wurde installiert

source: Plugin "%s" unloaded
de: Erweiterung "%s" wurde deinstalliert

source: %sError: plugin "%s" not found
de: %sFehler: Die Erweiterung "%s" wurde nicht gefunden

source: Plugins unloaded
de: Erweiterungen wurden deinstalliert

source: description of plugin option
de: Beschreibung der Erweiterungsoption

source: Actions (letter+enter):
de: Aktion (Zeichen+Enter):

source: [D] Disconnect
de: [D] Verbindung trennen

source: [R] Remove
de: [R] Entfernen

source: [P] Purge finished
de: [P] Säubern beenden

source: [Q] Close this buffer
de: [Q] Schließe diesen Buffer

source: %s%s[%s%s%s%s] %s (started on: %s%s%s%s)
de: %s%s[%s%s%s%s] %s (gestartet am:: %s%s%s%s)

source: ended on:
de: geendet am:

source: %s%-26s id: %d, protocol: %s, received: %s, sent: %s
de: %s%-26s Id: %d, Protokoll: %s, empfangen: %s, gesendet: %s

source: List of clients for relay
de: Liste der Relay-Clients:

source: connecting
de: verbinden

source: waiting auth
de: Warte auf Authentifizierung

source: auth failed
de: Authentifizierung fehlgeschlagen

source: disconnected
de: unterbrochen

source: %s: new client from %s%s%s on port %d (id: %d, relaying: %s.%s)
de: %s: Neuer Client von %s%s%s an Port %d (Id: %d, Relaying: %s.%s)

source: %s%s: not enough memory for new client
de: %s%s: Nicht genug Speicher für neuen Client

source: %s%s: authentication failed with client %s%s%s (%s.%s)
de: %s%s: Authentifizierung mit Client %s%s%s (%s.%s) fehlgeschlagen

source: %s: disconnected from client %s%s%s (%s.%s)
de: %s: Trennung vom Client %s%s%s (%s.%s)

source: %s%s: not enough memory for parsing message
de: %s%s: Nicht genug Speicher vorhanden um Nachricht zu parsen

source: %s%s: error sending data to client: %s
de: %s%s: Fehler beim Senden von Daten an den Client: %s

source: %s%s: error sending data to client %s
de: %s%s: Fehler beim Senden von Daten an den Client %s

source: Clients for relay:
de: Clients für Relay:

source: id: %d, %s%s%s (%s%s%s), started on: %s, last activity: %s, bytes: %lu recv, %lu sent
de: Id: %d, %s%s%s (%s%s%s), gestartet am: %s, letzte Aktivität: %s, Bytes: %lu empfangen, %lu gesendet

source: id: %d, %s%s%s, started on: %s
de: Id: %d, %s%s%s, gestartet am: %s

source: No client for relay
de: Keinen Client für Relay

source: Listening on ports:
de: Lausche an Ports:

source: port %s%d%s, relay: %s%s.%s%s, started on: %s
de: Port %s%d%s, Relay: %s%s.%s%s, gestartet am: %s

source: No server for relay
de: Keinen Server für Relay

source: %s: relay "%s" (port %s) added
de: %s: Relay "%s" (Port %s) hinzugefügt

source: %s: relay "%s" (port %d) removed
de: %s: Relay "%s" (Port %d) entfernt

source: %s%s: relay "%s" not found
de: %s%s: Relay "%s" nicht gefunden

source: relay control
de: Relay-Kontrolle

source: list: list relay clients (only active relays) listfull: list relay clients (verbose, all relays) listrelay: list relays (name and port) add: add relay for a protocol + name del: remove relay for a protocol + name protocol.name: protocol and name to relay currently, only protocol "irc" is supported for example: irc.freenode port: port used for relay raw: open buffer with raw Relay data Without argument, this command opens buffer with list of relay clients. Example: irc proxy, for server "freenode": /relay add irc.freenode 8000
de: list: Auflistung der Relay-Clients (nur aktive Relays) listfull: detaillierte Auflistung der Relay-Clients (alle Relays) listrelay: Auflistung der Relays (Name und Port) add: füge ein Relay, für ein Protokoll + Name, hinzu del: entferne Relay für ein Protokoll + Name protocol.name: Protokoll und Name des Relays zur Zeit wird ausschließlich das "irc" Protokoll unterstützt Beispiel: irc.freenode port: Port den der Relay nutzen soll raw: öffnet Buffer mit RAW-Relay Daten Ohne Angabe von Argumenten werden alle Relay-Clients in einem neuen Buffer dargestellt. Beispiel: IRC Proxy für Server "freenode": /relay add irc.freenode 8000

source: all possible protocol.name for relay plugin
de: Alle möglichen Protokoll.Namen der Relay-Erweiterung

source: protocol.name of current relays for relay plugin
de: Protokoll.Name des aktuellen Relays von der Relay-Erweiterung

source: first free port for relay plugin
de: Erster freier Port für Relay-Erweiterung

source: %s%s: error: port "%d" is already used
de: %s%s: Fehler: Der Port "%d" ist schon im Gebrauch

source: %s%s: error: unknown protocol "%s"
de: %s%s: Unbekanntes Protokoll "%s"

source: %s%s: error: relay for "%s" already exists
de: %s%s: Fehler: Relay für "%s" existiert bereits

source: auto open relay buffer when a new client is connecting
de: Öffnet automatisch einen Relay-Buffer, falls eine Verbindung zu einem neuen Client hergestellt wird

source: text color
de: Textfarbe

source: background color
de: Hintergrundfarbe

source: text color of selected client line
de: Textfarbe für selektierten Client-Linie

source: text color for "connecting" status
de: Textfarbe für Status: "verbinde"

source: text color for "waiting authentication" status
de: Textfarbe für Status: "warte auf Authentifizierung"

source: text color for "connected" status
de: Textfarbe für Status: "Verbindung hergestellt"

source: text color for "authentication failed" status
de: Textfarbe für Status: "Authentifizierung gescheitert"

source: text color for "disconnected" status
de: Textfarbe für Status: "Verbindung getrennt"

source: address for bind (if empty, connection is possible on all interfaces, use "127.0.0.1" to allow connections from local machine only)
de: Adresse für Bind (falls nicht gesetzt ist eine Verbindung zu allen Interfaces möglich. Wird die Adresse "127.0.0.1" genutzt kann nur eine Verbindung mit dem lokalen Rechner hergestellt werden)

source: maximum number of clients connecting to a port
de: Maximale Anzahl an Clients die mit einem Port verbunden sein dürfen

source: password required by clients to access this relay (empty value means no password required)
de: Passwort wird von Clients benötigt um Zugriff auf dieses Relay zu erhalten (kein Eintrag bedeutet dass kein Passwort benötigt wird)

source: list of relay clients
de: Liste der Relay-Clients

source: Relay raw messages
de: Relay RAW Nachrichten

source: %s: socket closed for %s.%s (port %d)
de: %s: Socket für %s.%s (Port %d) geschlossen

source: %s%s: cannot accept client on port %d (%s.%s)
de: %s%s: Kann den Client am Port %d (%s.%s) nicht akzeptieren

source: %s%s: error with "bind" on port %d (%s.%s)
de: %s%s: Fehler mit "bind" auf Port %d (%s.%s)

source: %s: listening on port %d (relay: %s.%s, max %d clients)
de: %s: Lausche am Port %d (Relay: %s.%s, Max. %d Clients)

source: %s%s: not enough memory for listening on new port
de: %s%s: Nicht genug Speicher um an einem neuen Port zu lauschen

source: %s%s: error compiling regular expression "%s"
de: %s%s: Fehler bei der Kompilierung des regulären Ausdruckes "%s"

source: No rmodifier defined
de: Kein rmodifier definiert

source: List of rmodifiers:
de: Liste der rmodifier:

source: Default rmodifiers:
de: Standard rmodifier:

source: %s%s: error creating rmodifier "%s"
de: %s%s: Fehler bei der Erstellung von rmodifier "%s"

source: Rmodifier "%s" created
de: rmodifier "%s" erstellt

source: %d rmodifiers removed
de: %d rmodifiers entfernt

source: Rmodifier "%s" removed
de: rmodifier "%s" entfernt

source: %sRmodifier "%s" not found
de: %srmodifier "%s" nicht gefunden

source: Default rmodifiers restored:
de: Standard rmodifier wiederhergestellt

source: %sError: "-yes" argument is required for restoring default rmodifiers (security reason)
de: %sFehler: Das Argument "-yes" ist aus Sicherheitsgründen zum zurücksetzen auf die Standardeinstellungen von rmodifier notwendig.

source: alter modifier strings with regular expressions
de: wandelt Schlüsselwörter mit regulären Ausdrücken (regelt die Sichtbarkeit von Texten in WeeChat)

source: list: list all rmodifiers listdefault: list default rmodifiers add: add a rmodifier name: name of rmodifier modifiers: comma separated list of modifiers groups: action on groups found: comma separated list of groups (from 1 to 9) with optional "*" after number to hide group regex: regular expression del: delete a rmodifier -all: delete all rmodifiers default: restore default rmodifiers Examples: hide everything typed after a command /password: /rmodifier add password input_text_display 1,2* ^(/password +)(.*) delete rmodifier "password": /rmodifier del password delete all rmodifiers: /rmodifier del -all
de: list: zeigt alle rmodifier an listdefault: zeigt die Standardeinstellung für rmodifier an add: einen rmodifier hinzufügen name: Name des rmodifier modifiers: durch Kommata getrennte Liste der modifier groups: Aktion auf Gruppen anwenden: durch Kommata getrennte Liste der Gruppen (von 1 bis 9). Optional kann nach der Nummer für die Gruppe ein "*" gesetzt werden um diese Gruppe auszublenden regex: regulärer Ausdruck del: löscht einen rmodifier Eintrag -all: löscht alle rmodifiers Einträge default: setzt die rmodifier auf Standardwerte zurück Beispiele: verbirgt die Eingabe nach dem Befehl /passwort: /rmodifier add passwort input_text_display 1,2* ^(/passwort +)(.*) lösche rmodifier "passwort": /rmodifier del passwort lösche alle rmodifiers: /rmodifier del -all

source: list of rmodifiers
de: Liste der rmodifier

source: %s%s: error creating rmodifier "%s" => "%s"
de: %s%s: Fehler beim Erstellen des rmodifier "%s" => "%s"

source: char used to hide part of a string
de: Zeichen dass benutzt werden soll um bei einer Eingabe einer Zeichenkette zu verbergen

source: rmodifier name (can start or end with "*" as joker) (optional)
de: rmodifier Name (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: %s%s: unable to register script "%s" (another script already exists with this name)
de: %s%s: Skript kann nicht registriert werden. "%s" (es existiert schon ein Skript mit demselben Namen)

source: %s: registered script "%s", version %s (%s)
de: %s: registriertes Skript "%s", Version %s (%s)

source: %s%s: function "%s" must return a valid value
de: %s%s: Funktion "%s" muss einen gültigen Wert zurück geben

source: %s%s: error in function "%s"
de: %s%s: Fehler in Funktion "%s"

source: %s: loading script "%s"
de: %s: Lade das Skript "%s"

source: %s%s: function "register" not found (or failed) in file "%s"
de: %s%s: Funktion "register" nicht gefunden (oder fehlerhaft) in Datei "%s"

source: %s: unloading script "%s"
de: %s: Deinstalliere das Skript "%s"

source: %s: script "%s" unloaded
de: %s: Das Skript "%s" wurde deinstalliert

source: %s%s: script "%s" not loaded
de: %s%s: Das Skript "%s" wurde nicht installiert

source: %s%s: unknown option for command "%s"
de: %s%s: Unbekannte Option für den "%s"-Befehl

source: %s%s: unable to run function "%s"
de: %s%s: Kann die Funktion "%s" nicht ausführen

source: %s%s: script "%s" not found
de: %s%s: Skript "%s" wurde nicht gefunden

source: %s%s: unable to create new sub-interpreter
de: %s%s: Kann sub-Interpreter nicht erstellen

source: %s%s: unable to redirect stdout and stderr
de: %s%s: Umlenkung von stdout und stderr nicht möglich

source: %s%s: unable to load file "%s"
de: %s%s: Kann die Datei "%s" nicht laden

source: %s%s: unable to execute file "%s"
de: %s%s: Die Datei "%s" kann nicht ausgeführt werden

source: %s%s: function "%s" must return one valid value (%d)
de: %s%s: Die Funktion "%s" muss einen gültigen Wert zurück geben (%d)

source: %s%s: function "%s" is internally misused
de: %s%s: Funktion "%s" wird intern falsch genutzt

source: %s%s: not enough memory in function "%s"
de: %s%s Nicht genug Speicher in Funktion "%s"

source: %s%s: not enough memory to parse file "%s"
de: %s%s: Nicht genug Speicher um Datei "%s" zu analysieren

source: %s%s: unable to parse file "%s"
de: %s%s: Datei "%s" Analyse nicht möglich

source: %s%s: unable to run file "%s"
de: %s%s: Kann Datei "%s" nicht ausführen

source: %s%s: unknown error while loading file "%s"
de: %s%s: Unbekannter Fehler beim Laden der Datei "%s"

source: %s%s: unable to initialize %s
de: %s%s: Kann %s nicht initialisieren

source: %s%s: unable to initialize WeeChat module
de: %s%s: Initialisierung des WeeChat Moduls nicht möglich

source: %s%s: unable to redirect stdout
de: %s%s: Kann Standardausgabe (stdout) nicht umlenken

source: %s%s: unable to redirect stderr
de: %s%s: Kann Standardfehlerausgabe (stderr) nicht umlenken

source: path to python 2.x interpreter
de: Pfad zum Python 2.x Interpreter

source: %s%s: unable to launch global interpreter
de: %s%s: Kann globalen Interpreter nicht starten

source: %s%s: unable to get current interpreter state
de: %s%s: Kann aktuellen Status des Interpreters nicht feststellen

source: %s%s: unable to free interpreter
de: %s%s: Kann Interpreter nicht frei geben

source: %s%s: unable to read file "%s"
de: %s%s: Kann Datei "%s" nicht lesen

source: %s%s: error while loading file "%s"
de: %s%s: Fehler beim Laden der Datei "%s"

source: %s%s: function "weechat_init" is missing in file "%s"
de: %s%s: Funktion "weechat_init" fehlt in der Datei "%s"

source: %s%s: unable to eval function "weechat_init" in file "%s"
de: %s%s: Evaluation der Funktion "weechat_init" in Datei "%s" nicht möglich

source: %s%s: unable to eval WeeChat ruby internal code
de: %s%s: Evaluation des internen WeeChat Ruby Codes nicht möglich

source: list/load/unload scripts
de: auflisten/installieren/deinstallieren von Skripten

source: list: list loaded scripts listfull: list loaded scripts (verbose) load: load a script autoload: load all scripts in "autoload" directory reload: reload a script (if no name given, unload all scripts, then load all scripts in "autoload" directory) unload: unload a script (if no name given, unload all scripts) filename: script (file) to load name: a script name (name used in call to "register" function) Without argument, this command lists all loaded scripts.
de: list: installierte Erweiterungen werden aufgelistet listfull: detaillierte Auflistung aller installierten Erweiterungen load: installiert eine Erweiterung autoload: installiert automatisch alle Erweiterungen aus System- oder Benutzerverzeichnis reload: eine Erweiterung wird erneut installiert (falls kein Name angegeben wird dann werden alle Erweiterungen entfernt und erneut installiert) unload: deinstalliert eine oder alle Erweiterungen filename: Skript (Datei) das geladen werden soll name: Name eines Skripts (Name welcher mit der "register" Funktion genutzt wird) Ohne Angabe eines Argumentes listet /plugin alle geladenen Erweiterungen auf.

source: list of scripts
de: Liste der Skripten

source: script pointer (optional)
de: Skript Pointer (optional)

source: script name (can start or end with "*" as wildcard) (optional)
de: Name des Skripts (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: %s: error loading script "%s" (bad name, spaces are forbidden)
de: %s: Fehler beim Laden des Skripts "%s" (fehlerhafter Name: Leerzeichen sind nicht erlaubt)

source: %s%s: warning, license "%s" for script "%s" differs from plugin license ("%s")
de: %s%s: Warnung, die Lizenz "%s" für das Skript "%s" unterscheidet sich von der Lizenz der Erweiterungen ("%s")

source: %s: error loading script "%s" (not enough memory)
de: %s: Kann Erweiterung "%s" nicht laden (Speichermangel)

source: %s: script removed: %s
de: %s: Skript entfernt: %s

source: %s%s: failed to remove script: %s (%s)
de: %s%s: Fehler beim Entfernen des Skripts: %s (%s)

source: %s: script "%s" not found, nothing was removed
de: %s: Skript "%s" wurde nicht gefunden. Es konnte nichts entfernt werden

source: %s%s: failed to move script %s to %s (%s)
de: %s%s: Fehler beim Verschieben des Skripts %s nach %s (%s)

source: %s scripts loaded:
de: Installierte "%s" Skripten:

source: file: %s
de: Datei: %s

source: written by "%s", license: %s
de: geschrieben von "%s", Lizenz: %s

source: (none)
de: (keine)

source: %s: scripts unloaded
de: %s: Skripten deinstalliert

source: %s%s: unable to call function "%s", script is not initialized (script: %s)
de: %s%s: Die Funktion "%s" kann nicht ausführen werden. Skript ist nicht initialisiert (Skript: %s)

source: %s%s: wrong arguments for function "%s" (script: %s)
de: %s%s: Fehlerhafte Argumente für die Funktion "%s" (Skript: %s)

source: %s%s: unable to run function "%s": %s
de: %s%s: Kann Funktion "%s" nicht ausführen: %s

source: %s%s: unable to create new interpreter
de: %s%s: Neuer Interpreter kann nicht anlegt werden

source: %s%s: error occurred while parsing file "%s": %s
de: %s%s: Beim Parsen der Datei "%s" ist ein Fehler aufgetreten: %s

source: [A] Accept
de: [A] annehmen

source: [C] Cancel
de: [C] abbrechen

source: xfer chat
de: Transfer (xfer) Chat

source: Xfer list
de: Tranfer (xfer) Liste

source: waiting
de: warte

source: active
de: aktiv

source: done
de: fertig

source: failed
de: fehlgeschlagen

source: aborted
de: abgebrochen

source: %s%s: file %s %s %s: %s
de: %s%s: Datei %s %s %s: %s

source: sent to
de: gesendet an

source: received from
de: empfangen von

source: FAILED
de: FEHLGESCHLAGEN

source: %s: chat closed with %s (%d.%d.%d.%d)
de: %s: Chat mit %s (%d.%d.%d.%d) geschlossen

source: %s%s: not enough memory for new xfer
de: %s%s: Für einen neuen Transfer steht nicht ausreichend Speicher zur Verfügung

source: %s: incoming file from %s (%s.%s), ip: %d.%d.%d.%d, name: %s, %llu bytes (protocol: %s)
de: %s: eingehende Datei von %s (%s.%s), IP: %d.%d.%d.%d, Name: %s, %llu Bytes (Protokoll: %s)

source: %s: sending file to %s (%s.%s): %s (local filename: %s), %llu bytes (protocol: %s)
de: %s: Sende Datei an %s (%s.%s): %s (lokaler Dateiname: %s), %llu Bytes (Protokoll: %s)

source: %s: incoming chat request from %s (%s.%s), ip: %d.%d.%d.%d
de: %s: eingehende Chatanforderung von %s (%s.%s), ip: %d.%d.%d.%d

source: %s: sending chat request to %s (%s.%s)
de: %s: Sende Chatanforderung an: %s (%s.%s)

source: %s: file %s (local filename: %s) will be resumed at position %llu
de: %s: Datei %s (lokaler Dateiname: %s) wird an Position %llu fortgesetzt

source: %s%s: missing arguments (%s)
de: %s%s: fehlende Argumente (%s)

source: %s%s: unknown xfer type "%s"
de: %s%s: Unbekannter Transfer-Typ "%s"

source: %s%s: unknown xfer protocol "%s"
de: %s%s: Unbekanntes Transfer-Protokoll "%s"

source: %s%s: cannot access file "%s"
de: %s%s: Es kann nicht auf die Datei "%s" zugreifen werden

source: %s%s: could not find address for "%s", falling back to local IP
de: %s%s: Kann die Adresse für "%s" nicht finden. Greife auf lokale IP zurück.

source: %s%s: cannot create socket for xfer
de: %s%s: Für den Transfer konnte kein Socket angelegt werden
