Repository: weechatter/weechat-scripts
Catalog: po/*.po
Languages: de

source: server name (can start or end with "*" as wildcard) (optional)
de: Servername (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: list of channels for an IRC server
de: Liste der Channels eines IRC-Servers

source: server,channel (channel is optional)
de: Server,Channel (Channel ist optional)

source: list of nicks for an IRC channel
de: Liste der Nicks im IRC-Channel

source: server,channel,nick (channel and nick are optional)
de: Server,Channel,Nick (Channel und Nick sind optional)

source: list of IRC ignores
de: Liste von ignorierten IRCs

source: list of notify
de: Liste mit Benachrichtigungen

source: notify pointer (optional)
de: Benachrichtigungspointer (optional)

source: irc ignore
de: IRC ignorieren

source: irc notify
de: IRC-Benachrichtigungen

source: pattern for irc redirect
de: Muster für IRC Umlenkung

source: irc redirect
de: IRC Umlenkung

source: %s%s: you are not connected to server
de: %s%s: Es besteht keine Verbindung zum Server

source: %s%s: this buffer is not a channel!
de: %s%s: Dieser Buffer ist kein Channel!

source: Notify list for %s%s%s:
de: Benachrichtigungsliste für %s%s%s:

source: Notify list is empty on this server
de: Es existiert keine Benachrichtigung für diesen Server

source: Notify list for all servers:
de: Benachrichtigungen für alle Server:

source: Notify list is empty on all servers
de: Es existiert keine Benachrichtigung für Server

source: %snotify: %s%s%s has joined %s%s
de: %snotify: %s%s%s hat sich am Server %s%s angemeldet

source: %snotify: %s%s%s has quit %s%s
de: %snotify: %s%s%s hat sich vom Server %s%s abgemeldet

source: %snotify: %s%s%s is now away: "%s"
de: %snotify: %s%s%s ist nun abwesend: "%s

source: %snotify: %s%s%s is back
de: %snotify: %s%s%s ist zurück

source: %snotify: %s%s%s is still away: "%s"
de: %snotify: %s%s%s ist weiterhin abwesend: "%s"

source: %s%s: error building answer for SASL authentication, using mechanism "%s"
de: %s%s: Fehler beim Erstellen der Antwort für die SASL Authentifizierung. "%s" Mechanismus wurde genutzt.

source: %s%s: client capability, server supports: %s
de: %s%s: Client Fähigkeit, Server unterstützt: %s

source: %s%s: client capability, requesting: sasl
de: %s%s: Client Fähigkeit, Anfrage: SASL

source: %s%s: client capability: sasl not supported
de: %s%s: Client Fähigkeit: SASL wird nicht unterstützt

source: %s%s: client capability, enabled: %s
de: %s%s: Client Fähigkeit, aktiviert: %s

source: %s%s: cannot authenticate with SASL and mechanism DH-BLOWFISH because WeeChat was not built with libgcrypt support
de: %s%s Authentifizierung mittels SASL und DH-BLOWFISH Mechanismus nicht möglich, da WeeChat nicht mit libgcrypt Unterstützung erstellt wurde

source: %s%s: client capability, refused: %s
de: %s%s: Client Fähigkeit, abgewiesen: %s

source: %sYou have been invited to %s%s%s by %s%s%s
de: %sDu bist in den Channel %s%s%s von %s%s%s eingeladen worden

source: %s%s: cannot create new channel "%s"
de: %s%s: Konnte den neuen Channel "%s" nicht erzeugen

source: %s%s%s%s%s%s%s%s%s%s has joined %s%s%s
de: %s%s%s%s%s%s%s%s%s%s ist in den Channel %s%s%s gekommen

source: %s%s%s%s has kicked %s%s%s %s(%s%s%s)
de: %s%s%s%s hat %s%s%s gekickt %s(%s%s%s)

source: %s%s%s%s has kicked %s%s%s
de: %s%s%s%s hat %s%s%s gekickt

source: %s%sYou were killed by %s%s%s %s(%s%s%s)
de: %s%sDu wurdest durch %s%s%s gekillt %s(%s%s%s)

source: %s%sYou were killed by %s%s%s
de: %s%sDu wurdest durch %s%s%s gekillt

source: %sMode %s%s %s[%s%s%s]%s by %s%s
de: %sModus %s%s %s[%s%s%s]%s durch %s%s

source: %sUser mode %s[%s%s%s]%s by %s%s
de: %sUsermodus %s[%s%s%s]%s von %s%s

source: %sYou are now known as %s%s%s
de: %sDu bist nun als %s%s%s bekannt

source: %s%s%s%s is now known as %s%s%s
de: %s%s%s%s ist nun als %s%s%s bekannt

source: %s%s%s%s%s%s%s%s%s%s has left %s%s%s %s(%s%s%s)
de: %s%s%s%s%s%s%s%s%s%s verließ %s%s%s %s(%s%s%s)

source: %s%s%s%s%s%s%s%s%s%s has left %s%s%s
de: %s%s%s%s%s%s%s%s%s%s verließ %s%s%s

source: %s%s%s%s%s%s%s%s%s%s has quit %s(%s%s%s)
de: %s%s%s%s%s%s%s%s%s%s hat den IRC verlassen %s(%s%s%s)

source: %s%s%s%s%s%s%s%s%s%s has quit
de: %s%s%s%s%s%s%s%s%s%s hat den IRC verlassen

source: %s%s: "%s" command received without channel
de: %s%s: Der Befehl "%s" wurde ohne Channel empfangen

source: %s%s%s%s has changed topic for %s%s%s from "%s%s%s" to "%s%s%s"
de: %s%s%s%s hat das Thema für den Channel %s%s%s von "%s%s%s" auf "%s%s%s" geändert.

source: %s%s%s%s has changed topic for %s%s%s to "%s%s%s"
de: %s%s%s%s hat das Thema für den Channel %s%s%s auf "%s%s%s" gesetzt.

source: %s%s%s%s has unset topic for %s%s%s (old topic: "%s%s%s")
de: %s%s%s%s hat das Thema für %s%s%s zurückgesetzt (altes Thema: "%s%s%s")

source: %s%s%s%s has unset topic for %s%s%s
de: %s%s%s%s hat das Thema von %s%s%s entfernt

source: %sWallops from %s%s %s(%s%s%s)%s: %s
de: %sWallops von %s%s %s(%s%s%s)%s: %s

source: %sUser mode for %s%s%s is %s[%s%s%s]
de: %sUsermodus für %s%s%s ist %s[%s%s%s]

source: %s%s[%s%s%s]%s is away: %s
de: %s%s[%s%s%s]%s ist abwesend: %s

source: %sUsers online: %s%s
de: %sUser online: %s%s

source: %s%s[%s%s%s] (%s%s@%s%s)%s was %s
de: %s%s[%s%s%s] (%s%s@%s%s)%s war %s

source: %s%s[%s%s%s]%s idle: %s%d %s%s, %s%02d %s%s %s%02d %s%s %s%02d %s%s, signon at: %s%s
de: %s%s[%s%s%s]%s idle: %s%d %s%s, %s%02d %s%s %s%02d %s%s %s%02d %s%s, angemeldet am: %s%s

source: hour
de: Stunde

source: %s%s[%s%s%s]%s idle: %s%02d %s%s %s%02d %s%s %s%02d %s%s, signon at: %s%s
de: %s%s[%s%s%s]%s Idle: %s%02d %s%s %s%02d %s%s %s%02d %s%s, angemeldet am: %s%s

source: %sMode %s%s %s[%s%s%s]
de: %sModus %s%s %s[%s%s%s]

source: %sURL for %s%s%s: %s
de: %sURL für %s%s%s: %s

source: %sChannel created on %s
de: %sChannel erstellt am %s

source: %sChannel %s%s%s created on %s
de: %sChannel %s%s%s erstellt am %s

source: %sNo topic set for channel %s%s
de: %sKein Thema für %s%s gesetzt

source: %sTopic for %s%s%s is "%s%s"
de: %sDas Thema von %s%s%s lautet: "%s%s"

source: %sTopic set by %s%s%s%s%s%s%s%s%s on %s
de: %sThema wurde festgelegt von %s%s%s%s%s%s%s%s%s am %s

source: %sTopic set on %s
de: %sThema festgelegt am %s

source: %sTopic for %s%s%s set by %s%s%s%s%s%s%s%s%s on %s
de: %sThema für %s%s%s festgelegt von %s%s%s%s%s%s%s%s%s am %s

source: %sTopic for %s%s%s set on %s
de: %sDas Thema von %s%s%s wurde festgelegt am: %s

source: %s%s%s%s has invited %s%s%s to %s%s%s
de: %s%s%s%s hat %s%s%s in den Channel %s%s%s eingeladen

source: %s%s[%s%s%s] %s%s%s invited by %s%s %s(%s%s%s)%s on %s
de: %s%s[%s%s%s] %s%s%s wurde von %s%s %s(%s%s%s)%s eingeladen am %s

source: %s%s[%s%s%s] %s%s%s invited by %s%s %s(%s%s%s)
de: %s%s[%s%s%s] %s%s%s wurde von %s%s %s(%s%s%s) eingeladen

source: %s%s[%s%s%s]%s exception %s%s%s by %s%s %s(%s%s%s)%s on %s
de: %s%s[%s%s%s]%s Exception %s%s%s von %s%s %s(%s%s%s)%s auf %s

source: %s%s: cannot create nick "%s" for channel "%s"
de: %s%s: Der Nick "%s" für den Channel "%s" konnte nicht angelegt werden

source: op
de: Operator

source: halfop
de: Halb-Operator

source: voice
de: ge-voice-ter

source: %s%s[%s%s%s] %s%s%s banned by %s%s %s(%s%s%s)%s on %s
de: %s%s[%s%s%s] %s%s%s wurde gebannt von %s%s %s(%s%s%s)%s auf %s

source: %s%s[%s%s%s] %s%s%s banned by %s%s %s(%s%s%s)
de: %s%s[%s%s%s] %s%s%s wurde gebannt von %s%s %s(%s%s%s)

source: %s%s: all declared nicknames are already in use or invalid, closing connection with server
de: %s%s: Alle eingestellten Nicknames sind bereits in Verwendung, Verbindung wird getrennt!

source: %s%s: nickname "%s" is invalid, trying nickname #%d ("%s")
de: %s%s: Nickname "%s" ist ungültig, versuche Nickname #%d ("%s")

source: %s%s: all declared nicknames are already in use, closing connection with server
de: %s%s: Alle voreingestellten Nicknamen werden zur Zeit schon genutzt. Verbindung wird getrennt

source: %s: nickname "%s" is already in use, trying nickname #%d ("%s")
de: %s: Der Nickname "%s" wird bereits verwendet. Versuche nun #%d ("%s") als neuen Nicknamen zu nutzen

source: %s%s: nickname "%s" is unavailable, trying nickname #%d ("%s")
de: %s%s: Der Nickname "%s" ist nicht verfügbar. Versuche nun den Nicknamen #%d ("%s")

source: %s%s: command "%s" not found:
de: %s%s: Befehl "%s" nicht gefunden:

source: %s%s: failed to parse command "%s" (please report to developers):
de: %s%s: Kann den Befehl "%s" nicht parsen (bitte melden Sie das den Entwicklern):

source: %s%s: too few arguments received from IRC server for command "%s" (received: %d arguments, expected: at least %d)
de: %s%s: Zu wenige Argumente vom IRC-Server für den Befehl "%s" erhalten (Empfangen: %d Argumente, Erwartet: mindestens %d)

source: %s%s: "%s" command received without host
de: %s%s: "%s"-Befehl empfangen ohne Host

source: IRC raw messages
de: IRC Roh-Nachricht

source: %s%s: missing argument "%s" for redirect pattern
de: %s%s: fehlendes Argument, "%s", für Umlenkungsmuster

source: %s%s: redirect pattern "%s" already exists
de: %s%s: Muster "%s" existiert bereits für eine Umlenkung

source: %s%s: no connection to server "%s" for redirect
de: %s%s: Keine Verbindung zum Server "%s" um eine Umlenkung zu erstellen

source: %s%s: missing argument "%s" for redirect
de: %s%s: fehlendes Argument, "%s", für Umlenkung

source: %s%s: redirect pattern "%s" not found
de: %s%s: Muster "%s" für eine Umlenkung nicht gefunden

source: %s: starting redirection for command "%s" on server "%s" (redirect pattern: "%s")
de: %s: führe eine Umlenkung für den Befehl "%s" auf dem Server "%s" aus (Muster der Umlenkung: "%s")

source: %s%s: server "%s" not found for redirect
de: %s%s: Server "%s" für eine Umlenkung wurde nicht gefunden

source: %s%s: error when allocating new server
de: %s%s: Neuer Server konnte nicht alloziert werden

source: %s%s: error creating new server "%s"
de: %s%s: Fehler beim Erstellen des neuen Servers "%s"

source: %s%s: sending data to server: null pointer (please report problem to developers)
de: %s%s: Sende Daten an Server: NULL-Pointer (bitte melden Sie das Problem den Entwicklern)

source: %s%s: sending data to server: empty buffer (please report problem to developers)
de: %s%s: Sende Daten an Server: leerer Buffer (bitte melden Sie das Problem den Entwicklern)

source: %s%s: sending data to server: %d %s
de: %s%s: Sende Daten an Server: %d %s

source: (message dropped)
de: (Nachricht verworfen)

source: %s%s: not enough memory for received message
de: %s%s: Nicht genügend Speicher vorhanden um Nachricht zu Empfangen.

source: %s%s: reading data on socket: error %d %s
de: %s%s: Lese Daten von Socket: Fehler %d %s

source: (connection closed by peer)
de: (Verbindung wurde durch Peer getrennt)

source: %s: disconnecting from server...
de: %s: Trennung vom Server...

source: %s%s: connection timeout (message 001 not received)
de: %s%s: Zeitüberschreitung bei Verbindungsversuch (message 001 nicht empfangen)

source: %s%s: sasl authentication timeout
de: %s%s: Zeitüberschreitung bei SASL Authentifizierung

source: %s: lag is high, disconnecting from server...
de: %s: Verzögerung ist zu hoch, die Verbindung wird getrennt...

source: %s: reconnecting to server in %d %s, %d %s
de: %s: Verbinde erneut zum Server in %d %s, %d %s

source: %s: reconnecting to server in %d %s
de: %s: Verbinde erneut zum Server in %d %s

source: %s: switching address to %s/%d
de: %s: Wechsel Adresse zu %s/%d

source: %s: connected to %s/%d (%s)
de: %s: Verbindung zu %s/%d (%s) hergestellt

source: %s%s: proxy address "%s" not found
de: %s%s: Proxy-Adresse "%s" nicht gefunden

source: %s%s: address "%s" not found
de: %s%s: Adresse "%s" nicht gefunden

source: %s%s: error: %s
de: %s%s: Fehler: %s

source: %s%s: proxy IP address not found
de: %s%s: Proxy-IP-Adresse nicht gefunden

source: %s%s: IP address not found
de: %s%s: IP-Adresse nicht gefunden

source: %s%s: proxy connection refused
de: %s%s: Proxy-Verbindung verweigert

source: %s%s: connection refused
de: %s%s: Verbindungsaufbau verweigert

source: %s%s: proxy fails to establish connection to server (check username/password if used and if server address/port is allowed by proxy)
de: %s%s: Der Proxy konnte die Verbindung zum Server nicht aufbauen (bitte Benutzername/Passwort überprüfen und ob Server Adresse/Port für Proxy freigeschaltet ist)

source: %s%s: unable to set local hostname/IP
de: %s%s: Kann lokalen Hostname/IP nicht festlegen

source: %s%s: TLS init error
de: %s%s: TLS Initialisierungsfehler

source: %s%s: TLS handshake failed
de: %s%s: TLS Handshake fehlgeschlagen

source: %s%s: you should play with option irc.server.%s.ssl_dhkey_size (current value is %d)
de: %s%s: Der Wert für die Option irc.server.%s.ssl_dhkey_size sollte angepasst werden (zur Zeit genutzter Wert: %d)

source: %s%s: not enough memory
de: %s%s: Nicht genügend Speicher

source: gnutls: connected using %d-bit Diffie-Hellman shared secret exchange
de: gnutls: Verbindung mittels geheimen %d-Bit Diffie-Hellman Schlüssels hergestellt.

source: %sgnutls: error while checking peer's certificate
de: %sgnutls: Fehler bei der Überprüfung des Peer-Zertifikates.

source: %sgnutls: peer's certificate is NOT trusted
de: %sgnutls: Peer Zertifikat ist NICHT vertrauenswürdig.

source: gnutls: peer's certificate is trusted
de: gnutls: Peer Zertifikat ist vertrauenswürdig.

source: %sgnutls: peer's certificate issuer is unknown
de: %sgnutls: Der Aussteller für das Peer-Zertifikat ist unbekannt.

source: %sgnutls: the certificate has been revoked
de: %sgnutls: Das Zertifikat wurde widerrufen.

source: gnutls: receiving %d certificate
de: gnutls: Empfange %d Zertifikat

source: - certificate[%d] info:
de: - Zertifikat [%d] Information:

source: %sgnutls: certificate has expired
de: %sgnutls: Die Gültigkeitsdauer des Zertifikates ist abgelaufen.

source: %sgnutls: certificate is not yet activated
de: %sgnutls: Zertifikat ist noch nicht freigeschaltet

source: %sgnutls: the hostname in the certificate does NOT match "%s"
de: %sgnutls: Der Hostname im Zertifikat "%s" stimmt NICHT überein.

source: gnutls: sending one certificate
de: gnutls: sende ein Zertifikat

source: %sgnutls: invalid certificate "%s", error: %s
de: %sgnutls: ungültiges Zertifikat "%s". Fehler: %s

source: - client certificate info (%s):
de: - Client Zertifikate-Information (%s):

source: %sgnutls: unable to read certifcate "%s"
de: %sgnutls: Kann das Zertifikat "%s" nicht lesen

source: %s%s: unknown address server "%s", cannot connect
de: %s%s: unbekannte Adresse für Server "%s". Es kann keine Verbindung hergestellt werden

source: %s%s: proxy "%s" not found for server "%s", cannot connect
de: %s%s: Proxy "%s" für Server "%s" nicht gefunden, kann keine Verbindung herstellen

source: %s%s: missing proxy settings, check options for proxy "%s"
de: %s%s: Fehlende Proxy-Einstellungen. Überprüfe Optionen für Proxy "%s"

source: %s%s: nicks not defined for server "%s", cannot connect
de: %s%s Nicknamen für den Server "%s" nicht definiert, kann keine Verbindung herstellen

source: %s%s: cannot connect with SSL because WeeChat was not built with GnuTLS support
de: %s%s SSL-Verbindung nicht möglich da WeeChat nicht mit GNUtls-Support kompiliert wurde

source: %s: connecting to server %s/%d%s%s via %s proxy %s/%d%s...
de: %s: Verbinden zum Server %s%d%s%s via %s-Proxy %s%d%s...

source: Connecting to server %s/%d%s%s via %s proxy %s/%d%s...
de: Verbinden zum Server %s%d%s%s via %s-Proxy %s%d%s...

source: %s: connecting to server %s/%d%s%s...
de: %s: Verbinden zum Server %s%d%s%s...

source: %s%s: connecting to server %s/%d%s%s...
de: %s%s: Verbinden zum Server %s%d%s%s...

source: %s%s: cannot create socket
de: %s%s: Socket konnte nicht angelegt werden

source: %s%s: cannot set socket option "SO_REUSEADDR"
de: %s%s Fehler beim Erstellen der Socket-Option "SO_REUSEADDR"

source: %s%s: cannot set socket option "SO_KEEPALIVE"
de: %s%s Fehler beim Erstellen der Socket-Option "SO_KEEPALIVE"

source: %s: reconnecting to server...
de: %s: Neuverbinden zum Server...

source: %s%s: disconnected from server
de: %s%s: Vom Server getrennt!

source: %s: disconnected from server
de: %s: Vom Server getrennt!

source: %s%s: unable to find filename mask for buffer "%s", logging is disabled for this buffer
de: %s%s: Es existiert keine Dateinamen-Maske für den Buffer "%s", Protokollierung ist für diesen Buffer ausgeschaltet

source: %s%s: unable to start logging for buffer "%s": filename "%s" is already used by another buffer (check your log settings)
de: %s%s: Protokollierung für "%s" kann nicht vorgenommen werden: Die Datei "%s" wird schon durch einen anderen Buffer verwendet (Bitte Protokoll-Konfiguration überprüfen)

source: %s%s: unable to create directory for logs ("%s")
de: %s%s: Verzeichnis für Protokoll-Dateien kann nicht erstellt werden ("%s")

source: %s%s: unable to write log file "%s"
de: %s%s: Protokoll-Datei "%s" kann nicht geschrieben werden

source: %s **** Beginning of log ****
de: %s **** Beginn der Protokoll-Datei ****

source: %s **** End of log ****
de: %s **** Ende der Protokoll-Datei ****

source: Logging on buffers:
de: Protokollieren der Buffer:

source: logging (level: %d)
de: Protokolliere (Level: %d)

source: not logging
de: nicht protokollieren

source: log not started
de: Protokollierung wurde nicht gestartet

source: === ========== End of backlog (%d lines) ==========
de: === ========== Ende der Rückverfolgung (%d Zeilen) ==========

source: logger plugin configuration
de: Konfiguration für "logger" Erweiterung (dient zum protokollieren der Buffer)

source: list: show logging status for opened buffers set: set logging level on current buffer level: level for messages to be logged (0 = logging disabled, 1 = a few messages (most important) .. 9 = all messages) disable: disable logging on current buffer (set level to 0) Options "logger.level.*" and "logger.mask.*" can be used to set level or mask for a buffer, or buffers beginning with name. Log levels used by IRC plugin: 1: user message, notice, private 2: nick change 3: server message 4: join/part/quit 9: all other messages Examples: set level to 5 for current buffer: /logger set 5 disable logging for current buffer: /logger disable set level to 3 for all IRC buffers: /set logger.level.irc 3 disable logging for main WeeChat buffer: /set logger.level.core.weechat 0 use a directory per IRC server and a file per channel inside: /set logger.mask.irc "$server/$channel.weechatlog"
de: list: zeigt, für geöffnete Buffer, den Status der Protokollierung an set: legt den Level fest, nach dem der aktuelle Buffer protokolliert werden soll level: legt fest, welche Nachrichten protokolliert werden sollen (0 = nichts protokollieren, 1 = nur die wichtigsten Nachrichten protokollieren .. 9 = protokolliere alle Nachrichten) disable: die Protokollierung wird für den aktuellen Buffer ausgeschaltet (der Level wird auf 0 gestellt) Die Optionen "logger.level.*" und "logger.mask.*" können genutzt werden um den Level der Protokollierung festzulegen und um eine Maske für einen oder mehrere Buffer zu definieren. Level der Protokollierung, die die IRC Erweiterung unterstützt: 1: Nachrichten von Usern, private Nachrichten und Bemerkungen 2: Wechsel von Nicks (/nick) 3: Nachrichten vom Server 4: join/part/quit Nachrichten 9: alle Nachrichten Beispiele: Stellt den Level für den aktuellen Buffer auf 5 ein: /logger set 5 Die Protokollierung für den aktuellen Buffer wird ausgeschaltet: /logger disable Stellt den Level für alle IRC-Buffer auf 3 ein: /set logger.level.irc 3 Die Protokollierung, für den WeeChat Haupt-Buffer, wird deaktiviert: /set logger.level.core.weechat 0 Für jeden IRC-Server wird ein separates Verzeichnis erstellt und darin eine eigene Protokoll-Datei, für jeden Channel: /set logger.mask.irc "$server/$channel.weechatlog"

source: logging level for this buffer (0 = logging disabled, 1 = a few messages (most important) .. 9 = all messages)
de: Level der Protokollierung für diesen Buffer (0 = nichts protokollieren, 1 = nur die wichtigsten Nachrichten protokollieren .. 9 = protokolliere alle Nachrichten)

source: file mask for log file; local buffer variables are permitted
de: Dateimaske für Protokoll-Datei; lokale Buffer-Variablen sind dabei erlaubt

source: maximum number of lines to display from log file when creating new buffer (0 = no backlog)
de: maximale Anzahl der Zeilen die aus der Protokoll-Datei dargestellt werden sollen, wenn ein Buffer geöffnet wird (0 = kein Darstellung)

source: automatically save content of buffers to files (unless a buffer disables log)
de: Speichert automatisch den Inhalt eines Buffers in eine Datei (sofern das Protokollieren für den Buffer nicht deaktiviert sein sollte)

source: number of seconds between flush of log files (0 = write in log files immediately for each line printed)
de: Zeit, in Sekunden, die verstreicht bis eine Protokolldatei gesichert werden soll (0 = Protokolldatei wird unmittelbar gesichert, nachdem eine neue Zeile dargestellt wurde)

source: use only lower case for log filenames
de: Benutze ausschließlich Kleinschreibung für Protokoll-Dateien

source: path for WeeChat log files; "%h" at beginning of string is replaced by WeeChat home ("~/.weechat" by default); date specifiers are permitted (see man strftime)
de: Pfad für WeeChat Protokolldateien; "%h" wird durch das WeeChat Verzeichnis ersetzt (Standardpfad: "~/.weechat"); eine Datumsspezifikation ist zulässig (siehe: man strftime)

source: default file name mask for log files (format is "directory/to/file" or "file", without first "/" because "path" option is used to build complete path to file); local buffer variables are permitted; date specifiers are permitted (see man strftime)
de: Standardmaske für Protokolldateien (Format: "Verzeichnis/zu/Datei" oder "Datei", ohne ein führendes "/", da die "Verzeichnis" Option genutzt wird um vollständige Verzeichnisstrukturen zu erstellen); lokale Buffer Variablen und Datumsspezifikationen (siehe: man strftime) sind zulässig

source: replacement char for special chars in filename built with mask (like directory delimiter)
de: Ersatzzeichen für Dateinamen, falls der Dateiname Sonderzeichen beinhaltet (z.B. das Trennzeichen bei Verzeichnissen "/")

source: write information line in log file when log starts or ends for a buffer
de: Fügt eine Information in die Protokoll-Datei ein, falls die Protokollierung gestartet oder beendet wird

source: timestamp used in log files (see man strftime for date/time specifiers)
de: Zeitstempel in Protokoll-Datei nutzen (bitte dazu die Anleitung zu "strftime" (man strftime) durchlesen)

source: list of logger buffers
de: Liste der protokollierten Buffer

source: WeeChat version (as number)
de: WeeChat Version (als Nummer)

source: WeeChat compilation date
de: Datum der WeeChat Kompilierung

source: directory separator
de: Verzeichnis-Trennzeichen

source: WeeChat directory
de: WeeChat Verzeichnis

source: WeeChat "lib" directory
de: WeeChat "lib" Verzeichnis

source: WeeChat "share" directory
de: WeeChat "share" Verzeichnis

source: WeeChat "locale" directory
de: "lokales" Verzeichnis von WeeChat

source: WeeChat site
de: WeeChat Seite

source: WeeChat site, download page
de: Download-Seite von WeeChat

source: 1 if WeeChat is upgrading (command `/upgrade`)
de: 1 falls WeeChat ein Upgrade durchführt (Befehl `/upgrade`)

source: terminal charset
de: Terminal Zeichensatz

source: WeeChat internal charset
de: Interner WeeChat Zeichensatz

source: keyboard inactivity (seconds)
de: Inaktivität der Tastatur (Sekunden)

source: 1 if filters are enabled
de: 1, falls Filter aktiviert sind

source: 1 if cursor mode is enabled
de: 1, falls Cursor-Modus aktiviert ist

source: list of bars
de: Auflistung der Bars

source: bar name (can start or end with "*" as wildcard) (optional)
de: Bar Name (darf mit einem "*" als Platzhalter beginnen oder enden) (optional)

source: list of bar items
de: Liste der Bar-Items
